
var zNodes =  [
    {
        "id" : 1,
        "pId" : "20111062",
        "name" : "基础知识积累与运用",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 2,
        "pId" : "1",
        "name" : "字词",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 3,
        "pId" : "2",
        "name" : "字母",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 4,
        "pId" : "2",
        "name" : "拼音",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 5,
        "pId" : "2",
        "name" : "多音字辨析",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 6,
        "pId" : "2",
        "name" : "同音字辨析",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 7,
        "pId" : "2",
        "name" : "汉字的结构",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 8,
        "pId" : "2",
        "name" : "形近字辨析",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 9,
        "pId" : "2",
        "name" : "改正错别字",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 10,
        "pId" : "2",
        "name" : "写字",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 11,
        "pId" : "2",
        "name" : "成语",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 12,
        "pId" : "2",
        "name" : "感情色彩",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 13,
        "pId" : "2",
        "name" : "近义词，反义词",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 14,
        "pId" : "2",
        "name" : "辨析解释词义，辨析解释字义",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 15,
        "pId" : "2",
        "name" : "词语搭配",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 16,
        "pId" : "2",
        "name" : "关联词语",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 17,
        "pId" : "2",
        "name" : "词语的结构",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 18,
        "pId" : "2",
        "name" : "排列词序",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 19,
        "pId" : "2",
        "name" : "组词",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 20,
        "pId" : "2",
        "name" : "词性",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 21,
        "pId" : "2",
        "name" : "词语的分类",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 22,
        "pId" : "2",
        "name" : "查字典",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 23,
        "pId" : "1",
        "name" : "句子",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 24,
        "pId" : "23",
        "name" : "造句",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 25,
        "pId" : "23",
        "name" : "仿写句子",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 26,
        "pId" : "23",
        "name" : "扩写句子",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 27,
        "pId" : "23",
        "name" : "改写句子",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 28,
        "pId" : "23",
        "name" : "补充句子",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 29,
        "pId" : "23",
        "name" : "连词成句",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 30,
        "pId" : "23",
        "name" : "缩写句子",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 31,
        "pId" : "23",
        "name" : "理解句子",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 32,
        "pId" : "23",
        "name" : "排列句子顺序",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 33,
        "pId" : "23",
        "name" : "翻译句子",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 34,
        "pId" : "23",
        "name" : "重音",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 35,
        "pId" : "23",
        "name" : "病句辨析",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 36,
        "pId" : "23",
        "name" : "修辞方法",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 37,
        "pId" : "23",
        "name" : "句式",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 38,
        "pId" : "23",
        "name" : "对联",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 39,
        "pId" : "23",
        "name" : "标点符号",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 40,
        "pId" : "23",
        "name" : "语句停顿",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 41,
        "pId" : "23",
        "name" : "书写格式",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 42,
        "pId" : "23",
        "name" : "说明方法",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 43,
        "pId" : "23",
        "name" : "描写方法",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 44,
        "pId" : "23",
        "name" : "语气",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 45,
        "pId" : "1",
        "name" : "识记",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 46,
        "pId" : "45",
        "name" : "诗词默写",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 47,
        "pId" : "45",
        "name" : "文史常识",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 48,
        "pId" : "45",
        "name" : "歇后语，谚语，俗语，名言警句，格言",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 49,
        "pId" : "45",
        "name" : "课文理解，课文背诵",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 50,
        "pId" : "20111062",
        "name" : "语言表达及应用",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 51,
        "pId" : "50",
        "name" : "口语交际，情景写话",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 52,
        "pId" : "50",
        "name" : "实践活动",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 53,
        "pId" : "50",
        "name" : "综合读写",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 54,
        "pId" : "20111062",
        "name" : "阅读理解及鉴赏",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 55,
        "pId" : "54",
        "name" : "诗词鉴赏",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 56,
        "pId" : "54",
        "name" : "文言文阅读",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 57,
        "pId" : "54",
        "name" : "现代文阅读",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 58,
        "pId" : "20111062",
        "name" : "写作",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 59,
        "pId" : "58",
        "name" : "看图写话",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 60,
        "pId" : "58",
        "name" : "应用文",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 61,
        "pId" : "58",
        "name" : "小练笔",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 62,
        "pId" : "58",
        "name" : "大作文",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 63,
        "pId" : "20111063",
        "name" : "整数部分",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 64,
        "pId" : "63",
        "name" : "数的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 65,
        "pId" : "64",
        "name" : "数一数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 66,
        "pId" : "64",
        "name" : "比一比",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 67,
        "pId" : "64",
        "name" : "1—5的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 68,
        "pId" : "64",
        "name" : "0的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 69,
        "pId" : "64",
        "name" : "6—10的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 70,
        "pId" : "64",
        "name" : "顺序（基数词，序数词）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 71,
        "pId" : "64",
        "name" : "10以内数的比较大小",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 72,
        "pId" : "64",
        "name" : "合与分",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 73,
        "pId" : "64",
        "name" : "20以内的数的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 74,
        "pId" : "64",
        "name" : "20以内数的比较大小",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 75,
        "pId" : "64",
        "name" : "100以内的数的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 76,
        "pId" : "64",
        "name" : "100以内的数的读法和写法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 77,
        "pId" : "64",
        "name" : "认识千以内的数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 78,
        "pId" : "64",
        "name" : "千以内数的读法和写法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 79,
        "pId" : "64",
        "name" : "千以内数的比较大小",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 80,
        "pId" : "64",
        "name" : "万以内的数的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 81,
        "pId" : "64",
        "name" : "万以内数的读法和写法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 82,
        "pId" : "64",
        "name" : "数位顺序表",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 83,
        "pId" : "64",
        "name" : "万以内数的比较大小",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 84,
        "pId" : "64",
        "name" : "整数的近似数及改写",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 85,
        "pId" : "64",
        "name" : "大数的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 86,
        "pId" : "64",
        "name" : "亿以内数的读法和写法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 87,
        "pId" : "64",
        "name" : "亿以上数的读法和写法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 88,
        "pId" : "64",
        "name" : "自然数，整数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 89,
        "pId" : "64",
        "name" : "十进制计数法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 90,
        "pId" : "64",
        "name" : "计算机的知识及用计算机探索规律",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 91,
        "pId" : "64",
        "name" : "能被2整除的数，能被3整除的数，能被4整除的数，能被5整除的数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 92,
        "pId" : "64",
        "name" : "因数，倍数，约数，公因数（公约数），公倍数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 93,
        "pId" : "64",
        "name" : "2、3、5的倍数及其特征",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 94,
        "pId" : "64",
        "name" : "质数，互质数，分解质因数，合数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 95,
        "pId" : "64",
        "name" : "奇数，偶数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 96,
        "pId" : "64",
        "name" : "认识正负数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 97,
        "pId" : "63",
        "name" : "加减运算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 98,
        "pId" : "97",
        "name" : "5以内的加减法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 99,
        "pId" : "97",
        "name" : "6-10的加减法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 100,
        "pId" : "97",
        "name" : "10以内的连加，连减，加减混合计算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 101,
        "pId" : "97",
        "name" : "20以内的加法（不进位）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 102,
        "pId" : "97",
        "name" : "20以内的减法（不退位）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 103,
        "pId" : "97",
        "name" : "20以内的加法（进位）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 104,
        "pId" : "97",
        "name" : "20以内的减法（退位）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 105,
        "pId" : "97",
        "name" : "20以内数的连加",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 106,
        "pId" : "97",
        "name" : "20以内数的连减，加减混合计算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 107,
        "pId" : "97",
        "name" : "有关0,1的计算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 108,
        "pId" : "97",
        "name" : "整十数加减整十数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 109,
        "pId" : "97",
        "name" : "百以内的加法（不进位）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 110,
        "pId" : "97",
        "name" : "百以内的加法（进位）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 111,
        "pId" : "97",
        "name" : "百以内的减法（不退位）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 112,
        "pId" : "97",
        "name" : "百以内的减法（退位）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 113,
        "pId" : "97",
        "name" : "百以内的连加，连减，加减混合计算及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 114,
        "pId" : "97",
        "name" : "加法的估算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 115,
        "pId" : "97",
        "name" : "减法的估算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 116,
        "pId" : "97",
        "name" : "整十或整百数的加减法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 117,
        "pId" : "97",
        "name" : "千以内的加法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 118,
        "pId" : "97",
        "name" : "千以内的减法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 119,
        "pId" : "97",
        "name" : "千以内的加减混合计算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 120,
        "pId" : "97",
        "name" : "万以内的数的加法和减法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 121,
        "pId" : "97",
        "name" : "万以内的连加，连减和加减混合计算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 122,
        "pId" : "97",
        "name" : "整千整百数的加减法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 123,
        "pId" : "97",
        "name" : "加法结合律和结合律",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 124,
        "pId" : "63",
        "name" : "乘除运算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 125,
        "pId" : "124",
        "name" : "认识乘法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 126,
        "pId" : "124",
        "name" : "认识除法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 127,
        "pId" : "124",
        "name" : "表内乘法（2-9的乘法口诀）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 128,
        "pId" : "124",
        "name" : "有余数的除法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 129,
        "pId" : "124",
        "name" : "两位数乘一位数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 130,
        "pId" : "124",
        "name" : "除数是一位数的除法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 131,
        "pId" : "124",
        "name" : "两位数乘两位数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 132,
        "pId" : "124",
        "name" : "三位数乘两位数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 133,
        "pId" : "124",
        "name" : "除数是两位数的除法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 134,
        "pId" : "124",
        "name" : "乘法结合律和交换律",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 135,
        "pId" : "124",
        "name" : "乘法分配律",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 136,
        "pId" : "124",
        "name" : "乘法的估算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 137,
        "pId" : "124",
        "name" : "除法的估算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 138,
        "pId" : "124",
        "name" : "整除和除尽",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 139,
        "pId" : "124",
        "name" : "整数的乘除混合计算及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 140,
        "pId" : "124",
        "name" : "用2—9的乘法口诀求商",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 141,
        "pId" : "63",
        "name" : "四则运算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 142,
        "pId" : "141",
        "name" : "整数的四则混合运算及应用题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 143,
        "pId" : "141",
        "name" : "和差积商的变化规律",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 144,
        "pId" : "141",
        "name" : "运算定律和简便算法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 145,
        "pId" : "20111063",
        "name" : "小数部分",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 146,
        "pId" : "145",
        "name" : "小数的基础知识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 147,
        "pId" : "146",
        "name" : "生活中的小数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 148,
        "pId" : "146",
        "name" : "小数的产生及意义",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 149,
        "pId" : "146",
        "name" : "小数的读法和写法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 150,
        "pId" : "146",
        "name" : "小数的性质",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 151,
        "pId" : "146",
        "name" : "小数点的移动",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 152,
        "pId" : "146",
        "name" : "求小数的近似值",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 153,
        "pId" : "146",
        "name" : "纯小数，带小数，循环小数，循环节，有限小数，无限小数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 154,
        "pId" : "145",
        "name" : "小数的运算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 155,
        "pId" : "154",
        "name" : "小数的加法和减法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 156,
        "pId" : "154",
        "name" : "小数的比较大小",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 157,
        "pId" : "154",
        "name" : "小数的简便算法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 158,
        "pId" : "154",
        "name" : "小数乘法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 159,
        "pId" : "154",
        "name" : "小数除法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 160,
        "pId" : "154",
        "name" : "小数的四则混合运算及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 161,
        "pId" : "154",
        "name" : "小数的乘除混合计算及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 162,
        "pId" : "154",
        "name" : "小数的加减混合计算及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 163,
        "pId" : "20111063",
        "name" : "分数部分",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 164,
        "pId" : "163",
        "name" : "分数的基础知识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 165,
        "pId" : "164",
        "name" : "分数的认识及意义",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 166,
        "pId" : "164",
        "name" : "分数的基本性质",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 167,
        "pId" : "164",
        "name" : "真分数，假分数，带分数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 168,
        "pId" : "164",
        "name" : "倒数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 169,
        "pId" : "164",
        "name" : "分数乘法的意义和分数乘法的计算法则",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 170,
        "pId" : "164",
        "name" : "分数除法的意义，分数除法的计算法则",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 171,
        "pId" : "164",
        "name" : "最大公因数（最大公约数），最小公倍数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 172,
        "pId" : "163",
        "name" : "分数运算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 173,
        "pId" : "172",
        "name" : "分数的加法和减法（同分母）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 174,
        "pId" : "172",
        "name" : "分数的加法和减法（异分母）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 175,
        "pId" : "172",
        "name" : "分数的比较大小",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 176,
        "pId" : "172",
        "name" : "分数与除法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 177,
        "pId" : "172",
        "name" : "带分数，假分数和整数的互化",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 178,
        "pId" : "172",
        "name" : "约分，通分，最简分数，分数的化简",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 179,
        "pId" : "172",
        "name" : "分数乘法及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 180,
        "pId" : "172",
        "name" : "分数除法及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 181,
        "pId" : "172",
        "name" : "分数的四则混合运算及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 182,
        "pId" : "172",
        "name" : "分数的乘除混合计算及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 183,
        "pId" : "172",
        "name" : "分数和小数的互化",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 184,
        "pId" : "172",
        "name" : "分数的简便算法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 185,
        "pId" : "172",
        "name" : "分数的加减混合计算及应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 186,
        "pId" : "20111063",
        "name" : "立体图形",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 187,
        "pId" : "186",
        "name" : "立体图形的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 188,
        "pId" : "187",
        "name" : "认识物体",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 189,
        "pId" : "187",
        "name" : "长方体的认识，正方体的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 190,
        "pId" : "187",
        "name" : "长方体和正方体的展开图",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 191,
        "pId" : "187",
        "name" : "圆柱，圆锥，球体",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 192,
        "pId" : "187",
        "name" : "面的旋转",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 193,
        "pId" : "186",
        "name" : "立体图形的表面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 194,
        "pId" : "193",
        "name" : "长方体的表面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 195,
        "pId" : "193",
        "name" : "正方体的表面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 196,
        "pId" : "193",
        "name" : "圆柱的表面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 197,
        "pId" : "186",
        "name" : "立体图形的体积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 198,
        "pId" : "197",
        "name" : "长方体的体积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 199,
        "pId" : "197",
        "name" : "正方体的体积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 200,
        "pId" : "197",
        "name" : "容积单位（升，毫升）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 201,
        "pId" : "197",
        "name" : "体积，容积及单位间的互换",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 202,
        "pId" : "197",
        "name" : "圆柱的体积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 203,
        "pId" : "197",
        "name" : "圆锥的体积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 204,
        "pId" : "20111063",
        "name" : "平面图形",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 205,
        "pId" : "204",
        "name" : "平面图形的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 206,
        "pId" : "205",
        "name" : "轴对称，轴对称图形",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 207,
        "pId" : "205",
        "name" : "认识图形（多边形）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 208,
        "pId" : "205",
        "name" : "正方形、长方形的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 209,
        "pId" : "205",
        "name" : "平行四边形的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 210,
        "pId" : "205",
        "name" : "三角形的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 211,
        "pId" : "205",
        "name" : "圆的定义（认识）和圆周率",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 212,
        "pId" : "205",
        "name" : "图形的拼组（剪）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 213,
        "pId" : "205",
        "name" : "角的认识，角的分类（直角，锐角和钝角）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 214,
        "pId" : "205",
        "name" : "三角形的特性",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 215,
        "pId" : "205",
        "name" : "三角形的内角和",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 216,
        "pId" : "205",
        "name" : "三角形三边的关系",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 217,
        "pId" : "205",
        "name" : "三角形的分类",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 218,
        "pId" : "205",
        "name" : "等腰三角形，等边三角形",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 219,
        "pId" : "205",
        "name" : "梯形的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 220,
        "pId" : "205",
        "name" : "直线，射线，线段，角，度",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 221,
        "pId" : "205",
        "name" : "角的度量",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 222,
        "pId" : "205",
        "name" : "平角，周角",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 223,
        "pId" : "205",
        "name" : "画角",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 224,
        "pId" : "205",
        "name" : "垂线，平行线及相交线",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 225,
        "pId" : "205",
        "name" : "画圆",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 226,
        "pId" : "205",
        "name" : "扇形的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 227,
        "pId" : "205",
        "name" : "四边形的分类",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 228,
        "pId" : "205",
        "name" : "多边形及多边形的内角和",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 229,
        "pId" : "205",
        "name" : "平行四边形的特性",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 230,
        "pId" : "205",
        "name" : "图形的分类",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 231,
        "pId" : "205",
        "name" : "四边形的关系",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 232,
        "pId" : "205",
        "name" : "认识图形",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 233,
        "pId" : "204",
        "name" : "周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 234,
        "pId" : "233",
        "name" : "长方形的周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 235,
        "pId" : "233",
        "name" : "三角形的周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 236,
        "pId" : "233",
        "name" : "梯形的周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 237,
        "pId" : "233",
        "name" : "平行四边形的周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 238,
        "pId" : "233",
        "name" : "正方形的周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 239,
        "pId" : "233",
        "name" : "圆的周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 240,
        "pId" : "233",
        "name" : "组合图形的周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 241,
        "pId" : "204",
        "name" : "面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 242,
        "pId" : "241",
        "name" : "面积和面积单位间的互换",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 243,
        "pId" : "241",
        "name" : "长方形的面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 244,
        "pId" : "241",
        "name" : "正方形的面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 245,
        "pId" : "241",
        "name" : "平行四边形的面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 246,
        "pId" : "241",
        "name" : "三角形的面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 247,
        "pId" : "241",
        "name" : "梯形的面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 248,
        "pId" : "241",
        "name" : "组合图形的面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 249,
        "pId" : "241",
        "name" : "公顷和平方千米",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 250,
        "pId" : "241",
        "name" : "圆的面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 251,
        "pId" : "20111063",
        "name" : "等式和方程",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 252,
        "pId" : "251",
        "name" : "用字母表示数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 253,
        "pId" : "251",
        "name" : "方程的定义，等式的性质",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 254,
        "pId" : "251",
        "name" : "解方程",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 255,
        "pId" : "251",
        "name" : "列方程解决问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 256,
        "pId" : "20111063",
        "name" : "百分数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 257,
        "pId" : "256",
        "name" : "利息，利率，本金",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 258,
        "pId" : "256",
        "name" : "百分数的意义，百分数的读法和写法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 259,
        "pId" : "256",
        "name" : "百分数的计算，百分数的应用题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 260,
        "pId" : "256",
        "name" : "百分数和分数的互化",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 261,
        "pId" : "256",
        "name" : "百分数和小数的互化",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 262,
        "pId" : "256",
        "name" : "整数，小数，分数，百分数和比例的复合应用题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 263,
        "pId" : "256",
        "name" : "整数，小数，分数，百分数和比例的混合运算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 264,
        "pId" : "20111063",
        "name" : "比和比例",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 265,
        "pId" : "264",
        "name" : "图形的放缩",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 266,
        "pId" : "264",
        "name" : "比的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 267,
        "pId" : "264",
        "name" : "比的基本性质",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 268,
        "pId" : "264",
        "name" : "比的化简",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 269,
        "pId" : "264",
        "name" : "比的应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 270,
        "pId" : "264",
        "name" : "求比值",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 271,
        "pId" : "264",
        "name" : "比与分数和除法的关系",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 272,
        "pId" : "264",
        "name" : "比例的意义，比例的基本性质",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 273,
        "pId" : "264",
        "name" : "正比例的意义，反比例的意义",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 274,
        "pId" : "264",
        "name" : "比例尺",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 275,
        "pId" : "264",
        "name" : "解比例，比例的应用题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 276,
        "pId" : "20111063",
        "name" : "生活中的单位",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 277,
        "pId" : "276",
        "name" : "日历的规律",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 278,
        "pId" : "276",
        "name" : "24时计时法和普通计时法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 279,
        "pId" : "276",
        "name" : "认识人民币及简单的计算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 280,
        "pId" : "276",
        "name" : "时间的计算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 281,
        "pId" : "276",
        "name" : "时，分，秒",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 282,
        "pId" : "276",
        "name" : "年，月，日",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 283,
        "pId" : "276",
        "name" : "认识钟表",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 284,
        "pId" : "276",
        "name" : "认识时间",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 285,
        "pId" : "276",
        "name" : "长度单位（米，厘米）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 286,
        "pId" : "276",
        "name" : "长度单位（毫米，分米，千米）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 287,
        "pId" : "276",
        "name" : "长度单位间的换算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 288,
        "pId" : "276",
        "name" : "克和千克",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 289,
        "pId" : "276",
        "name" : "重量单位间的换算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 290,
        "pId" : "276",
        "name" : "吨的认识",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 291,
        "pId" : "20111063",
        "name" : "统计和概率",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 292,
        "pId" : "291",
        "name" : "简单的统计表(图)",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 293,
        "pId" : "291",
        "name" : "可能性，概率",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 294,
        "pId" : "291",
        "name" : "找规律",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 295,
        "pId" : "291",
        "name" : "条形统计图",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 296,
        "pId" : "291",
        "name" : "折线统计图",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 297,
        "pId" : "291",
        "name" : "复式统计表",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 298,
        "pId" : "291",
        "name" : "复式的条形统计图",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 299,
        "pId" : "291",
        "name" : "复式的折线统计图",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 300,
        "pId" : "291",
        "name" : "扇形统计图",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 301,
        "pId" : "291",
        "name" : "统计（众数）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 302,
        "pId" : "291",
        "name" : "统计（中位数）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 303,
        "pId" : "291",
        "name" : "统计（平均数）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 304,
        "pId" : "20111063",
        "name" : "空间与位置",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 305,
        "pId" : "304",
        "name" : "观察物体（角度）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 306,
        "pId" : "304",
        "name" : "观察物体（上面，正面，右面）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 307,
        "pId" : "304",
        "name" : "观察物体（搭建）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 308,
        "pId" : "304",
        "name" : "图形与变换（平移和旋转）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 309,
        "pId" : "304",
        "name" : "位置（前后，左右，上下）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 310,
        "pId" : "304",
        "name" : "方向与位置（东南西北）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 311,
        "pId" : "304",
        "name" : "方向与路线（方向角）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 312,
        "pId" : "304",
        "name" : "方向与位置（有序数对）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 313,
        "pId" : "20111063",
        "name" : "实践与综合应用",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 314,
        "pId" : "20111063",
        "name" : "计算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 315,
        "pId" : "20111063",
        "name" : "算式谜、数阵与进位制",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 316,
        "pId" : "20111063",
        "name" : "数论",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 317,
        "pId" : "20111063",
        "name" : "计数问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 318,
        "pId" : "20111063",
        "name" : "分数问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 319,
        "pId" : "20111063",
        "name" : "行程问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 320,
        "pId" : "20111063",
        "name" : "典型应用题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 321,
        "pId" : "20111063",
        "name" : "几何图形",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 322,
        "pId" : "20111063",
        "name" : "几个特殊的专题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 323,
        "pId" : "322",
        "name" : "最大与最小",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 324,
        "pId" : "322",
        "name" : "钱币问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 325,
        "pId" : "322",
        "name" : "时间与钟面",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 326,
        "pId" : "322",
        "name" : "逻辑推理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 327,
        "pId" : "322",
        "name" : "最佳方法问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 328,
        "pId" : "322",
        "name" : "最佳对策问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 329,
        "pId" : "322",
        "name" : "简单规划问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 331,
        "pId" : "322",
        "name" : "图形划分",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 332,
        "pId" : "322",
        "name" : "数字分组",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 333,
        "pId" : "322",
        "name" : "排列组合",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 334,
        "pId" : "322",
        "name" : "筛选与枚举",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 335,
        "pId" : "322",
        "name" : "一笔画定理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 336,
        "pId" : "322",
        "name" : "哈密尔顿圈与哈密尔顿链",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 337,
        "pId" : "322",
        "name" : "多笔画定理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 338,
        "pId" : "322",
        "name" : "火柴棒问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 339,
        "pId" : "322",
        "name" : "智力问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 340,
        "pId" : "322",
        "name" : "组合图形的计数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 341,
        "pId" : "322",
        "name" : "长度比较",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 342,
        "pId" : "322",
        "name" : "巧算周长",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 343,
        "pId" : "322",
        "name" : "图形的拆拼（切拼）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 344,
        "pId" : "322",
        "name" : "等积变形（位移、割补）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 345,
        "pId" : "322",
        "name" : "多边形的内角和",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 346,
        "pId" : "322",
        "name" : "三角形面积与底的正比关系",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 347,
        "pId" : "322",
        "name" : "相似三角形的性质（份数、比例）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 348,
        "pId" : "322",
        "name" : "燕尾定理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 349,
        "pId" : "322",
        "name" : "差不变原理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 350,
        "pId" : "322",
        "name" : "规则立体图形的表面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 351,
        "pId" : "322",
        "name" : "规则立体图形的体积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 352,
        "pId" : "322",
        "name" : "不规则立体图形的表面积",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 353,
        "pId" : "322",
        "name" : "数阵图中找规律的问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 354,
        "pId" : "322",
        "name" : "体积的等积变形",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 355,
        "pId" : "322",
        "name" : "三视图与展开图",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 356,
        "pId" : "322",
        "name" : "最短线路问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 357,
        "pId" : "322",
        "name" : "染色问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 358,
        "pId" : "322",
        "name" : "圆与组合图形",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 359,
        "pId" : "322",
        "name" : "格点面积（毕克定理）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 360,
        "pId" : "322",
        "name" : "归一归总问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 361,
        "pId" : "322",
        "name" : "和差问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 362,
        "pId" : "322",
        "name" : "和倍问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 363,
        "pId" : "322",
        "name" : "差倍问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 365,
        "pId" : "322",
        "name" : "方阵问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 366,
        "pId" : "322",
        "name" : "年龄问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 368,
        "pId" : "322",
        "name" : "牛吃草问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 369,
        "pId" : "322",
        "name" : "平均数问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 370,
        "pId" : "322",
        "name" : "盈亏问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 371,
        "pId" : "322",
        "name" : "逆推问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 372,
        "pId" : "322",
        "name" : "代换问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 373,
        "pId" : "322",
        "name" : "周期性问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 374,
        "pId" : "322",
        "name" : "简单统计问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 375,
        "pId" : "322",
        "name" : "最优化问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 376,
        "pId" : "322",
        "name" : "相遇问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 377,
        "pId" : "322",
        "name" : "追及问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 378,
        "pId" : "322",
        "name" : "流水行船问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 379,
        "pId" : "322",
        "name" : "多次相遇问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 380,
        "pId" : "322",
        "name" : "环形跑道问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 381,
        "pId" : "322",
        "name" : "钟面上的追及问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 382,
        "pId" : "322",
        "name" : "列车过桥问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 383,
        "pId" : "322",
        "name" : "发车间隔问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 384,
        "pId" : "322",
        "name" : "错车问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 385,
        "pId" : "322",
        "name" : "分数的大小比较",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 386,
        "pId" : "322",
        "name" : "分数的拆项",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 387,
        "pId" : "322",
        "name" : "分数的最大公约数和最小公倍数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 388,
        "pId" : "322",
        "name" : "循环小数与分数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 389,
        "pId" : "322",
        "name" : "巧算分数和",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 390,
        "pId" : "322",
        "name" : "分数和百分数应用题（多重条件）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 391,
        "pId" : "322",
        "name" : "按比例分配",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 392,
        "pId" : "322",
        "name" : "正、反比例",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 393,
        "pId" : "322",
        "name" : "工程问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 394,
        "pId" : "322",
        "name" : "利润和利息问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 395,
        "pId" : "322",
        "name" : "浓度问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 396,
        "pId" : "322",
        "name" : "折扣问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 397,
        "pId" : "322",
        "name" : "加法原理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 398,
        "pId" : "322",
        "name" : "乘法原理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 399,
        "pId" : "322",
        "name" : "容斥原理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 401,
        "pId" : "322",
        "name" : "握手问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 402,
        "pId" : "322",
        "name" : "排队论问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 403,
        "pId" : "322",
        "name" : "烙饼问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 404,
        "pId" : "322",
        "name" : "沏茶问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 405,
        "pId" : "322",
        "name" : "田忌赛马问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 406,
        "pId" : "322",
        "name" : "数字问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 407,
        "pId" : "322",
        "name" : "奇偶性问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 408,
        "pId" : "322",
        "name" : "质数与合数问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 409,
        "pId" : "322",
        "name" : "公约数与公倍数问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 410,
        "pId" : "322",
        "name" : "整数的裂项与拆分",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 411,
        "pId" : "322",
        "name" : "位值原则",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 412,
        "pId" : "322",
        "name" : "数的整除特征",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 413,
        "pId" : "322",
        "name" : "整除性质",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 414,
        "pId" : "322",
        "name" : "带余除法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 415,
        "pId" : "322",
        "name" : "唯一分解定理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 416,
        "pId" : "322",
        "name" : "约数个数与约数和定理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 417,
        "pId" : "322",
        "name" : "同余定理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 418,
        "pId" : "322",
        "name" : "完全平方数性质",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 419,
        "pId" : "322",
        "name" : "孙子定理（中国剩余定理）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 420,
        "pId" : "322",
        "name" : "辗转相除法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 421,
        "pId" : "322",
        "name" : "数字和问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 422,
        "pId" : "322",
        "name" : "等量关系与方程",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 423,
        "pId" : "322",
        "name" : "二元一次方程组的求解",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 424,
        "pId" : "322",
        "name" : "不定方程的分析求解",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 425,
        "pId" : "322",
        "name" : "不等方程的分析求解",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 426,
        "pId" : "322",
        "name" : "填符号组算式",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 427,
        "pId" : "322",
        "name" : "横式数字谜",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 428,
        "pId" : "322",
        "name" : "竖式数字谜",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 429,
        "pId" : "322",
        "name" : "横式与竖式的互换",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 430,
        "pId" : "322",
        "name" : "凑数谜",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 431,
        "pId" : "322",
        "name" : "相等和值问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 432,
        "pId" : "322",
        "name" : "数列分组",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 433,
        "pId" : "322",
        "name" : "幻方",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 434,
        "pId" : "322",
        "name" : "奇阶幻方问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 435,
        "pId" : "322",
        "name" : "偶阶幻方问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 436,
        "pId" : "322",
        "name" : "二进制位值原则",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 437,
        "pId" : "322",
        "name" : "二进制数与十进制数的互相转化",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 438,
        "pId" : "322",
        "name" : "二进制的运算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 439,
        "pId" : "322",
        "name" : "其它进制问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 440,
        "pId" : "322",
        "name" : "加减法中的巧算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 441,
        "pId" : "322",
        "name" : "乘除法中的巧算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 442,
        "pId" : "322",
        "name" : "小数的巧算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 443,
        "pId" : "322",
        "name" : "分数的巧算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 444,
        "pId" : "322",
        "name" : "四则混合运算中的巧算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 445,
        "pId" : "322",
        "name" : "带分数与假分数的互化",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 446,
        "pId" : "322",
        "name" : "循环小数及其分类",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 447,
        "pId" : "322",
        "name" : "繁分数的化简",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 448,
        "pId" : "322",
        "name" : "连分数（特殊的繁分数）",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 449,
        "pId" : "322",
        "name" : "乘方",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 450,
        "pId" : "322",
        "name" : "比较大小",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 451,
        "pId" : "322",
        "name" : "估计与估算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 452,
        "pId" : "322",
        "name" : "定义新运算",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 453,
        "pId" : "322",
        "name" : "高斯取整",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 454,
        "pId" : "322",
        "name" : "乘积的个位数",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 455,
        "pId" : "322",
        "name" : "等差数列",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 456,
        "pId" : "322",
        "name" : "等比数列",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 457,
        "pId" : "322",
        "name" : "裴波那契数列",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 458,
        "pId" : "322",
        "name" : "高斯求和",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 459,
        "pId" : "322",
        "name" : "页码问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 460,
        "pId" : "322",
        "name" : "数字串问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 461,
        "pId" : "322",
        "name" : "植树问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 462,
        "pId" : "322",
        "name" : "转化的策略",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 463,
        "pId" : "322",
        "name" : "还原问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 464,
        "pId" : "322",
        "name" : "方案问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 465,
        "pId" : "322",
        "name" : "数字和编码",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 466,
        "pId" : "322",
        "name" : "找次品",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 467,
        "pId" : "322",
        "name" : "鸡兔同笼",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 468,
        "pId" : "322",
        "name" : "抽屉原理",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 469,
        "pId" : "322",
        "name" : "排列与组合",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 470,
        "pId" : "322",
        "name" : "置换问题及方法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 471,
        "pId" : "322",
        "name" : "操作与策略",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 472,
        "pId" : "322",
        "name" : "推理与判断",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 473,
        "pId" : "322",
        "name" : "合理安排时间",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 474,
        "pId" : "322",
        "name" : "生活中的搭配",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 475,
        "pId" : "322",
        "name" : "分类",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 476,
        "pId" : "322",
        "name" : "路程，时间和速度的关系",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 477,
        "pId" : "322",
        "name" : "速度的表示法",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 478,
        "pId" : "322",
        "name" : "重叠问题",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 479,
        "pId" : "20111064",
        "name" : "听力",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 480,
        "pId" : "479",
        "name" : "听力",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 481,
        "pId" : "20111064",
        "name" : "词汇",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 482,
        "pId" : "481",
        "name" : "字母",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 483,
        "pId" : "482",
        "name" : "字母书写",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 484,
        "pId" : "482",
        "name" : "元音音素",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 485,
        "pId" : "482",
        "name" : "字母",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 486,
        "pId" : "481",
        "name" : "语音",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 487,
        "pId" : "486",
        "name" : "语音",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 488,
        "pId" : "481",
        "name" : "单词、词组",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 489,
        "pId" : "488",
        "name" : "单词、词组",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 490,
        "pId" : "20111064",
        "name" : "语法",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 491,
        "pId" : "490",
        "name" : "名词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 492,
        "pId" : "491",
        "name" : "单数名词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 493,
        "pId" : "491",
        "name" : "复数名词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 494,
        "pId" : "491",
        "name" : "不可数名词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 495,
        "pId" : "491",
        "name" : "名词所有格",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 496,
        "pId" : "491",
        "name" : "专有名词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 497,
        "pId" : "491",
        "name" : "集合名词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 498,
        "pId" : "491",
        "name" : "名词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 499,
        "pId" : "490",
        "name" : "数词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 500,
        "pId" : "499",
        "name" : "基数词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 501,
        "pId" : "499",
        "name" : "序数词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 502,
        "pId" : "499",
        "name" : "年月日",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 503,
        "pId" : "499",
        "name" : "时刻",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 504,
        "pId" : "490",
        "name" : "冠词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 505,
        "pId" : "504",
        "name" : "定冠词（the）",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 506,
        "pId" : "504",
        "name" : "不定冠词（a,an）",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 507,
        "pId" : "504",
        "name" : "零冠词，不用冠词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 508,
        "pId" : "490",
        "name" : "代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 509,
        "pId" : "508",
        "name" : "人称代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 510,
        "pId" : "508",
        "name" : "物主代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 511,
        "pId" : "508",
        "name" : "指示代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 512,
        "pId" : "508",
        "name" : "不定代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 513,
        "pId" : "508",
        "name" : "疑问代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 514,
        "pId" : "508",
        "name" : "相互代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 515,
        "pId" : "508",
        "name" : "反身代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 516,
        "pId" : "508",
        "name" : "连接代词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 517,
        "pId" : "490",
        "name" : "形容词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 518,
        "pId" : "517",
        "name" : "规则形容词的比较级",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 519,
        "pId" : "517",
        "name" : "不规则形容词的比较级",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 520,
        "pId" : "517",
        "name" : "形容词的最高级",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 521,
        "pId" : "517",
        "name" : "形容词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 522,
        "pId" : "490",
        "name" : "副词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 523,
        "pId" : "522",
        "name" : "时间副词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 524,
        "pId" : "522",
        "name" : "地点副词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 525,
        "pId" : "522",
        "name" : "方式副词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 526,
        "pId" : "522",
        "name" : "程度副词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 527,
        "pId" : "522",
        "name" : "疑问副词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 528,
        "pId" : "522",
        "name" : "副词的比较级",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 529,
        "pId" : "522",
        "name" : "频度副词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 530,
        "pId" : "522",
        "name" : "副词的最高级",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 531,
        "pId" : "522",
        "name" : "副词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 532,
        "pId" : "490",
        "name" : "介词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 533,
        "pId" : "532",
        "name" : "介词短语",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 534,
        "pId" : "532",
        "name" : "介词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 535,
        "pId" : "490",
        "name" : "动词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 536,
        "pId" : "535",
        "name" : "系动词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 537,
        "pId" : "535",
        "name" : "情态动词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 538,
        "pId" : "535",
        "name" : "一般现在时，动词单数第三人称",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 539,
        "pId" : "535",
        "name" : "现在进行时，现在分词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 540,
        "pId" : "535",
        "name" : "一般过去时，动词过去式",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 541,
        "pId" : "535",
        "name" : "一般将来时",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 542,
        "pId" : "535",
        "name" : "动词短语",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 543,
        "pId" : "535",
        "name" : "动名词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 544,
        "pId" : "535",
        "name" : "现在完成时",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 545,
        "pId" : "535",
        "name" : "过去进行时",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 546,
        "pId" : "535",
        "name" : "动词不定式",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 547,
        "pId" : "535",
        "name" : "被动语态",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 548,
        "pId" : "535",
        "name" : "实义动词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 549,
        "pId" : "535",
        "name" : "助动词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 550,
        "pId" : "490",
        "name" : "句型",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 551,
        "pId" : "550",
        "name" : "肯定句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 552,
        "pId" : "550",
        "name" : "否定句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 553,
        "pId" : "550",
        "name" : "陈述句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 554,
        "pId" : "550",
        "name" : "一般疑问句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 555,
        "pId" : "550",
        "name" : "特殊疑问句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 556,
        "pId" : "550",
        "name" : "祈使句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 557,
        "pId" : "550",
        "name" : "there be 句型",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 558,
        "pId" : "550",
        "name" : "感叹句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 559,
        "pId" : "550",
        "name" : "倒装句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 560,
        "pId" : "550",
        "name" : "选择疑问句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 561,
        "pId" : "550",
        "name" : "反意疑问句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 562,
        "pId" : "550",
        "name" : "宾语从句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 563,
        "pId" : "490",
        "name" : "连词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 564,
        "pId" : "563",
        "name" : "连词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 565,
        "pId" : "490",
        "name" : "固定搭配",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 566,
        "pId" : "565",
        "name" : "固定搭配",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 567,
        "pId" : "490",
        "name" : "量词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 568,
        "pId" : "567",
        "name" : "量词",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 569,
        "pId" : "490",
        "name" : "疑问词组",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 570,
        "pId" : "569",
        "name" : "疑问词组",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 571,
        "pId" : "20111064",
        "name" : "情景交际",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 572,
        "pId" : "571",
        "name" : "日常用语、谚语",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 573,
        "pId" : "571",
        "name" : "情景交际",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 574,
        "pId" : "20111064",
        "name" : "阅读能力",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 575,
        "pId" : "574",
        "name" : "阅读能力",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 576,
        "pId" : "20111064",
        "name" : "翻译能力",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 577,
        "pId" : "576",
        "name" : "翻译能力",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 578,
        "pId" : "20111064",
        "name" : "写作能力",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 579,
        "pId" : "578",
        "name" : "连词成句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 580,
        "pId" : "578",
        "name" : "仿写，造句",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 581,
        "pId" : "578",
        "name" : "问答题",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 582,
        "pId" : "578",
        "name" : "作文",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 2001,
        "pId" : "0",
        "name" : "语文(初中部)",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3002,
        "pId" : "2001",
        "name" : "基础知识及语言表达",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3003,
        "pId" : "3002",
        "name" : "字音",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3004,
        "pId" : "3002",
        "name" : "字形",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3005,
        "pId" : "3002",
        "name" : "词语",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3006,
        "pId" : "3002",
        "name" : "语法",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3007,
        "pId" : "3002",
        "name" : "修辞格",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3008,
        "pId" : "3002",
        "name" : "成语（熟语）",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3009,
        "pId" : "3002",
        "name" : "标点符号",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 20057,
        "pId" : "0",
        "name" : "数学(初中部)",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20058,
        "pId" : "20057",
        "name" : "三角形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20059,
        "pId" : "20058",
        "name" : "几何初步、相交线与平行线",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20060,
        "pId" : "20058",
        "name" : "三角形与全等三角形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20061,
        "pId" : "20058",
        "name" : "图形的相似",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20062,
        "pId" : "20058",
        "name" : "锐角三角函数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20063,
        "pId" : "20058",
        "name" : "等腰三角形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20064,
        "pId" : "20058",
        "name" : "直角三角形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20065,
        "pId" : "20057",
        "name" : "四边形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20066,
        "pId" : "20065",
        "name" : "多边形与平行四边形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20067,
        "pId" : "20065",
        "name" : "矩形、菱形、正方形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20068,
        "pId" : "20065",
        "name" : "梯形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20069,
        "pId" : "20057",
        "name" : "圆",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20070,
        "pId" : "20069",
        "name" : "圆的有关性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20071,
        "pId" : "20069",
        "name" : "与圆有关的位置关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20072,
        "pId" : "20069",
        "name" : "与圆有关的计算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20073,
        "pId" : "20057",
        "name" : "数与式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20074,
        "pId" : "20073",
        "name" : "分式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20075,
        "pId" : "20073",
        "name" : "二次根式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20076,
        "pId" : "20073",
        "name" : "实数及其运算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20077,
        "pId" : "20073",
        "name" : "整式与因式分解",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20078,
        "pId" : "20057",
        "name" : "方程（组）与不等式（组)",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20079,
        "pId" : "20078",
        "name" : "一元二次方程及其应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20080,
        "pId" : "20078",
        "name" : "一次方程（组）及其应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20081,
        "pId" : "20078",
        "name" : "一元一次不等式（组）及其应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20082,
        "pId" : "20078",
        "name" : "分式方程及其应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20083,
        "pId" : "20057",
        "name" : "函数及其图象",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20084,
        "pId" : "20083",
        "name" : "平面直角坐标系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20085,
        "pId" : "20083",
        "name" : "一次函数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20086,
        "pId" : "20083",
        "name" : "反比例函数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20087,
        "pId" : "20083",
        "name" : "二次函数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20088,
        "pId" : "20057",
        "name" : "图形与变换",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20089,
        "pId" : "20088",
        "name" : "图形的平移与旋转",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20090,
        "pId" : "20088",
        "name" : "图形的对称",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20091,
        "pId" : "20088",
        "name" : "视图与投影",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20092,
        "pId" : "20088",
        "name" : "尺规作图",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20093,
        "pId" : "20057",
        "name" : "统计与概率",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20094,
        "pId" : "20093",
        "name" : "概率初步",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20095,
        "pId" : "20093",
        "name" : "统计初步",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20096,
        "pId" : "0",
        "name" : "英语(初中部)",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 30010,
        "pId" : "3002",
        "name" : "病句辨析",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30011,
        "pId" : "3002",
        "name" : "扩展语句、压缩语段",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30012,
        "pId" : "3002",
        "name" : "选用、仿用、变换句式",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30013,
        "pId" : "3002",
        "name" : "句式衔接",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30014,
        "pId" : "3002",
        "name" : "语言的简明连贯得体",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30015,
        "pId" : "3002",
        "name" : "图文转换",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30016,
        "pId" : "3002",
        "name" : "课文内容理解  ",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30017,
        "pId" : "3002",
        "name" : "书写规范",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30018,
        "pId" : "3002",
        "name" : "朗读、节奏",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30019,
        "pId" : "3002",
        "name" : "文言文翻译",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30020,
        "pId" : "3002",
        "name" : "字义",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30021,
        "pId" : "2001",
        "name" : "文学常识及鉴赏",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30022,
        "pId" : "30021",
        "name" : "先秦诸子百家",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30023,
        "pId" : "30021",
        "name" : "楚辞汉赋骈文（歌行、乐府）",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30024,
        "pId" : "30021",
        "name" : "历史记载类（二十四史、地方志、野史等）",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30025,
        "pId" : "30021",
        "name" : "古代散文、兵法农医、天文术数、艺术杂学等",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30026,
        "pId" : "30021",
        "name" : "古代应用公文类（含奏议、赠序、铭文、祭文等）",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30027,
        "pId" : "30021",
        "name" : "近代文学",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30028,
        "pId" : "30021",
        "name" : "外国文学",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30029,
        "pId" : "30021",
        "name" : "诗",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30030,
        "pId" : "30021",
        "name" : "词",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30031,
        "pId" : "30021",
        "name" : "曲",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30032,
        "pId" : "30021",
        "name" : "小说",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30033,
        "pId" : "30021",
        "name" : "作家作品",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30034,
        "pId" : "2001",
        "name" : "文言文阅读",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30035,
        "pId" : "30034",
        "name" : "人物传记类",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30036,
        "pId" : "30034",
        "name" : "历史事件类",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30037,
        "pId" : "30034",
        "name" : "散文类",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30038,
        "pId" : "30034",
        "name" : "公文类",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30039,
        "pId" : "2001",
        "name" : "现代文阅读",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30040,
        "pId" : "30039",
        "name" : "记叙类文本阅读",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30041,
        "pId" : "30039",
        "name" : "说明类文本阅读",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30042,
        "pId" : "30039",
        "name" : "议论类文本阅读",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30043,
        "pId" : "30039",
        "name" : "小说类文本阅读",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30044,
        "pId" : "30039",
        "name" : "写景抒情类文本阅读",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30045,
        "pId" : "30044",
        "name" : "古代小说",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30046,
        "pId" : "30044",
        "name" : "现当代小说",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30047,
        "pId" : "2001",
        "name" : "默写，名著导读",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30048,
        "pId" : "30047",
        "name" : "诗",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30049,
        "pId" : "30047",
        "name" : "词",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30050,
        "pId" : "30047",
        "name" : "曲",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30051,
        "pId" : "30047",
        "name" : "其他",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30052,
        "pId" : "30051",
        "name" : "国内文学作品",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30053,
        "pId" : "30051",
        "name" : "国外文学作品",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30054,
        "pId" : "30051",
        "name" : "汉字或汉字拼音",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30055,
        "pId" : "2001",
        "name" : "作文及写作",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30056,
        "pId" : "30055",
        "name" : "命题作文",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30057,
        "pId" : "30055",
        "name" : "材料作文",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30058,
        "pId" : "30055",
        "name" : "话题作文",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 30097,
        "pId" : "20096",
        "name" : "词法",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 30098,
        "pId" : "30097",
        "name" : "动词和动词短语",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 30099,
        "pId" : "30097",
        "name" : "相似、相近词比较",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 200197,
        "pId" : "0",
        "name" : "生物(初中部)",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200198,
        "pId" : "200197",
        "name" : "生物和生物圈",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200199,
        "pId" : "200198",
        "name" : "认识生物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200200,
        "pId" : "200199",
        "name" : "生物的特征",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200201,
        "pId" : "200199",
        "name" : "调查周边环境中的生物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200202,
        "pId" : "200198",
        "name" : "了解生物圈",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200203,
        "pId" : "200202",
        "name" : "生物与环境的关系",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200204,
        "pId" : "200202",
        "name" : "生态系统的组成",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200205,
        "pId" : "200202",
        "name" : "食物链与食物网",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200206,
        "pId" : "200202",
        "name" : "生物圈中的能量流动和物质循环",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200207,
        "pId" : "200197",
        "name" : "生物体的结构层次",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200208,
        "pId" : "200207",
        "name" : "细胞是生物体结构和功能的基本单位",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200209,
        "pId" : "200208",
        "name" : "练习使用显微镜",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200210,
        "pId" : "200208",
        "name" : "植物细胞",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200211,
        "pId" : "200208",
        "name" : "动物细胞",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200212,
        "pId" : "200208",
        "name" : "细胞的生活",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200213,
        "pId" : "200207",
        "name" : "细胞怎样构成生物体",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200214,
        "pId" : "200213",
        "name" : "细胞通过分裂产生新细胞",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200215,
        "pId" : "200213",
        "name" : "动物体的结构层次",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200216,
        "pId" : "200213",
        "name" : "植物体的结构层次",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200217,
        "pId" : "200213",
        "name" : "单细胞生物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200218,
        "pId" : "200213",
        "name" : "没细胞结构的生物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200219,
        "pId" : "200197",
        "name" : "生物圈中的绿色植物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200220,
        "pId" : "200219",
        "name" : "生物圈中的绿色植物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200221,
        "pId" : "200220",
        "name" : "藻类、苔藓和蕨类植物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200222,
        "pId" : "200220",
        "name" : "种子植物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200223,
        "pId" : "200220",
        "name" : "被子植物的一生",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 200224,
        "pId" : "200223",
        "name" : "种子的萌发",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200225,
        "pId" : "200223",
        "name" : "植株的生长",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200226,
        "pId" : "200223",
        "name" : "开花和结果",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200227,
        "pId" : "200220",
        "name" : "绿色植物与生物圈的水循环",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 200228,
        "pId" : "200227",
        "name" : "植物的生活需要无机盐",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200229,
        "pId" : "200227",
        "name" : "植物的蒸腾作用",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200230,
        "pId" : "200227",
        "name" : "生物圈的水循环",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200231,
        "pId" : "200220",
        "name" : "绿色植物的光合作用和呼吸作用",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 200232,
        "pId" : "200231",
        "name" : "绿色植物的光合作用",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200233,
        "pId" : "200231",
        "name" : "绿色植物的呼吸作用",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200234,
        "pId" : "200220",
        "name" : "爱护植被，绿化祖国",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 200235,
        "pId" : "200197",
        "name" : "生物圈中的人",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200236,
        "pId" : "200235",
        "name" : "人的由来",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200237,
        "pId" : "200236",
        "name" : "人类的起源和发展",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200238,
        "pId" : "200236",
        "name" : "人的生殖",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200239,
        "pId" : "200236",
        "name" : "青春期",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200240,
        "pId" : "200235",
        "name" : "人体的营养",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200241,
        "pId" : "200240",
        "name" : "食物中的营养物质",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200242,
        "pId" : "200240",
        "name" : "食物的消化和营养物质的吸收",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200243,
        "pId" : "200240",
        "name" : "合理营养与食品安全",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200244,
        "pId" : "200235",
        "name" : "人体的呼吸",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200245,
        "pId" : "200244",
        "name" : "呼吸道对空气的处理",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200246,
        "pId" : "200244",
        "name" : "发生在人体的气体交换",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200247,
        "pId" : "200235",
        "name" : "人体内物质的运输",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200248,
        "pId" : "200247",
        "name" : "物质的运输的载体——血液",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200249,
        "pId" : "200247",
        "name" : "物质运输的通道——血管",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200250,
        "pId" : "200247",
        "name" : "输送血液的泵——心脏",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200251,
        "pId" : "200247",
        "name" : "输血与血型",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200252,
        "pId" : "200247",
        "name" : "血液循环",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200253,
        "pId" : "200235",
        "name" : "人体内废物的排出",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200254,
        "pId" : "200253",
        "name" : "人体内废物的排出",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200255,
        "pId" : "200254",
        "name" : "尿液的形成和排出",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200256,
        "pId" : "200254",
        "name" : "汗液的形成和排出",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200257,
        "pId" : "200235",
        "name" : "人体生命活动的调节",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200258,
        "pId" : "200257",
        "name" : "人体对外界环境的感知",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200259,
        "pId" : "200257",
        "name" : "神经系统的组成",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200260,
        "pId" : "200257",
        "name" : "神经调节的基本方式",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200261,
        "pId" : "200257",
        "name" : "激素调节",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200262,
        "pId" : "200235",
        "name" : "人类活动对生物圈的影响",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200263,
        "pId" : "200197",
        "name" : "生物圈中的其他生物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200264,
        "pId" : "200263",
        "name" : "各种环境中的动物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200265,
        "pId" : "200264",
        "name" : "水中生活的动物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200266,
        "pId" : "200264",
        "name" : "陆地生活的动物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200267,
        "pId" : "200264",
        "name" : "空中飞行的动物",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200268,
        "pId" : "200263",
        "name" : "动物的运动和行为",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200269,
        "pId" : "200268",
        "name" : "动物的运动",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200270,
        "pId" : "200268",
        "name" : "动物的行为",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200271,
        "pId" : "200263",
        "name" : "动物在生物圈中的作用",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200272,
        "pId" : "200271",
        "name" : "动物在自然界中的作用",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200273,
        "pId" : "200271",
        "name" : "动物与人类生活的关系",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200274,
        "pId" : "200263",
        "name" : "分布广泛的细菌和真菌",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200275,
        "pId" : "200263",
        "name" : "细菌和真菌在生物圈中的作用",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200276,
        "pId" : "200197",
        "name" : "生物的多样性及其保护",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200277,
        "pId" : "200276",
        "name" : "根据生物的特征进行分类",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200278,
        "pId" : "200277",
        "name" : "尝试对生物进行分类",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200279,
        "pId" : "200277",
        "name" : "从种到界",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200280,
        "pId" : "200276",
        "name" : "认识生物多样性",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200281,
        "pId" : "200276",
        "name" : "保护生物的多样性",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200282,
        "pId" : "200197",
        "name" : "生物圈中生命的延续和发展",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200283,
        "pId" : "200282",
        "name" : "生物的生殖和发育",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200284,
        "pId" : "200283",
        "name" : "绿色开花植物的一生",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200285,
        "pId" : "200283",
        "name" : "昆虫的一生",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200286,
        "pId" : "200283",
        "name" : "两栖动物的一生",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200287,
        "pId" : "200283",
        "name" : "鸟的生殖和发育",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200288,
        "pId" : "200282",
        "name" : "生物的遗传和变异",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200289,
        "pId" : "200288",
        "name" : "基因控制生物的性状",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200290,
        "pId" : "200288",
        "name" : "基因在亲子代间的传递",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200291,
        "pId" : "200288",
        "name" : "基因的显性和隐性",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200292,
        "pId" : "200288",
        "name" : "人的性别遗传",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200293,
        "pId" : "200288",
        "name" : "生物的变异",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200294,
        "pId" : "200282",
        "name" : "生物的进化",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200295,
        "pId" : "200294",
        "name" : "地球上生命的起源",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200296,
        "pId" : "200294",
        "name" : "生物进化的历程",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200297,
        "pId" : "200294",
        "name" : "生物进化的原因",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200298,
        "pId" : "200197",
        "name" : "健康地生活",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200299,
        "pId" : "200298",
        "name" : "传染病和免疫",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200300,
        "pId" : "200299",
        "name" : "传染病及其预防",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200301,
        "pId" : "200299",
        "name" : "免疫与计划免疫",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200302,
        "pId" : "200298",
        "name" : "用药和急救",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200303,
        "pId" : "200298",
        "name" : "了解自己增进健康",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200304,
        "pId" : "200303",
        "name" : "评价自己的健康状况",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200305,
        "pId" : "200303",
        "name" : "选择健康的生活方式",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200306,
        "pId" : "200197",
        "name" : "生物技术",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200307,
        "pId" : "200306",
        "name" : "生活中的生物技术",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200308,
        "pId" : "200306",
        "name" : "现代生物技术",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 200309,
        "pId" : "0",
        "name" : "物理(初中部)",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200310,
        "pId" : "200309",
        "name" : "声现象",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200311,
        "pId" : "200310",
        "name" : "声音的产生与传播",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200312,
        "pId" : "200310",
        "name" : "声音的三个特征：音调、响度和音色",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200313,
        "pId" : "200310",
        "name" : "噪声",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200314,
        "pId" : "200310",
        "name" : "声的利用",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200315,
        "pId" : "200309",
        "name" : "物质",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200316,
        "pId" : "200315",
        "name" : "质量及其测量",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200317,
        "pId" : "200315",
        "name" : "密度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200318,
        "pId" : "200317",
        "name" : "密度概念及公式",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200319,
        "pId" : "200317",
        "name" : "密度测量",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200320,
        "pId" : "200317",
        "name" : "密度的应用",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200321,
        "pId" : "200309",
        "name" : "运动和力",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200322,
        "pId" : "200321",
        "name" : "力",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200323,
        "pId" : "200322",
        "name" : "力及其三要素",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200324,
        "pId" : "200322",
        "name" : "力的测量：弹簧测力计",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200325,
        "pId" : "200321",
        "name" : "重力",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200326,
        "pId" : "200321",
        "name" : "惯性",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200327,
        "pId" : "200326",
        "name" : "牛顿第一定律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200328,
        "pId" : "200326",
        "name" : "惯性与惯性现象的解释",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200329,
        "pId" : "200321",
        "name" : "二力平衡",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200330,
        "pId" : "200329",
        "name" : "二力平衡的条件",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200331,
        "pId" : "200329",
        "name" : "二力平衡的应用",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200332,
        "pId" : "200321",
        "name" : "摩擦力",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200333,
        "pId" : "200332",
        "name" : "实验：探究影响摩擦力大小的因素",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200334,
        "pId" : "200332",
        "name" : "增大或减少摩擦的方法",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200335,
        "pId" : "200309",
        "name" : "简单机械",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200336,
        "pId" : "200335",
        "name" : "简单机械",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200337,
        "pId" : "200336",
        "name" : "杠杆",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200338,
        "pId" : "200336",
        "name" : "滑轮及滑轮组",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200339,
        "pId" : "200336",
        "name" : "轮轴",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200340,
        "pId" : "200336",
        "name" : "机械效率",
        "subject" : "10014",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 200341,
        "pId" : "200309",
        "name" : "压强和浮力",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200342,
        "pId" : "200341",
        "name" : "压强",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200343,
        "pId" : "200342",
        "name" : "压力与压强",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200344,
        "pId" : "200342",
        "name" : "液体压强",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200345,
        "pId" : "200342",
        "name" : "大气压强",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200346,
        "pId" : "200342",
        "name" : "流体压强与流速的关系",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200347,
        "pId" : "200341",
        "name" : "浮力",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200348,
        "pId" : "200347",
        "name" : "浮力产生的原因",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200349,
        "pId" : "200347",
        "name" : "物体沉浮的条件",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200350,
        "pId" : "200347",
        "name" : "阿基米德原理",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200351,
        "pId" : "200347",
        "name" : "浮力的应用",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200352,
        "pId" : "200309",
        "name" : "功和机械能",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200353,
        "pId" : "200352",
        "name" : "功",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200354,
        "pId" : "200353",
        "name" : "做功的两个必要因素",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200355,
        "pId" : "200353",
        "name" : "功的计算公式",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200356,
        "pId" : "200352",
        "name" : "功率",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200357,
        "pId" : "200356",
        "name" : "功率的概念",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200358,
        "pId" : "200356",
        "name" : "功率的计算公式",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200359,
        "pId" : "200352",
        "name" : "动能和势能",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200360,
        "pId" : "200309",
        "name" : "热学",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200361,
        "pId" : "200360",
        "name" : "热现象",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200362,
        "pId" : "200361",
        "name" : "温度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200363,
        "pId" : "200361",
        "name" : "物质的三态",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200364,
        "pId" : "200360",
        "name" : "内能",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200365,
        "pId" : "200364",
        "name" : "分子热运动",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200366,
        "pId" : "200364",
        "name" : "内能和热量",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200367,
        "pId" : "200364",
        "name" : "比热容",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200368,
        "pId" : "200360",
        "name" : "热机",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200369,
        "pId" : "200309",
        "name" : "光学",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200370,
        "pId" : "200369",
        "name" : "光现象",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200371,
        "pId" : "200370",
        "name" : "光的直线传播",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200372,
        "pId" : "200370",
        "name" : "光的反射",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200373,
        "pId" : "200370",
        "name" : "光的折射",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200374,
        "pId" : "200370",
        "name" : "光的色散、三原色、三基色",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200375,
        "pId" : "200370",
        "name" : "看不见的光、光谱",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200376,
        "pId" : "200369",
        "name" : "透镜",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200377,
        "pId" : "200376",
        "name" : "透镜",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200378,
        "pId" : "200377",
        "name" : "凸透镜成像规律",
        "subject" : "10014",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200379,
        "pId" : "200377",
        "name" : "应用",
        "subject" : "10014",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200380,
        "pId" : "200309",
        "name" : "电磁学",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200381,
        "pId" : "200380",
        "name" : "电流和电路",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200382,
        "pId" : "200381",
        "name" : "电荷",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200383,
        "pId" : "200381",
        "name" : "电流",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200384,
        "pId" : "200381",
        "name" : "电路",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200385,
        "pId" : "200381",
        "name" : "家庭电路",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200386,
        "pId" : "200380",
        "name" : "电压 电阻",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200387,
        "pId" : "200386",
        "name" : "电压",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200388,
        "pId" : "200386",
        "name" : "电阻",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200389,
        "pId" : "200380",
        "name" : "欧姆定律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200390,
        "pId" : "200389",
        "name" : "欧姆定律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200391,
        "pId" : "200390",
        "name" : "欧姆定律的计算及其应用",
        "subject" : "10014",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 200392,
        "pId" : "200380",
        "name" : "电功和电功率",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200393,
        "pId" : "200392",
        "name" : "电功、电能",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200394,
        "pId" : "200392",
        "name" : "电功率",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200395,
        "pId" : "200392",
        "name" : "电热",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200396,
        "pId" : "200380",
        "name" : "电与磁",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200397,
        "pId" : "200396",
        "name" : "磁现象",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200398,
        "pId" : "200396",
        "name" : "磁场",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200399,
        "pId" : "200396",
        "name" : "电生磁",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200400,
        "pId" : "200396",
        "name" : "磁生电",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200401,
        "pId" : "200396",
        "name" : "电动机",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200402,
        "pId" : "200380",
        "name" : "电磁波",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200403,
        "pId" : "200309",
        "name" : "能源、材料与社会",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200404,
        "pId" : "200403",
        "name" : "能源与可持续发展",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200405,
        "pId" : "200403",
        "name" : "能量的转化和守恒",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200406,
        "pId" : "200403",
        "name" : "材料的开发利用",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200407,
        "pId" : "200309",
        "name" : "机械运动",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200408,
        "pId" : "200407",
        "name" : "长度和时间的测量",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200409,
        "pId" : "200408",
        "name" : "长度的测量",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200410,
        "pId" : "200408",
        "name" : "时间的测量",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200411,
        "pId" : "200407",
        "name" : "运动",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200412,
        "pId" : "200411",
        "name" : "机械运动",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200413,
        "pId" : "200411",
        "name" : "速度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 200414,
        "pId" : "0",
        "name" : "化学(初中部)",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200415,
        "pId" : "200414",
        "name" : "物质构成的奥秘",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200416,
        "pId" : "200415",
        "name" : "化学用语和化学量",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200417,
        "pId" : "200416",
        "name" : "离子符号与化合价的表示",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200418,
        "pId" : "200416",
        "name" : "微粒的结构示意图",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200419,
        "pId" : "200416",
        "name" : "元素符号",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200420,
        "pId" : "200416",
        "name" : "化合价与化学式",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200421,
        "pId" : "200416",
        "name" : "化学用语中数字的意义",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200422,
        "pId" : "200416",
        "name" : "化学方程式",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200423,
        "pId" : "200415",
        "name" : "物质的组成与结构",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200424,
        "pId" : "200423",
        "name" : "分子与原子",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200425,
        "pId" : "200423",
        "name" : "原子结构",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200426,
        "pId" : "200423",
        "name" : "离子",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200427,
        "pId" : "200423",
        "name" : "元素",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200428,
        "pId" : "200415",
        "name" : "物质的分类和命名",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200429,
        "pId" : "200428",
        "name" : "混合物和纯净物",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200430,
        "pId" : "200428",
        "name" : "单质和化合物",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200431,
        "pId" : "200428",
        "name" : "有机化合物和无机化合物",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200432,
        "pId" : "200428",
        "name" : "氧化物",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200433,
        "pId" : "200428",
        "name" : "酸碱盐",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200434,
        "pId" : "200428",
        "name" : "常见分类物质的性质、特征、用途",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200435,
        "pId" : "200414",
        "name" : "化学与社会发展",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200436,
        "pId" : "200435",
        "name" : "化学与健康",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200437,
        "pId" : "200436",
        "name" : "人类重要的营养物质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200438,
        "pId" : "200436",
        "name" : "远离有毒物质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200439,
        "pId" : "200436",
        "name" : "化学元素与健康",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200440,
        "pId" : "200435",
        "name" : "化学与材料",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200441,
        "pId" : "200435",
        "name" : "化学与能源",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200442,
        "pId" : "200435",
        "name" : "化学与环境",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200443,
        "pId" : "200414",
        "name" : "化学计算",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200444,
        "pId" : "200443",
        "name" : "有关化学式的计算",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200445,
        "pId" : "200443",
        "name" : "化学方程式的有关计算",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200446,
        "pId" : "200443",
        "name" : "溶液中溶质的质量分数计算",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200447,
        "pId" : "200443",
        "name" : "综合计算",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200448,
        "pId" : "200414",
        "name" : "科学探究",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200449,
        "pId" : "200448",
        "name" : "常见仪器和基本操作",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200450,
        "pId" : "200448",
        "name" : "气体的制取和净化",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200451,
        "pId" : "200448",
        "name" : "化学实验中物质的推断与鉴别",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200452,
        "pId" : "200448",
        "name" : "物质的分离与提纯",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200453,
        "pId" : "200448",
        "name" : "实验设计及实验方案的评价",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200454,
        "pId" : "200414",
        "name" : "身边的化学物质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200455,
        "pId" : "200454",
        "name" : "空气",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200456,
        "pId" : "200455",
        "name" : "空气的主要成分",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200457,
        "pId" : "200455",
        "name" : "空气的污染和保护",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200458,
        "pId" : "200454",
        "name" : "水",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200459,
        "pId" : "200458",
        "name" : "水的组成与性质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200460,
        "pId" : "200458",
        "name" : "水的净化以及保护",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200461,
        "pId" : "200454",
        "name" : "碳和碳的化合物",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200462,
        "pId" : "200461",
        "name" : "金刚石、石墨和碳60以及无定形碳",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200463,
        "pId" : "200461",
        "name" : "二氧化碳和一氧化碳",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200464,
        "pId" : "200454",
        "name" : "燃料及其利用",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200465,
        "pId" : "200464",
        "name" : "燃烧和灭火",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200466,
        "pId" : "200464",
        "name" : "使用燃料对环境的影响",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200467,
        "pId" : "200454",
        "name" : "金属和金属材料",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200468,
        "pId" : "200467",
        "name" : "金属材料和合金",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200469,
        "pId" : "200467",
        "name" : "金属的化学性质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200470,
        "pId" : "200467",
        "name" : "金属资源的利用、污染以及保护",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200471,
        "pId" : "200454",
        "name" : "溶液",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200472,
        "pId" : "200471",
        "name" : "溶液的形成",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200473,
        "pId" : "200471",
        "name" : "饱和溶液和不饱和溶液",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200474,
        "pId" : "200471",
        "name" : "乳化现象和结晶现象",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200475,
        "pId" : "200471",
        "name" : "溶解度",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200476,
        "pId" : "200471",
        "name" : "溶液组成的表示",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200477,
        "pId" : "200454",
        "name" : "氧气",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200478,
        "pId" : "200477",
        "name" : "氧气以及氧气的性质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200479,
        "pId" : "200477",
        "name" : "制取氧气",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200480,
        "pId" : "200454",
        "name" : "酸、碱、盐",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200481,
        "pId" : "200480",
        "name" : "常见的酸和碱的性质和用途",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200482,
        "pId" : "200480",
        "name" : "生活中的盐和化学肥料",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200483,
        "pId" : "200480",
        "name" : "溶液的pH",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200484,
        "pId" : "200480",
        "name" : "中和反应",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200485,
        "pId" : "200414",
        "name" : "物质的化学变化",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200486,
        "pId" : "200485",
        "name" : "质量守恒定律",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200487,
        "pId" : "200485",
        "name" : "物质的变化和性质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200488,
        "pId" : "200487",
        "name" : "物理变化和化学变化",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200489,
        "pId" : "200487",
        "name" : "物理性质和化学性质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200490,
        "pId" : "200485",
        "name" : "四种基本反应类型",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200491,
        "pId" : "200485",
        "name" : "氧化还原反应",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 200492,
        "pId" : "0",
        "name" : "地理(初中部)",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200493,
        "pId" : "200492",
        "name" : "地球与地图",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200494,
        "pId" : "200493",
        "name" : "地球",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200495,
        "pId" : "200493",
        "name" : "地图",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200496,
        "pId" : "200493",
        "name" : "地球运动",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200497,
        "pId" : "200492",
        "name" : "世界地理",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200498,
        "pId" : "200497",
        "name" : "世界的陆地与海洋",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200499,
        "pId" : "200498",
        "name" : "大洲与大洋的分布",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200500,
        "pId" : "200498",
        "name" : "陆地地形与海底地形",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200501,
        "pId" : "200498",
        "name" : "板块构造学说的内容和应用",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200502,
        "pId" : "200497",
        "name" : "世界的气候",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200503,
        "pId" : "200502",
        "name" : "气候的形成与变化",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200504,
        "pId" : "200502",
        "name" : "气候对人类的影响",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200505,
        "pId" : "200497",
        "name" : "世界的居民与国家",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200506,
        "pId" : "200505",
        "name" : "世界居民",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200507,
        "pId" : "200505",
        "name" : "世界聚落与国家",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200508,
        "pId" : "200497",
        "name" : "世界地理分区与国家",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200509,
        "pId" : "200508",
        "name" : "亚洲概况",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200510,
        "pId" : "200508",
        "name" : "东亚与日本",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200511,
        "pId" : "200508",
        "name" : "东南亚",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200512,
        "pId" : "200508",
        "name" : "南亚与印度",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200513,
        "pId" : "200508",
        "name" : "俄罗斯",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200514,
        "pId" : "200508",
        "name" : "中东",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200515,
        "pId" : "200508",
        "name" : "埃及",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200516,
        "pId" : "200508",
        "name" : "撒哈拉以南非洲",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200517,
        "pId" : "200508",
        "name" : "欧洲西部",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200518,
        "pId" : "200508",
        "name" : "大洋洲与澳大利亚",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200519,
        "pId" : "200508",
        "name" : "北美与美国",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200520,
        "pId" : "200508",
        "name" : "拉丁美洲与巴西",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200521,
        "pId" : "200508",
        "name" : "两极地区",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200522,
        "pId" : "200492",
        "name" : "中国地理",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200523,
        "pId" : "200522",
        "name" : "我国的疆域与人口",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200524,
        "pId" : "200523",
        "name" : "我国的疆域与行政区划",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200525,
        "pId" : "200523",
        "name" : "我国人口与民族",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200526,
        "pId" : "200522",
        "name" : "我国的自然环境与自然资源",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200527,
        "pId" : "200526",
        "name" : "我国的自然环境",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200528,
        "pId" : "200526",
        "name" : "我国的自然资源",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200529,
        "pId" : "200522",
        "name" : "我国的经济与文化",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200530,
        "pId" : "200529",
        "name" : "我国的交通",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200531,
        "pId" : "200529",
        "name" : "我国的农业",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200532,
        "pId" : "200529",
        "name" : "我国的工业",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200533,
        "pId" : "200529",
        "name" : "我国的文化",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200534,
        "pId" : "200522",
        "name" : "中国的地理差异",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200535,
        "pId" : "200534",
        "name" : "我国的区域划分",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200536,
        "pId" : "200534",
        "name" : "东北地区",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200537,
        "pId" : "200534",
        "name" : "黄土高原",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200538,
        "pId" : "200534",
        "name" : "华北地区与北京市",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200539,
        "pId" : "200534",
        "name" : "长江沿江地带",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200540,
        "pId" : "200534",
        "name" : "长江三角洲",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200541,
        "pId" : "200534",
        "name" : "珠江三角洲",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200542,
        "pId" : "200534",
        "name" : "西南地区与西双版纳",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200543,
        "pId" : "200534",
        "name" : "西北地区",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200544,
        "pId" : "200534",
        "name" : "青藏地区",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200545,
        "pId" : "200534",
        "name" : "中国的地位与责任",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 200546,
        "pId" : "0",
        "name" : "思想品德(初中部)",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200547,
        "pId" : "200546",
        "name" : "心理道德",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200548,
        "pId" : "200547",
        "name" : "认识自我 悦纳自我",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200549,
        "pId" : "200547",
        "name" : "珍爱生命",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200550,
        "pId" : "200547",
        "name" : "实现人生价值",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200551,
        "pId" : "200547",
        "name" : "克服青春期烦恼",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200552,
        "pId" : "200547",
        "name" : "青春期闭锁心理",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200553,
        "pId" : "200547",
        "name" : "学会控制情绪",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200554,
        "pId" : "200547",
        "name" : "磨砺坚强意志",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200555,
        "pId" : "200547",
        "name" : "顺境和逆境",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200556,
        "pId" : "200547",
        "name" : "成功与挫折",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200557,
        "pId" : "200547",
        "name" : "自强不息、自尊、自信、自爱",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200558,
        "pId" : "200547",
        "name" : "正确认识自己",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200559,
        "pId" : "200547",
        "name" : "孝敬父母",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200560,
        "pId" : "200547",
        "name" : "逆反心理",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200561,
        "pId" : "200547",
        "name" : "尊敬老师",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200562,
        "pId" : "200547",
        "name" : "竞争和合作",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200563,
        "pId" : "200547",
        "name" : "学习压力和考试焦虑",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200564,
        "pId" : "200547",
        "name" : "换位思考与与人为善",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200565,
        "pId" : "200547",
        "name" : "与人交往",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200566,
        "pId" : "200547",
        "name" : "学会选择",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200567,
        "pId" : "200547",
        "name" : "公平、正义",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200568,
        "pId" : "200547",
        "name" : "个人与集体",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200569,
        "pId" : "200547",
        "name" : "诚实守信",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200570,
        "pId" : "200547",
        "name" : "做负责任的公民",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200571,
        "pId" : "200546",
        "name" : "法律部分",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200572,
        "pId" : "200571",
        "name" : "不良诱惑、自我保护和防微杜渐",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200573,
        "pId" : "200571",
        "name" : "法律观念和法律意识",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200574,
        "pId" : "200571",
        "name" : "违法与犯罪",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200575,
        "pId" : "200571",
        "name" : "未成年人保护",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200576,
        "pId" : "200571",
        "name" : "权利和义务",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200577,
        "pId" : "200571",
        "name" : "受教育权",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200578,
        "pId" : "200571",
        "name" : "宪法意识",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200579,
        "pId" : "200571",
        "name" : "依法治国",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200580,
        "pId" : "200546",
        "name" : "国情部分",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200581,
        "pId" : "200580",
        "name" : "我国的基本国情",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200582,
        "pId" : "200580",
        "name" : "科教兴国战略",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200583,
        "pId" : "200580",
        "name" : "可持续发展战略",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200584,
        "pId" : "200583",
        "name" : "我国的人口、资源、环境等状况",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200585,
        "pId" : "200583",
        "name" : "计划生育的国策",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200586,
        "pId" : "200583",
        "name" : "保护环境国策",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200587,
        "pId" : "200580",
        "name" : "对外开放国策",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200588,
        "pId" : "200580",
        "name" : "国家安全、民族团结和国家统一",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200589,
        "pId" : "200580",
        "name" : "全面建成小康社会",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200590,
        "pId" : "200580",
        "name" : "艰苦奋斗",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200591,
        "pId" : "200580",
        "name" : "中国特色社会主义",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200592,
        "pId" : "200591",
        "name" : "政治",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200593,
        "pId" : "200591",
        "name" : "经济",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200594,
        "pId" : "200591",
        "name" : "文化",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200595,
        "pId" : "200580",
        "name" : "树立全球观念",
        "subject" : "10029",
        "grade" : "20202"
    },
    {
        "id" : 200596,
        "pId" : "0",
        "name" : "历史(初中部)",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200597,
        "pId" : "200596",
        "name" : "中国古代史",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200598,
        "pId" : "200597",
        "name" : "中华文明起源、国家的产生和社会的变革",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200599,
        "pId" : "200598",
        "name" : "中华大地的远古人类",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200600,
        "pId" : "200598",
        "name" : "禅让制到世袭制的演变",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200601,
        "pId" : "200598",
        "name" : "夏、商、西周三代的更替",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200602,
        "pId" : "200598",
        "name" : "西周分封制",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200603,
        "pId" : "200598",
        "name" : "春秋五霸与战国七雄",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200604,
        "pId" : "200598",
        "name" : "战国时期的社会变革",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200605,
        "pId" : "200597",
        "name" : "统一国家的建立、政权分立与民族融合",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200606,
        "pId" : "200605",
        "name" : "秦统一六国和秦始皇加强中央集权",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200607,
        "pId" : "200605",
        "name" : "汉武帝的大一统",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200608,
        "pId" : "200605",
        "name" : "张骞通西域及丝绸之路",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200609,
        "pId" : "200605",
        "name" : "三国鼎立的形成",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200610,
        "pId" : "200605",
        "name" : "江南地区的开发",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200611,
        "pId" : "200605",
        "name" : "北魏孝文帝改革",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200612,
        "pId" : "200597",
        "name" : "繁荣与开放的社会、经济重心的南移和民族关系的发展",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200613,
        "pId" : "200612",
        "name" : "隋朝的统一",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200614,
        "pId" : "200612",
        "name" : "“贞观之治”和“开元盛世”",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200615,
        "pId" : "200612",
        "name" : "科举制",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200616,
        "pId" : "200612",
        "name" : "唐朝的民族关系、对外关系",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200617,
        "pId" : "200612",
        "name" : "辽、宋、西夏、金等政权的并立",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200618,
        "pId" : "200612",
        "name" : "两宋时期经济发展和经济重心的南移",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200619,
        "pId" : "200597",
        "name" : "统一多民族国家的巩固和社会的危机",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200620,
        "pId" : "200619",
        "name" : "明清加强专制主义中央集权",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200621,
        "pId" : "200619",
        "name" : "郑和下西洋",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200622,
        "pId" : "200619",
        "name" : "明清抗击外来侵略",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200623,
        "pId" : "200619",
        "name" : "闭关锁国",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200624,
        "pId" : "200597",
        "name" : "中国古代的科学技术与思想文化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200625,
        "pId" : "200624",
        "name" : "百家争鸣",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200626,
        "pId" : "200624",
        "name" : "科学技术",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200627,
        "pId" : "200624",
        "name" : "文学艺术成就",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200628,
        "pId" : "200596",
        "name" : "中国近代史",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200629,
        "pId" : "200628",
        "name" : "列强的侵略和中国人民的抗争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200630,
        "pId" : "200629",
        "name" : "鸦片战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200631,
        "pId" : "200629",
        "name" : "第二次鸦片战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200632,
        "pId" : "200629",
        "name" : "甲午中日战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200633,
        "pId" : "200629",
        "name" : "八国联军侵华战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200634,
        "pId" : "200629",
        "name" : "中国人民的抗争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200635,
        "pId" : "200628",
        "name" : "近代化的探索",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200636,
        "pId" : "200635",
        "name" : "洋务运动",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200637,
        "pId" : "200635",
        "name" : "戊戌变法",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200638,
        "pId" : "200635",
        "name" : "孙中山革命运动",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200639,
        "pId" : "200635",
        "name" : "新文化运动",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200640,
        "pId" : "200628",
        "name" : "新民主主义革命的兴起",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200641,
        "pId" : "200640",
        "name" : "五四运动和中国共产党的成立",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200642,
        "pId" : "200640",
        "name" : "黄埔军校与北伐战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200643,
        "pId" : "200640",
        "name" : "南京国民政府",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200644,
        "pId" : "200640",
        "name" : "南昌起义",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200645,
        "pId" : "200640",
        "name" : "农村革命根据地的创建",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200646,
        "pId" : "200640",
        "name" : "红军长征",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200647,
        "pId" : "200628",
        "name" : "中华民族的抗日战争与人民解放战争的胜利",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200648,
        "pId" : "200647",
        "name" : "抗日战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200649,
        "pId" : "200647",
        "name" : "人民解放战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200650,
        "pId" : "200628",
        "name" : "中国近代经济和社会生活、科技教育与思想文化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200651,
        "pId" : "200650",
        "name" : "张謇“实业救国”",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200652,
        "pId" : "200650",
        "name" : "近代社会生活",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200653,
        "pId" : "200650",
        "name" : "科技、教育、思想文化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200654,
        "pId" : "200596",
        "name" : "中国现代史",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200655,
        "pId" : "200654",
        "name" : "中华人民共和国的成立和巩固",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200656,
        "pId" : "200655",
        "name" : "新中国成立",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200657,
        "pId" : "200655",
        "name" : "西藏和平解放",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200658,
        "pId" : "200655",
        "name" : "抗美援朝",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200659,
        "pId" : "200655",
        "name" : "土地改革",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200660,
        "pId" : "200654",
        "name" : "社会主义道路的探索",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200661,
        "pId" : "200660",
        "name" : "第一个五年计划",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200662,
        "pId" : "200660",
        "name" : "《中华人民共和国宪法》",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200663,
        "pId" : "200660",
        "name" : "三大改造",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200664,
        "pId" : "200660",
        "name" : "“大跃进”和人民公社化运动",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200665,
        "pId" : "200660",
        "name" : "“文化大革命”的严重危害及主要教训",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200666,
        "pId" : "200654",
        "name" : "建设有中国特色的社会主义",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200667,
        "pId" : "200666",
        "name" : "中共十一届三中全会",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200668,
        "pId" : "200666",
        "name" : "新中国的民主法制建设",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200669,
        "pId" : "200666",
        "name" : "改革开放",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200670,
        "pId" : "200666",
        "name" : "中国特色的社会主义理论",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200671,
        "pId" : "200654",
        "name" : "民族团结与祖国统一、国防建设与外交成就",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200672,
        "pId" : "200671",
        "name" : "民族区域自治制度",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200673,
        "pId" : "200671",
        "name" : "一国两制",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200674,
        "pId" : "200671",
        "name" : "新中国的外交",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200675,
        "pId" : "200654",
        "name" : "中国现代科技、教育、文化与社会生活",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200676,
        "pId" : "200675",
        "name" : "科技成就",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200677,
        "pId" : "200675",
        "name" : "教育事业",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200678,
        "pId" : "200675",
        "name" : "文学艺术",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200679,
        "pId" : "200675",
        "name" : "社会生活",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200680,
        "pId" : "200596",
        "name" : "世界古代史",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200681,
        "pId" : "200680",
        "name" : "上古人类文明和中古亚欧文明",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200682,
        "pId" : "200681",
        "name" : "大河流域与四大古国",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200683,
        "pId" : "200681",
        "name" : "西方民主政治的源头",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200684,
        "pId" : "200681",
        "name" : "日本大化改新",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200685,
        "pId" : "200681",
        "name" : "西欧城市兴起",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200686,
        "pId" : "200681",
        "name" : "阿拉伯国家的建立",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200687,
        "pId" : "200680",
        "name" : "文明的冲撞、融合和科技与思想文化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200688,
        "pId" : "200687",
        "name" : "东西方文化交流",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200689,
        "pId" : "200687",
        "name" : "世界三大宗教",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200690,
        "pId" : "200687",
        "name" : "古代世界科技文艺",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200691,
        "pId" : "200596",
        "name" : "世界近代史",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200692,
        "pId" : "200691",
        "name" : "欧美主要国家的社会巨变",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200693,
        "pId" : "200692",
        "name" : "文艺复兴",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200694,
        "pId" : "200692",
        "name" : "新航路开辟",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200695,
        "pId" : "200692",
        "name" : "早期资产阶级革命（英法美）",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200696,
        "pId" : "200692",
        "name" : "华盛顿、拿破仑的主要史实",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200697,
        "pId" : "200692",
        "name" : "工业革命",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200698,
        "pId" : "200691",
        "name" : "殖民扩张、殖民地人民的抗争和无产阶级的斗争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200699,
        "pId" : "200698",
        "name" : "三角贸易",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200700,
        "pId" : "200698",
        "name" : "殖民抗争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200701,
        "pId" : "200698",
        "name" : "《共产党宣言》",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200702,
        "pId" : "200698",
        "name" : "巴黎公社",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200703,
        "pId" : "200691",
        "name" : "资产阶级统治的巩固与扩大",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200704,
        "pId" : "200703",
        "name" : "美国南北战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200705,
        "pId" : "200703",
        "name" : "俄国农奴制改革",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200706,
        "pId" : "200703",
        "name" : "日本明治维新",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200707,
        "pId" : "200691",
        "name" : "垄断资本主义时代的世界与近代科学思想文化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200708,
        "pId" : "200707",
        "name" : "第二次工业革命",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200709,
        "pId" : "200707",
        "name" : "三国同盟、三国协约",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200710,
        "pId" : "200707",
        "name" : "一战",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200711,
        "pId" : "200707",
        "name" : "启蒙运动",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200712,
        "pId" : "200707",
        "name" : "近代科学思想文化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200713,
        "pId" : "200596",
        "name" : "世界现代史",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200714,
        "pId" : "200713",
        "name" : "一战后的东西方世界",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200715,
        "pId" : "200714",
        "name" : "十月革命",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200716,
        "pId" : "200714",
        "name" : "新经济政策与斯大林模式",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200717,
        "pId" : "200714",
        "name" : "凡尔赛—华盛顿",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200718,
        "pId" : "200714",
        "name" : "1929—1933年资本主义世界经济危机",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200719,
        "pId" : "200714",
        "name" : "罗斯福新政",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200720,
        "pId" : "200714",
        "name" : "德、意、日法西斯反人类的暴行",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200721,
        "pId" : "200713",
        "name" : "第二次世界大战及战后主要资本主义国家的发展变化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200722,
        "pId" : "200721",
        "name" : "二战",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200723,
        "pId" : "200721",
        "name" : "世界反法西斯战争的胜利",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200724,
        "pId" : "200721",
        "name" : "战后主要资本主义国家的发展变化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200725,
        "pId" : "200713",
        "name" : "社会主义国家的改革与演变和亚非拉国家的独立和振兴",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200726,
        "pId" : "200725",
        "name" : "苏联和东欧社会主义国家建设",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200727,
        "pId" : "200725",
        "name" : "亚、非、拉美的民族独立与振兴",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200728,
        "pId" : "200725",
        "name" : "东欧剧变与苏联解体",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200729,
        "pId" : "200713",
        "name" : "战后世界格局与世界现代科技与思想文化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200730,
        "pId" : "200729",
        "name" : "冷战",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200731,
        "pId" : "200729",
        "name" : "美苏争霸",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200732,
        "pId" : "200729",
        "name" : "世界政治格局的多极化趋势",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200733,
        "pId" : "200729",
        "name" : "世界经济全球化",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200734,
        "pId" : "200729",
        "name" : "第三次科技革命",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200735,
        "pId" : "200729",
        "name" : "现代文学和美术、现代音乐和电影",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 200736,
        "pId" : "0",
        "name" : "语文(高中部)",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 200783,
        "pId" : "0",
        "name" : "数学(高中部)",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200784,
        "pId" : "200783",
        "name" : "集合和常用逻辑",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200785,
        "pId" : "200784",
        "name" : "集合",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200786,
        "pId" : "200785",
        "name" : "集合的含义与表示",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200787,
        "pId" : "200785",
        "name" : "集合间的基本关系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200788,
        "pId" : "200785",
        "name" : "集合的基本运算",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200789,
        "pId" : "200784",
        "name" : "常用逻辑用语",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200790,
        "pId" : "200789",
        "name" : "命题及其关系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200791,
        "pId" : "200789",
        "name" : "充分条件与必要条件",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200792,
        "pId" : "200789",
        "name" : "简单的逻辑联结词",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200793,
        "pId" : "200789",
        "name" : "全称量词与存在性量词",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200794,
        "pId" : "200783",
        "name" : "函数与导数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200795,
        "pId" : "200794",
        "name" : "函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200796,
        "pId" : "200795",
        "name" : "函数及其表示",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200797,
        "pId" : "200795",
        "name" : "函数的定义域与值域",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200798,
        "pId" : "200795",
        "name" : "函数的解析式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200799,
        "pId" : "200795",
        "name" : "映射",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200800,
        "pId" : "200795",
        "name" : "反函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200801,
        "pId" : "200795",
        "name" : "函数的图像",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200802,
        "pId" : "200795",
        "name" : "函数的单调性与最值",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200803,
        "pId" : "200795",
        "name" : "函数的奇偶性",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200804,
        "pId" : "200795",
        "name" : "函数的周期性与对称性",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200805,
        "pId" : "200794",
        "name" : "基本初等函数I与应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200806,
        "pId" : "200805",
        "name" : "一次函数与二次函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200807,
        "pId" : "200805",
        "name" : "指数与指数函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200808,
        "pId" : "200805",
        "name" : "对数与对数函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200809,
        "pId" : "200805",
        "name" : "指数方程与对数方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200810,
        "pId" : "200805",
        "name" : "幂函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200811,
        "pId" : "200805",
        "name" : "函数与方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200812,
        "pId" : "200805",
        "name" : "函数模型及其应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200813,
        "pId" : "200805",
        "name" : "函数综合",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200814,
        "pId" : "200794",
        "name" : "导数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200815,
        "pId" : "200814",
        "name" : "导数的概念与几何意义",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200816,
        "pId" : "200814",
        "name" : "导数计算",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200817,
        "pId" : "200814",
        "name" : "利用导数研究函数的单调性",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200818,
        "pId" : "200814",
        "name" : "利用导数求极值和最值",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200819,
        "pId" : "200814",
        "name" : "利用导数证明不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200820,
        "pId" : "200814",
        "name" : "导数的实际应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200821,
        "pId" : "200814",
        "name" : "导数的综合运用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200822,
        "pId" : "200814",
        "name" : "定积分与微积分基本定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200823,
        "pId" : "200794",
        "name" : "极限",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200824,
        "pId" : "200823",
        "name" : "数列的极限",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200825,
        "pId" : "200823",
        "name" : "函数的极限",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200826,
        "pId" : "200823",
        "name" : "极限的四则运算",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200827,
        "pId" : "200823",
        "name" : "函数的连续性",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200828,
        "pId" : "200783",
        "name" : "三角函数、三角恒等变换、解三角形",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200829,
        "pId" : "200828",
        "name" : "三角函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200830,
        "pId" : "200829",
        "name" : "任意角、弧度制和任意角的三角函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200831,
        "pId" : "200829",
        "name" : "同角三角函数的基本关系式和诱导公式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200832,
        "pId" : "200829",
        "name" : "三角函数的图像与性质",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200833,
        "pId" : "200829",
        "name" : "三角函数的图像变换",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200834,
        "pId" : "200829",
        "name" : "反三角函数与简单的三角方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200835,
        "pId" : "200829",
        "name" : "三角函数模型的应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200836,
        "pId" : "200828",
        "name" : "三角恒等变换",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200837,
        "pId" : "200836",
        "name" : "两角和与差的三角函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200838,
        "pId" : "200836",
        "name" : "倍角公式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200839,
        "pId" : "200836",
        "name" : "简单的三角恒等变换",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200840,
        "pId" : "200828",
        "name" : "解三角形",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200841,
        "pId" : "200840",
        "name" : "正弦定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200842,
        "pId" : "200840",
        "name" : "余弦定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200843,
        "pId" : "200840",
        "name" : "正弦定理与余弦定理的实际应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200844,
        "pId" : "200828",
        "name" : "三角函数综合应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200845,
        "pId" : "200783",
        "name" : "平面向量",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200846,
        "pId" : "200845",
        "name" : "平面向量的概念及其线性运算",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200847,
        "pId" : "200846",
        "name" : "平面向量的概念",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200848,
        "pId" : "200846",
        "name" : "平面向量的线性运算",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200849,
        "pId" : "200845",
        "name" : "平面向量的基本定理及坐标表示",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200850,
        "pId" : "200849",
        "name" : "平面向量的基本定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200851,
        "pId" : "200849",
        "name" : "平面向量坐标运算",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200852,
        "pId" : "200845",
        "name" : "平面向量的数量积",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200853,
        "pId" : "200852",
        "name" : "平面向量的数量积的定义",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200854,
        "pId" : "200852",
        "name" : "平面向量的数量积的应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200855,
        "pId" : "200845",
        "name" : "线段的定比分点",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200856,
        "pId" : "200845",
        "name" : "平移",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200857,
        "pId" : "200845",
        "name" : "平面向量的应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200858,
        "pId" : "200857",
        "name" : "平面向量的物理应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200859,
        "pId" : "200857",
        "name" : "平面向量的几何应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200860,
        "pId" : "200783",
        "name" : "数列",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200861,
        "pId" : "200860",
        "name" : "数列的概念和表示法",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200862,
        "pId" : "200860",
        "name" : "等差数列",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200863,
        "pId" : "200860",
        "name" : "等比数列",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200864,
        "pId" : "200860",
        "name" : "数列求和",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200865,
        "pId" : "200864",
        "name" : "公式法、分组求和",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200866,
        "pId" : "200864",
        "name" : "倒序相加，错位相减，裂项相消求和",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200867,
        "pId" : "200860",
        "name" : "数列的综合应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200868,
        "pId" : "200783",
        "name" : "不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200869,
        "pId" : "200868",
        "name" : "不等式的性质",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200870,
        "pId" : "200868",
        "name" : "解不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200871,
        "pId" : "200870",
        "name" : "一元二次不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200872,
        "pId" : "200870",
        "name" : "绝对值不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200873,
        "pId" : "200870",
        "name" : "分式不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200874,
        "pId" : "200868",
        "name" : "基本不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200875,
        "pId" : "200868",
        "name" : "线性规划",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200876,
        "pId" : "200875",
        "name" : "二元一次不等式（组）表示的平面区域",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200877,
        "pId" : "200875",
        "name" : "线性规划",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200878,
        "pId" : "200868",
        "name" : "不等式选讲",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200879,
        "pId" : "200878",
        "name" : "绝对值不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200880,
        "pId" : "200878",
        "name" : "柯西不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200881,
        "pId" : "200878",
        "name" : "排序不等式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200882,
        "pId" : "200878",
        "name" : "不等式的证明",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200883,
        "pId" : "200783",
        "name" : "立体几何",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200884,
        "pId" : "200883",
        "name" : "空间几何体",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200885,
        "pId" : "200884",
        "name" : "柱、锥、台、球的结构特征",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200886,
        "pId" : "200884",
        "name" : "空间几何体的三视图和直观图",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200887,
        "pId" : "200884",
        "name" : "空间几何体的表面积和体积",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200888,
        "pId" : "200883",
        "name" : "空间点、线、面之间的位置关系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200889,
        "pId" : "200888",
        "name" : "平行",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200890,
        "pId" : "200888",
        "name" : "垂直",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200891,
        "pId" : "200888",
        "name" : "距离",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200892,
        "pId" : "200888",
        "name" : "角",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200893,
        "pId" : "200883",
        "name" : "空间向量",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200894,
        "pId" : "200893",
        "name" : "空间直角坐标系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200895,
        "pId" : "200893",
        "name" : "空间向量及其运算",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200896,
        "pId" : "200893",
        "name" : "空间向量的应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200897,
        "pId" : "200783",
        "name" : "解析几何",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200898,
        "pId" : "200897",
        "name" : "直线",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200899,
        "pId" : "200898",
        "name" : "直线的倾斜角与斜率",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200900,
        "pId" : "200898",
        "name" : "直线的方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200901,
        "pId" : "200898",
        "name" : "两直线的位置关系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200902,
        "pId" : "200898",
        "name" : "距离",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200903,
        "pId" : "200897",
        "name" : "圆",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200904,
        "pId" : "200903",
        "name" : "圆的标准方程与一般方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200905,
        "pId" : "200903",
        "name" : "直线与圆的位置关系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200906,
        "pId" : "200897",
        "name" : "圆锥曲线",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200907,
        "pId" : "200906",
        "name" : "椭圆",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200908,
        "pId" : "200906",
        "name" : "双曲线",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200909,
        "pId" : "200906",
        "name" : "抛物线",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200910,
        "pId" : "200906",
        "name" : "直线与圆锥曲线的位置",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200911,
        "pId" : "200906",
        "name" : "曲线与方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200912,
        "pId" : "200897",
        "name" : "坐标系与参数方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200913,
        "pId" : "200912",
        "name" : "平面直角坐标系与平面上的伸缩变换",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200914,
        "pId" : "200912",
        "name" : "极坐标系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200915,
        "pId" : "200912",
        "name" : "简单曲线的极坐标方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200916,
        "pId" : "200912",
        "name" : "柱坐标系和球坐标系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200917,
        "pId" : "200912",
        "name" : "参数方程的概念以及参数方程与普通方程的互化",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200918,
        "pId" : "200912",
        "name" : "直线的参数方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200919,
        "pId" : "200912",
        "name" : "圆的参数方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200920,
        "pId" : "200912",
        "name" : "圆锥曲线的参数方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200921,
        "pId" : "200783",
        "name" : "计数原理与概率统计",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200922,
        "pId" : "200921",
        "name" : "计数原理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200923,
        "pId" : "200922",
        "name" : "分类加法计数原理与分步乘法计数原理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200924,
        "pId" : "200922",
        "name" : "排列与组合",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200925,
        "pId" : "200922",
        "name" : "二项式定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200926,
        "pId" : "200921",
        "name" : "统计与概率",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200927,
        "pId" : "200926",
        "name" : "抽样",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200928,
        "pId" : "200926",
        "name" : "用样本估计总体",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200929,
        "pId" : "200926",
        "name" : "变量的相关性",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200930,
        "pId" : "200926",
        "name" : "统计案例",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200931,
        "pId" : "200926",
        "name" : "事件与概率",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200932,
        "pId" : "200926",
        "name" : "古典概型",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200933,
        "pId" : "200926",
        "name" : "几何概型",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200934,
        "pId" : "200926",
        "name" : "取有限值的离散型随机变量及其分布列",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200935,
        "pId" : "200926",
        "name" : "超几何分布",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200936,
        "pId" : "200926",
        "name" : "条件概率",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200937,
        "pId" : "200926",
        "name" : "独立事件与乘法公式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200938,
        "pId" : "200926",
        "name" : "n次独立重复试验与二项分布",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200939,
        "pId" : "200926",
        "name" : "取有限值的离散型随机变量的均值、方差",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200940,
        "pId" : "200926",
        "name" : "正态分布",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200941,
        "pId" : "200783",
        "name" : "算法与框图",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200942,
        "pId" : "200941",
        "name" : "框图",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200943,
        "pId" : "200942",
        "name" : "结构图、流程图",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200944,
        "pId" : "200941",
        "name" : "算法初步",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200945,
        "pId" : "200944",
        "name" : "算法的概念",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200946,
        "pId" : "200944",
        "name" : "程序框图的三种基本逻辑结构",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200947,
        "pId" : "200944",
        "name" : "基本算法语句",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200948,
        "pId" : "200944",
        "name" : "中国古代算法案例",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200949,
        "pId" : "200783",
        "name" : "推理与证明、数系的扩充与复数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200950,
        "pId" : "200949",
        "name" : "推理与证明",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200951,
        "pId" : "200950",
        "name" : "合情推理与演绎推理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200952,
        "pId" : "200950",
        "name" : "直接证明与间接证明",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200953,
        "pId" : "200950",
        "name" : "数学归纳法",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200954,
        "pId" : "200949",
        "name" : "复数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200955,
        "pId" : "200954",
        "name" : "复数的概念与向量表示",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200956,
        "pId" : "200954",
        "name" : "复数的加减及几何意义",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200957,
        "pId" : "200954",
        "name" : "复数的乘除",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200958,
        "pId" : "200783",
        "name" : "矩阵与行列式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200959,
        "pId" : "200958",
        "name" : "矩阵与变换",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200960,
        "pId" : "200959",
        "name" : "线性变换与二阶矩阵",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200961,
        "pId" : "200959",
        "name" : "变换的复合与二阶矩阵的惩罚",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200962,
        "pId" : "200959",
        "name" : "逆变换与逆矩阵",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200963,
        "pId" : "200959",
        "name" : "变换的不变量与矩阵的特征向量",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200964,
        "pId" : "200958",
        "name" : "行列式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200965,
        "pId" : "200964",
        "name" : "二阶、三阶行列式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200966,
        "pId" : "200964",
        "name" : "二元、三元线性方程组解的讨论",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200967,
        "pId" : "200783",
        "name" : "几何证明选讲",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200968,
        "pId" : "200967",
        "name" : "相似三角形",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200969,
        "pId" : "200968",
        "name" : "平行截割定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200970,
        "pId" : "200968",
        "name" : "直角三角形射影定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200971,
        "pId" : "200967",
        "name" : "圆",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200972,
        "pId" : "200971",
        "name" : "圆周角定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200973,
        "pId" : "200971",
        "name" : "圆的切线的判定定理及性质定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200974,
        "pId" : "200971",
        "name" : "相交弦定理与切割线定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200975,
        "pId" : "200971",
        "name" : "圆内接四边形的性质定理与判定定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 200976,
        "pId" : "0",
        "name" : "英语(高中部)",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 300100,
        "pId" : "30097",
        "name" : "名词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300101,
        "pId" : "30097",
        "name" : "介词和介词短语",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300102,
        "pId" : "30097",
        "name" : "动词时态",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300103,
        "pId" : "30097",
        "name" : "动词语态",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300104,
        "pId" : "30097",
        "name" : "非谓语动词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300105,
        "pId" : "30097",
        "name" : "情态动词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300106,
        "pId" : "30097",
        "name" : "数词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300107,
        "pId" : "30097",
        "name" : "代词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300108,
        "pId" : "300107",
        "name" : "人称代词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300109,
        "pId" : "300107",
        "name" : "物主代词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300110,
        "pId" : "300107",
        "name" : "不定代词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300111,
        "pId" : "300107",
        "name" : "指示代词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300112,
        "pId" : "30097",
        "name" : "连词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300113,
        "pId" : "30097",
        "name" : "形容词和副词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300114,
        "pId" : "300113",
        "name" : "形容词最高级",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300115,
        "pId" : "300113",
        "name" : "形容词比较级",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300116,
        "pId" : "300113",
        "name" : "副词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300117,
        "pId" : "30097",
        "name" : "构词法",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300118,
        "pId" : "30097",
        "name" : "冠词",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300119,
        "pId" : "20096",
        "name" : "句法",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300120,
        "pId" : "300119",
        "name" : "句子的成分",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300121,
        "pId" : "300119",
        "name" : "句子的分类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300122,
        "pId" : "300119",
        "name" : "简单句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300123,
        "pId" : "300119",
        "name" : "并列句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300124,
        "pId" : "300119",
        "name" : "复合句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300125,
        "pId" : "300119",
        "name" : "主谓一致",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300126,
        "pId" : "300119",
        "name" : "主、表语从句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300127,
        "pId" : "300119",
        "name" : "状语从句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300128,
        "pId" : "300119",
        "name" : "定语从句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300129,
        "pId" : "300128",
        "name" : "非限制性定语从句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300130,
        "pId" : "300119",
        "name" : "宾语从句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300131,
        "pId" : "300119",
        "name" : "反义疑问句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300132,
        "pId" : "300119",
        "name" : "直接引语和间接引语",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300133,
        "pId" : "300119",
        "name" : "句型转换",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300134,
        "pId" : "300119",
        "name" : "虚拟语气",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300135,
        "pId" : "300119",
        "name" : "感叹句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300136,
        "pId" : "300135",
        "name" : "What引导的感叹句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300137,
        "pId" : "300135",
        "name" : "How引导的感叹句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300138,
        "pId" : "300119",
        "name" : "强调句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300139,
        "pId" : "300119",
        "name" : "倒装句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300140,
        "pId" : "300119",
        "name" : "名词性从句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300141,
        "pId" : "300119",
        "name" : "一般疑问句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300142,
        "pId" : "300119",
        "name" : "祈使句",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300143,
        "pId" : "20096",
        "name" : "完型填空",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300144,
        "pId" : "300143",
        "name" : "日常生活类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300145,
        "pId" : "300143",
        "name" : "人生百味类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300146,
        "pId" : "300143",
        "name" : "科普环保类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300147,
        "pId" : "300143",
        "name" : "政治经济文化类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300148,
        "pId" : "300143",
        "name" : "人物传记/故事阅读类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300149,
        "pId" : "300143",
        "name" : "教育类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300150,
        "pId" : "300143",
        "name" : "广告布告类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300151,
        "pId" : "300143",
        "name" : "健康保健类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300152,
        "pId" : "300143",
        "name" : "社会现象类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300153,
        "pId" : "300143",
        "name" : "新闻报道类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300154,
        "pId" : "300143",
        "name" : "社会历史类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300155,
        "pId" : "300143",
        "name" : "记事类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300156,
        "pId" : "300143",
        "name" : "记述文",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300157,
        "pId" : "20096",
        "name" : "阅读理解",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300158,
        "pId" : "300157",
        "name" : "日常生活类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300159,
        "pId" : "300157",
        "name" : "人生百味类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300160,
        "pId" : "300157",
        "name" : "科普环保类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300161,
        "pId" : "300157",
        "name" : "政治经济文化类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300162,
        "pId" : "300157",
        "name" : "人物传记/故事阅读类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300163,
        "pId" : "300157",
        "name" : "教育类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300164,
        "pId" : "300157",
        "name" : "广告布告类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300165,
        "pId" : "300157",
        "name" : "健康保健类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300166,
        "pId" : "300157",
        "name" : "社会现象类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300167,
        "pId" : "300157",
        "name" : "新闻报道类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300168,
        "pId" : "300157",
        "name" : "社会历史类",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300169,
        "pId" : "300157",
        "name" : "说明文",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300170,
        "pId" : "300157",
        "name" : "记述文",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300171,
        "pId" : "20096",
        "name" : "写作",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300172,
        "pId" : "300171",
        "name" : "命题作文",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300173,
        "pId" : "300171",
        "name" : "应用文写作",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300174,
        "pId" : "300171",
        "name" : "看图写话",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300175,
        "pId" : "300171",
        "name" : "其他",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300176,
        "pId" : "300171",
        "name" : "提纲作文",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300177,
        "pId" : "20096",
        "name" : "听说",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300178,
        "pId" : "300177",
        "name" : "语音",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300179,
        "pId" : "300177",
        "name" : "交际",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300180,
        "pId" : "20096",
        "name" : "翻译",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300181,
        "pId" : "300180",
        "name" : "汉译英",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300182,
        "pId" : "300180",
        "name" : "英译汉",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300183,
        "pId" : "20096",
        "name" : "短文改错",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300184,
        "pId" : "20096",
        "name" : "其他",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300185,
        "pId" : "300184",
        "name" : "单词拼写",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300186,
        "pId" : "300184",
        "name" : "补充句子",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300187,
        "pId" : "300184",
        "name" : "选词填空",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300188,
        "pId" : "300184",
        "name" : "句型转换",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300189,
        "pId" : "300184",
        "name" : "补全对话",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300190,
        "pId" : "300184",
        "name" : "情景交际",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300191,
        "pId" : "300184",
        "name" : "七选五题型",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300192,
        "pId" : "300184",
        "name" : "短文填空",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300193,
        "pId" : "300184",
        "name" : "口语应用",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300194,
        "pId" : "300184",
        "name" : "阅读表达",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 300195,
        "pId" : "300184",
        "name" : "语法填空",
        "subject" : "10012",
        "grade" : "20202"
    },
    {
        "id" : 2001084,
        "pId" : "0",
        "name" : "生物(高中部)",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001085,
        "pId" : "2001084",
        "name" : "细胞分子组成",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001086,
        "pId" : "2001085",
        "name" : "蛋白质的结构与功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001087,
        "pId" : "2001086",
        "name" : "氨基酸的结构与脱水缩合",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001088,
        "pId" : "2001086",
        "name" : "蛋白质的结构与功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001089,
        "pId" : "2001085",
        "name" : "核酸的结构与功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001090,
        "pId" : "2001085",
        "name" : "糖类的种类与作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001091,
        "pId" : "2001085",
        "name" : "脂质的种类与作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001092,
        "pId" : "2001085",
        "name" : "水和无机盐的作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001093,
        "pId" : "2001085",
        "name" : "生物大分子以碳链为骨架",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001094,
        "pId" : "2001084",
        "name" : "细胞的结构",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001095,
        "pId" : "2001094",
        "name" : "细胞学说建立的过程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001096,
        "pId" : "2001094",
        "name" : "多种多样的细胞",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001097,
        "pId" : "2001094",
        "name" : "细胞膜系统的结构和功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001098,
        "pId" : "2001084",
        "name" : "细胞膜的结构和功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001099,
        "pId" : "2001098",
        "name" : "生物膜系统的结构功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001100,
        "pId" : "2001094",
        "name" : "几种细胞器的结构和功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001101,
        "pId" : "2001100",
        "name" : "叶绿体、线粒体的结构和功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001102,
        "pId" : "2001100",
        "name" : "其他几种细胞器的形态和功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001103,
        "pId" : "2001094",
        "name" : "细胞核的结构与功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001104,
        "pId" : "2001103",
        "name" : "细胞核的结构与功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001105,
        "pId" : "2001104",
        "name" : "原核细胞与真核细胞的区别与联系",
        "subject" : "10013",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001106,
        "pId" : "2001084",
        "name" : "细胞的代谢",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001107,
        "pId" : "2001106",
        "name" : "物质进出细胞的方式",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001108,
        "pId" : "2001107",
        "name" : "物质跨膜运输方式的类型及特点",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001109,
        "pId" : "2001107",
        "name" : "大分子物质进出细胞的方式",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001110,
        "pId" : "2001106",
        "name" : "酶在代谢中的作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001111,
        "pId" : "2001110",
        "name" : "酶的本质、特性和作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001112,
        "pId" : "2001110",
        "name" : "影响酶活性的因素",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001113,
        "pId" : "2001106",
        "name" : "ATP在能量代谢中的作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001114,
        "pId" : "2001106",
        "name" : "光合作用以及对它的认识",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001115,
        "pId" : "2001114",
        "name" : "光合作用的过程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001116,
        "pId" : "2001114",
        "name" : "环境因素对光合作用速率的影响",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001117,
        "pId" : "2001106",
        "name" : "细胞呼吸",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001118,
        "pId" : "2001117",
        "name" : "有氧呼吸和无氧呼吸过程及异同",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001119,
        "pId" : "2001117",
        "name" : "细胞呼吸的影响因素及应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001120,
        "pId" : "2001084",
        "name" : "细胞的增殖",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001121,
        "pId" : "2001120",
        "name" : "细胞的生长和增殖的周期性",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001122,
        "pId" : "2001120",
        "name" : "细胞的无丝分裂及其特点",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001123,
        "pId" : "2001120",
        "name" : "动、植物细胞有丝分裂过程及异同",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001124,
        "pId" : "2001120",
        "name" : "有丝分裂的特征和意义",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001125,
        "pId" : "2001084",
        "name" : "细胞的分化、衰老和凋亡",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001126,
        "pId" : "2001125",
        "name" : "细胞的分化",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001127,
        "pId" : "2001126",
        "name" : "细胞分化",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001128,
        "pId" : "2001126",
        "name" : "细胞全能性的概念和实例",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001129,
        "pId" : "2001125",
        "name" : "细胞衰老的特征",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001130,
        "pId" : "2001125",
        "name" : "细胞凋亡的含义",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001131,
        "pId" : "2001125",
        "name" : "癌细胞的主要特征和恶性肿瘤的防治",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001132,
        "pId" : "2001084",
        "name" : "遗传的细胞基础",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001133,
        "pId" : "2001132",
        "name" : "减数分裂",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001134,
        "pId" : "2001132",
        "name" : "精子与卵细胞的形成过程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001135,
        "pId" : "2001132",
        "name" : "动物的受精及其意义",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001136,
        "pId" : "2001084",
        "name" : "遗传的分子基础",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001137,
        "pId" : "2001136",
        "name" : "人类对遗传物质的探索过程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001138,
        "pId" : "2001137",
        "name" : "肺炎双球菌的转化实验",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001139,
        "pId" : "2001137",
        "name" : "噬菌体侵染细菌的实验",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001140,
        "pId" : "2001136",
        "name" : "DNA分子结构、特点和特性",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001141,
        "pId" : "2001136",
        "name" : "DNA、基因和遗传信息",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001142,
        "pId" : "2001136",
        "name" : "DNA分子复制",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001143,
        "pId" : "2001136",
        "name" : "遗传信息的转录和翻译",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001144,
        "pId" : "2001084",
        "name" : "遗传的基本规律",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001145,
        "pId" : "2001144",
        "name" : "孟德尔遗传实验的科学方法",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001146,
        "pId" : "2001144",
        "name" : "遗传的分离定律",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001147,
        "pId" : "2001144",
        "name" : "遗传的自由组合规律",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001148,
        "pId" : "2001084",
        "name" : "基因与性状的关系",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001149,
        "pId" : "2001148",
        "name" : "基因对性状的控制",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001150,
        "pId" : "2001148",
        "name" : "基因与染色体的关系",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001151,
        "pId" : "2001148",
        "name" : "伴性遗传及其特点",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001152,
        "pId" : "2001084",
        "name" : "生物的异变",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001153,
        "pId" : "2001152",
        "name" : "基因突变",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001154,
        "pId" : "2001152",
        "name" : "基因重组的概念及实例、意义",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001155,
        "pId" : "2001152",
        "name" : "染色体结构变异和数目变异",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001156,
        "pId" : "2001152",
        "name" : "多倍体育种的原理、方法及特点",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001157,
        "pId" : "2001152",
        "name" : "诱变育种在生产中的应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001158,
        "pId" : "2001152",
        "name" : "单倍体育种的原理、方法及特点",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001159,
        "pId" : "2001152",
        "name" : "杂交育种",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001160,
        "pId" : "2001084",
        "name" : "人类遗传病",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001161,
        "pId" : "2001160",
        "name" : "人类遗传病",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001162,
        "pId" : "2001161",
        "name" : "遗传病和优生",
        "subject" : "10013",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 2001163,
        "pId" : "2001161",
        "name" : "人类基因组计划及其意义",
        "subject" : "10013",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 2001164,
        "pId" : "2001084",
        "name" : "生物的进化",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001165,
        "pId" : "2001164",
        "name" : "现代生物进化理论的主要内容",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001166,
        "pId" : "2001164",
        "name" : "生物进化的历程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001167,
        "pId" : "2001164",
        "name" : "生物多样性形成的关系",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001168,
        "pId" : "2001084",
        "name" : "植物激素的调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001169,
        "pId" : "2001168",
        "name" : "植物生长素的发现和作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001170,
        "pId" : "2001169",
        "name" : "生长素的发现",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001171,
        "pId" : "2001169",
        "name" : "生长素的生理作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001172,
        "pId" : "2001168",
        "name" : "生长素类似物在农业生产实践中的应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001173,
        "pId" : "2001168",
        "name" : "其他植物激素",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001174,
        "pId" : "2001084",
        "name" : "动物生命活动调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001175,
        "pId" : "2001174",
        "name" : "通过神经调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001176,
        "pId" : "2001175",
        "name" : "反射与反射弧",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001177,
        "pId" : "2001175",
        "name" : "兴奋传导过程和特点",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001178,
        "pId" : "2001175",
        "name" : "兴奋在神经间传递",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001179,
        "pId" : "2001175",
        "name" : "神经系统的分级调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001180,
        "pId" : "2001175",
        "name" : "人脑结构与功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001181,
        "pId" : "2001174",
        "name" : "通过激素调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001182,
        "pId" : "2001084",
        "name" : "人体的内环境与稳态",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001183,
        "pId" : "2001182",
        "name" : "内环境概念及组成",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001184,
        "pId" : "2001182",
        "name" : "稳态的调节机制",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001185,
        "pId" : "2001182",
        "name" : "内环境稳态与健康的关系",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001186,
        "pId" : "2001182",
        "name" : "体温调节、水盐调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001187,
        "pId" : "2001182",
        "name" : "血糖调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001188,
        "pId" : "2001182",
        "name" : "神经调节与体液调节的区别于联系",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001189,
        "pId" : "2001084",
        "name" : "人体免疫系统在维持稳态中的作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001190,
        "pId" : "2001189",
        "name" : "免疫系统组成及主要功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001191,
        "pId" : "2001189",
        "name" : "体液免疫和细胞免疫",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001192,
        "pId" : "2001189",
        "name" : "免疫异常实例及分析",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001193,
        "pId" : "2001189",
        "name" : "艾滋病",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001194,
        "pId" : "2001084",
        "name" : "种群和群落",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001195,
        "pId" : "2001194",
        "name" : "种群的特征",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001196,
        "pId" : "2001195",
        "name" : "种群的概念和基本特征",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001197,
        "pId" : "2001195",
        "name" : "种群密度的调查方法",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001198,
        "pId" : "2001194",
        "name" : "种群的数量变化",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001199,
        "pId" : "2001194",
        "name" : "群落的结构特征",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001200,
        "pId" : "2001194",
        "name" : "群落演替",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001201,
        "pId" : "2001084",
        "name" : "生态系统",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001202,
        "pId" : "2001201",
        "name" : "生态系统的结构",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001203,
        "pId" : "2001201",
        "name" : "生态系统功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001204,
        "pId" : "2001203",
        "name" : "生态系统的能量流动",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001205,
        "pId" : "2001203",
        "name" : "生态系统的物质循环",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001206,
        "pId" : "2001203",
        "name" : "生态系统中的信息传递",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001207,
        "pId" : "2001201",
        "name" : "生态系统的稳定性",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001208,
        "pId" : "2001084",
        "name" : "生态环境的保护",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001209,
        "pId" : "2001084",
        "name" : "微生物的利用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001210,
        "pId" : "2001084",
        "name" : "生物技术在食品加工及其他方面的应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001211,
        "pId" : "2001210",
        "name" : "从生物材料中提取某些特定的成分",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001212,
        "pId" : "2001210",
        "name" : "运用发酵加工食品的基本方法",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001213,
        "pId" : "2001210",
        "name" : "测定食品加工中可能产生的有害物质",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001214,
        "pId" : "2001210",
        "name" : "植物的组织培养",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001215,
        "pId" : "2001210",
        "name" : "蛋白质的提取和分离",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001216,
        "pId" : "2001210",
        "name" : "PCR技术的基本操作和应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001217,
        "pId" : "2001084",
        "name" : "基因工程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001218,
        "pId" : "2001217",
        "name" : "基因工程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001219,
        "pId" : "2001218",
        "name" : "蛋白质工程",
        "subject" : "10013",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 2001220,
        "pId" : "2001084",
        "name" : "克隆技术",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001221,
        "pId" : "2001220",
        "name" : "植物细胞工程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001222,
        "pId" : "2001220",
        "name" : "动物的细胞培养与体细胞克隆",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001223,
        "pId" : "2001220",
        "name" : "细胞融合与单克隆抗体",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001224,
        "pId" : "2001084",
        "name" : "胚胎工程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001225,
        "pId" : "2001224",
        "name" : "动物胚胎的发育",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001226,
        "pId" : "2001224",
        "name" : "胚胎干细胞的移植及其应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001227,
        "pId" : "2001084",
        "name" : "生物技术的安全性和伦理问题",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001228,
        "pId" : "2001227",
        "name" : "转基因生物的安全性",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001229,
        "pId" : "2001227",
        "name" : "生物武器对人类的威胁",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001230,
        "pId" : "2001227",
        "name" : "生物技术中的伦理问题",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001231,
        "pId" : "2001084",
        "name" : "生态工程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001232,
        "pId" : "2001084",
        "name" : "实验",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001233,
        "pId" : "2001232",
        "name" : "使用显微镜观察多种多样的细胞",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001234,
        "pId" : "2001232",
        "name" : "检测生物组织中还原糖、脂肪和蛋白质",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001235,
        "pId" : "2001232",
        "name" : "观察DNA、RNA在细胞中的分布",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001236,
        "pId" : "2001232",
        "name" : "用高倍显微镜观察线粒体和叶绿体",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001237,
        "pId" : "2001232",
        "name" : "观察植物细胞的质壁分离和复原",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001238,
        "pId" : "2001232",
        "name" : "比较过氧化氢在不同条件的分解",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001239,
        "pId" : "2001232",
        "name" : "探究影响酶活性的因素",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001240,
        "pId" : "2001232",
        "name" : "叶绿体色素的提取和分离",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001241,
        "pId" : "2001232",
        "name" : "探究环境因素对光合作用强度的影响",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001242,
        "pId" : "2001232",
        "name" : "探究酵母菌的呼吸方式",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001243,
        "pId" : "2001232",
        "name" : "观察细胞的有丝分裂",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001244,
        "pId" : "2001232",
        "name" : "模拟探究细胞表面积与体积的关系",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001245,
        "pId" : "2001232",
        "name" : "观察细胞的减数分裂",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001246,
        "pId" : "2001232",
        "name" : "低温诱导染色体加倍的实验",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001247,
        "pId" : "2001232",
        "name" : "调查常见的人类遗传病",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001248,
        "pId" : "2001232",
        "name" : "探究植物生长调节剂对扦插枝条生根的作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001249,
        "pId" : "2001232",
        "name" : "探究培养液中酵母菌数量的动态变化",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001250,
        "pId" : "2001232",
        "name" : "土壤中动物类群丰富的的研究",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001251,
        "pId" : "2001232",
        "name" : "微生物的实验室培养",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001252,
        "pId" : "2001232",
        "name" : "土壤中分解尿素的细菌的分类与计数",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001253,
        "pId" : "2001232",
        "name" : "果胶酶在果汁生产中的作用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001254,
        "pId" : "2001232",
        "name" : "果酒及果醋的制作",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001255,
        "pId" : "2001232",
        "name" : "胡萝卜素的提取",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001256,
        "pId" : "2001232",
        "name" : "菊花的组织培养",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001257,
        "pId" : "2001232",
        "name" : "血红蛋白的提取和分离",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001258,
        "pId" : "2001232",
        "name" : "DNA的粗提取与鉴定",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001259,
        "pId" : "2001084",
        "name" : "走进细胞",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001260,
        "pId" : "2001259",
        "name" : "生命活动离不开细胞",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001261,
        "pId" : "2001259",
        "name" : "生命系统的结构层次",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001262,
        "pId" : "2001084",
        "name" : "生物科学与健康",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001263,
        "pId" : "2001262",
        "name" : "抗生素的合理使用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001264,
        "pId" : "2001262",
        "name" : "基因诊断与基因治疗",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001265,
        "pId" : "2001262",
        "name" : "人体的器官移植",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001266,
        "pId" : "2001262",
        "name" : "生殖健康",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001267,
        "pId" : "2001084",
        "name" : "生物科学与农业",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001268,
        "pId" : "2001267",
        "name" : "农业生产中繁殖控制技术",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001269,
        "pId" : "2001267",
        "name" : "现代生物技术在育种上的应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001270,
        "pId" : "2001267",
        "name" : "植物病虫害的防治原理和预防",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001271,
        "pId" : "2001267",
        "name" : "动物疫病的控制",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001272,
        "pId" : "2001267",
        "name" : "绿色食品的生产",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001273,
        "pId" : "2001267",
        "name" : "设施农业",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001274,
        "pId" : "2001084",
        "name" : "生物科学与工业",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001275,
        "pId" : "2001274",
        "name" : "微生物发酵及其应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001276,
        "pId" : "2001274",
        "name" : "酶在工业生产中的应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001277,
        "pId" : "2001274",
        "name" : "生物技术药物与疫苗",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001278,
        "pId" : "2001084",
        "name" : "生物科学与环境保护",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001279,
        "pId" : "2001278",
        "name" : "生物性污染及其预防",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001280,
        "pId" : "2001278",
        "name" : "生物净化的原理及其应用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001281,
        "pId" : "2001278",
        "name" : "关注生物资源的合理利用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001282,
        "pId" : "2001278",
        "name" : "倡导绿色消费",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 2001283,
        "pId" : "0",
        "name" : "物理(高中部)",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001284,
        "pId" : "2001283",
        "name" : "相互作用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001285,
        "pId" : "2001284",
        "name" : "力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001286,
        "pId" : "2001284",
        "name" : "重力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001287,
        "pId" : "2001284",
        "name" : "弹力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001288,
        "pId" : "2001287",
        "name" : "弹力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001289,
        "pId" : "2001288",
        "name" : "胡克定律",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001290,
        "pId" : "2001284",
        "name" : "摩擦力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001291,
        "pId" : "2001290",
        "name" : "滑动摩擦力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001292,
        "pId" : "2001290",
        "name" : "静摩擦",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001293,
        "pId" : "2001284",
        "name" : "力的合成与分解",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001294,
        "pId" : "2001293",
        "name" : "力的合成",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001295,
        "pId" : "2001293",
        "name" : "力的分解",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001296,
        "pId" : "2001284",
        "name" : "共点力的平衡",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001297,
        "pId" : "2001283",
        "name" : "热学",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001298,
        "pId" : "2001297",
        "name" : "分子动理论",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001299,
        "pId" : "2001298",
        "name" : "分子运动论",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001300,
        "pId" : "2001298",
        "name" : "物体的内能",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001301,
        "pId" : "2001297",
        "name" : "气体",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001302,
        "pId" : "2001301",
        "name" : "气体实验定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001303,
        "pId" : "2001301",
        "name" : "理想气体的状态方程",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001304,
        "pId" : "2001297",
        "name" : "热力学定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001305,
        "pId" : "2001304",
        "name" : "热力学第一定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001306,
        "pId" : "2001304",
        "name" : "热力学第二定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001307,
        "pId" : "2001297",
        "name" : "物态及物态变化",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001308,
        "pId" : "2001307",
        "name" : "固体和液体",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001309,
        "pId" : "2001307",
        "name" : "饱和汽及物态变化中的能量",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001310,
        "pId" : "2001283",
        "name" : "电磁学",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001311,
        "pId" : "2001310",
        "name" : "电场",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001312,
        "pId" : "2001311",
        "name" : "电荷守恒定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001313,
        "pId" : "2001311",
        "name" : "库伦定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001314,
        "pId" : "2001311",
        "name" : "电场强度",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001315,
        "pId" : "2001311",
        "name" : "电势差、电势、电势能",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001316,
        "pId" : "2001311",
        "name" : "静电场中的导体",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001317,
        "pId" : "2001311",
        "name" : "电容器",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001318,
        "pId" : "2001311",
        "name" : "带点粒子在电场中的运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001319,
        "pId" : "2001310",
        "name" : "恒定电流",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001320,
        "pId" : "2001319",
        "name" : "电路的基本概念",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001321,
        "pId" : "2001319",
        "name" : "欧姆定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001322,
        "pId" : "2001319",
        "name" : "焦耳定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001323,
        "pId" : "2001319",
        "name" : "电功率和电功",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001324,
        "pId" : "2001319",
        "name" : "闭合电路的欧姆定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001325,
        "pId" : "2001310",
        "name" : "磁场",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001326,
        "pId" : "2001325",
        "name" : "磁现象和磁场",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001327,
        "pId" : "2001325",
        "name" : "磁感应强度",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001328,
        "pId" : "2001325",
        "name" : "安培力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001329,
        "pId" : "2001325",
        "name" : "洛伦兹力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001330,
        "pId" : "2001325",
        "name" : "电荷在匀强磁场中运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001331,
        "pId" : "2001310",
        "name" : "电磁感应",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001332,
        "pId" : "2001331",
        "name" : "电磁感应现象",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001333,
        "pId" : "2001331",
        "name" : "楞次定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001334,
        "pId" : "2001331",
        "name" : "法拉第电磁感应定律及应用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001335,
        "pId" : "2001331",
        "name" : "互感与自感",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001336,
        "pId" : "2001310",
        "name" : "交流电",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001337,
        "pId" : "2001336",
        "name" : "交流电的产生及描述",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001338,
        "pId" : "2001336",
        "name" : "电感和电容对交流电的影响",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001339,
        "pId" : "2001336",
        "name" : "变压器",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001340,
        "pId" : "2001336",
        "name" : "远距离输电",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001341,
        "pId" : "2001310",
        "name" : "传感器",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001342,
        "pId" : "2001341",
        "name" : "传感器",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001343,
        "pId" : "2001342",
        "name" : "传感器的四种重要元件",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001344,
        "pId" : "2001342",
        "name" : "传感器应用的一般模式",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001345,
        "pId" : "2001342",
        "name" : "传感器应用的实例",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001346,
        "pId" : "2001310",
        "name" : "电磁波",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001347,
        "pId" : "2001346",
        "name" : "麦克斯韦电磁场理论",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001348,
        "pId" : "2001346",
        "name" : "电磁波",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001349,
        "pId" : "2001348",
        "name" : "电磁振荡",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001350,
        "pId" : "2001283",
        "name" : "光学",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001351,
        "pId" : "2001350",
        "name" : "几何光学",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001352,
        "pId" : "2001351",
        "name" : "光的反射",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001353,
        "pId" : "2001351",
        "name" : "光的折射",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001354,
        "pId" : "2001351",
        "name" : "光的全反射",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001355,
        "pId" : "2001350",
        "name" : "物理光学",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001356,
        "pId" : "2001355",
        "name" : "光的干涉",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001357,
        "pId" : "2001355",
        "name" : "光的衍射",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001358,
        "pId" : "2001355",
        "name" : "光的偏振",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001359,
        "pId" : "2001355",
        "name" : "光的颜色与色散",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001360,
        "pId" : "2001355",
        "name" : "激光",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001361,
        "pId" : "2001283",
        "name" : "原子、亚原子物理",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001362,
        "pId" : "2001361",
        "name" : "原子结构",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001363,
        "pId" : "2001362",
        "name" : "电子的发现",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001364,
        "pId" : "2001362",
        "name" : "原子的核式结构",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001365,
        "pId" : "2001362",
        "name" : "氢原子光谱",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001366,
        "pId" : "2001362",
        "name" : "玻尔原子理论",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001367,
        "pId" : "2001361",
        "name" : "原子核",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001368,
        "pId" : "2001367",
        "name" : "天然放射现象",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001369,
        "pId" : "2001367",
        "name" : "放射性元素的衰变",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001370,
        "pId" : "2001367",
        "name" : "探测射线的方法",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001371,
        "pId" : "2001367",
        "name" : "核反应",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001372,
        "pId" : "2001367",
        "name" : "人工放射性同位素",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001373,
        "pId" : "2001367",
        "name" : "核力与结合能",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001374,
        "pId" : "2001367",
        "name" : "核裂变",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001375,
        "pId" : "2001367",
        "name" : "核聚变",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001376,
        "pId" : "2001367",
        "name" : "粒子与宇宙",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001377,
        "pId" : "2001283",
        "name" : "实验与探究",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001378,
        "pId" : "2001377",
        "name" : "实验基础与基本仪器使用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001379,
        "pId" : "2001378",
        "name" : "误差与有效数字",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001380,
        "pId" : "2001378",
        "name" : "实验的主要思想方法",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001381,
        "pId" : "2001378",
        "name" : "实验数据的处理",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001382,
        "pId" : "2001378",
        "name" : "基本仪器的使用方法",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001383,
        "pId" : "2001377",
        "name" : "力学实验",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001384,
        "pId" : "2001383",
        "name" : "研究匀变速直线运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001385,
        "pId" : "2001383",
        "name" : "研究弹力和弹簧伸长量的关系",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001386,
        "pId" : "2001383",
        "name" : "验证力的平行四边形定则",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001387,
        "pId" : "2001383",
        "name" : "验证牛顿第二定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001388,
        "pId" : "2001383",
        "name" : "研究平抛运动的规律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001389,
        "pId" : "2001383",
        "name" : "探究动能定理",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001390,
        "pId" : "2001383",
        "name" : "验证机械能守恒定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001391,
        "pId" : "2001383",
        "name" : "研究单摆运动(用单摆测定重力加速度)",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001392,
        "pId" : "2001383",
        "name" : "验证动量守恒定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001393,
        "pId" : "2001377",
        "name" : "电学实验",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001394,
        "pId" : "2001393",
        "name" : "测定金属的电阻率",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001395,
        "pId" : "2001393",
        "name" : "描绘小灯泡的伏安特性曲线",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001396,
        "pId" : "2001393",
        "name" : "测定电池的电动势和内阻",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001397,
        "pId" : "2001393",
        "name" : "练习使用多用电表",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001398,
        "pId" : "2001393",
        "name" : "传感器的简单应用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001399,
        "pId" : "2001377",
        "name" : "热学和光学实验",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001400,
        "pId" : "2001399",
        "name" : "用油膜法估测分子的大小",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001401,
        "pId" : "2001399",
        "name" : "测定玻璃的折射率",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001402,
        "pId" : "2001399",
        "name" : "用双缝干涉测定光的波长",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001403,
        "pId" : "2001377",
        "name" : "设计性实验",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001404,
        "pId" : "2001283",
        "name" : "直线运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001405,
        "pId" : "2001404",
        "name" : "运动的基本概念",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001406,
        "pId" : "2001405",
        "name" : "质点",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001407,
        "pId" : "2001405",
        "name" : "参考系与坐标系",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001408,
        "pId" : "2001405",
        "name" : "矢量和标量",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001409,
        "pId" : "2001405",
        "name" : "位移与路程",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001410,
        "pId" : "2001405",
        "name" : "时间与时刻",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001411,
        "pId" : "2001405",
        "name" : "速度速率",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001412,
        "pId" : "2001405",
        "name" : "加速度",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001413,
        "pId" : "2001404",
        "name" : "匀变速直线运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001414,
        "pId" : "2001413",
        "name" : "匀变速直线运动的基本规律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001415,
        "pId" : "2001413",
        "name" : "匀变速直线运动运动规律的几个推论",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001416,
        "pId" : "2001413",
        "name" : "运动的图像",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001417,
        "pId" : "2001413",
        "name" : "自由落体运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001418,
        "pId" : "2001413",
        "name" : "竖直上抛运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001419,
        "pId" : "2001413",
        "name" : "追击相遇类问题",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001420,
        "pId" : "2001283",
        "name" : "牛顿运动定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001421,
        "pId" : "2001420",
        "name" : "牛顿第一定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001422,
        "pId" : "2001420",
        "name" : "牛顿第二定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001423,
        "pId" : "2001422",
        "name" : "牛顿第二定律及应用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001424,
        "pId" : "2001422",
        "name" : "超重失重",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001425,
        "pId" : "2001420",
        "name" : "牛顿第三定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001426,
        "pId" : "2001283",
        "name" : "曲线运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001427,
        "pId" : "2001426",
        "name" : "运动的合成与分解",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001428,
        "pId" : "2001426",
        "name" : "抛体运动的规律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001429,
        "pId" : "2001428",
        "name" : "平抛运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001430,
        "pId" : "2001428",
        "name" : "斜抛运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001431,
        "pId" : "2001426",
        "name" : "圆周运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001432,
        "pId" : "2001431",
        "name" : "圆周运动的相关基本概念",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001433,
        "pId" : "2001431",
        "name" : "向心力和向心加速度",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001434,
        "pId" : "2001431",
        "name" : "匀速圆周运动与变速圆周运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001435,
        "pId" : "2001431",
        "name" : "圆周运动实例分析",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001436,
        "pId" : "2001431",
        "name" : "离心运动与近心运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001437,
        "pId" : "2001426",
        "name" : "万有引力",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001438,
        "pId" : "2001437",
        "name" : "开普勒行星运动定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001439,
        "pId" : "2001437",
        "name" : "万有引力定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001440,
        "pId" : "2001437",
        "name" : "宇宙速度",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001441,
        "pId" : "2001437",
        "name" : "人造卫星",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001442,
        "pId" : "2001437",
        "name" : "同步卫星与近地卫星",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001443,
        "pId" : "2001283",
        "name" : "机械能",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001444,
        "pId" : "2001443",
        "name" : "功和功率",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001445,
        "pId" : "2001444",
        "name" : "功的基本概念和计算",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001446,
        "pId" : "2001444",
        "name" : "功率",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001447,
        "pId" : "2001444",
        "name" : "平均功率与瞬时功率",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001448,
        "pId" : "2001444",
        "name" : "额定功率与实际功率",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001449,
        "pId" : "2001443",
        "name" : "动能定理",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001450,
        "pId" : "2001449",
        "name" : "动能",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001451,
        "pId" : "2001449",
        "name" : "动能定理及应用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001452,
        "pId" : "2001443",
        "name" : "机械能守恒定律与能量守和定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001453,
        "pId" : "2001452",
        "name" : "机械能守恒定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001454,
        "pId" : "2001452",
        "name" : "能量守恒定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001455,
        "pId" : "2001452",
        "name" : "功能关系",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001456,
        "pId" : "2001283",
        "name" : "机械振动与机械波",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001457,
        "pId" : "2001456",
        "name" : "机械振动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001458,
        "pId" : "2001457",
        "name" : "简谐运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001459,
        "pId" : "2001457",
        "name" : "简谐运动的描述",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001460,
        "pId" : "2001457",
        "name" : "简谐振动的图像",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001461,
        "pId" : "2001457",
        "name" : "弹簧振子",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001462,
        "pId" : "2001457",
        "name" : "单摆",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001463,
        "pId" : "2001457",
        "name" : "受迫振动和共振",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001464,
        "pId" : "2001456",
        "name" : "机械波",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001465,
        "pId" : "2001464",
        "name" : "机械波的形成和传播",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001466,
        "pId" : "2001464",
        "name" : "波的图像",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001467,
        "pId" : "2001464",
        "name" : "波的反射和折射",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001468,
        "pId" : "2001464",
        "name" : "波的干涉和衍射",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001469,
        "pId" : "2001464",
        "name" : "多普勒效应",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001470,
        "pId" : "2001283",
        "name" : "相对论简介",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001471,
        "pId" : "2001283",
        "name" : "动量",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001472,
        "pId" : "2001471",
        "name" : "动量和冲量定义",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 2001473,
        "pId" : "2001472",
        "name" : "动量",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 2001474,
        "pId" : "2001472",
        "name" : "冲量",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 2001475,
        "pId" : "2001473",
        "name" : "动量定理",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001476,
        "pId" : "2001473",
        "name" : "动量守恒定律",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001477,
        "pId" : "2001473",
        "name" : "碰撞",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001478,
        "pId" : "2001477",
        "name" : "弹性碰撞",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 6
    },
    {
        "id" : 2001479,
        "pId" : "2001477",
        "name" : "非弹性碰撞",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 6
    },
    {
        "id" : 2001480,
        "pId" : "2001477",
        "name" : "完全非弹性碰撞",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 6
    },
    {
        "id" : 2001481,
        "pId" : "2001473",
        "name" : "爆炸",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001482,
        "pId" : "2001473",
        "name" : "反冲运动",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 2001483,
        "pId" : "2001482",
        "name" : "反冲现象",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 6
    },
    {
        "id" : 2001484,
        "pId" : "2001482",
        "name" : "人船模型",
        "subject" : "10014",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 6
    },
    {
        "id" : 2001485,
        "pId" : "2001283",
        "name" : "波粒二象性",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001486,
        "pId" : "2001485",
        "name" : "黑体与黑体辐射",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001487,
        "pId" : "2001485",
        "name" : "能量量子化",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001488,
        "pId" : "2001485",
        "name" : "光电效应",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001489,
        "pId" : "2001485",
        "name" : "光子说",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001490,
        "pId" : "2001485",
        "name" : "康普顿效应",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001491,
        "pId" : "2001485",
        "name" : "光的波粒二象性",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001492,
        "pId" : "2001485",
        "name" : "物质波(德布罗意波)",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001493,
        "pId" : "2001485",
        "name" : "概率波",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001494,
        "pId" : "2001485",
        "name" : "不确定性关系",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 2001495,
        "pId" : "0",
        "name" : "化学(高中部)",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001496,
        "pId" : "2001495",
        "name" : "化学实验基础",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001497,
        "pId" : "2001496",
        "name" : "化学实验基础知识",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001498,
        "pId" : "2001496",
        "name" : "识别电学的实验仪器装置",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001499,
        "pId" : "2001496",
        "name" : "物质的分离、提纯和检验",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001500,
        "pId" : "2001496",
        "name" : "物质的制备、收集和净化",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001501,
        "pId" : "2001496",
        "name" : "化学实验的设计与评价，实验研究",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001502,
        "pId" : "2001496",
        "name" : "配制溶液",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001503,
        "pId" : "2001496",
        "name" : "常见气体的实验室制法",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001504,
        "pId" : "2001496",
        "name" : "化学实验中物质的判别",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001505,
        "pId" : "2001495",
        "name" : "化学计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001506,
        "pId" : "2001505",
        "name" : "有关溶解度和溶液浓度的计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001507,
        "pId" : "2001505",
        "name" : "氧化还原反应及电化学的计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001508,
        "pId" : "2001505",
        "name" : "热化学反应的计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001509,
        "pId" : "2001505",
        "name" : "有关离子方程式的计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001510,
        "pId" : "2001505",
        "name" : "有关物质的量的计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001511,
        "pId" : "2001505",
        "name" : "有关化学反应速率，化学平衡的计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001512,
        "pId" : "2001505",
        "name" : "综合计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001513,
        "pId" : "2001495",
        "name" : "化学的基本概念",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001514,
        "pId" : "2001513",
        "name" : "物质结构和元素周期律",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001515,
        "pId" : "2001514",
        "name" : "原子结构",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001516,
        "pId" : "2001514",
        "name" : "元素周期律和元素周期表",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001517,
        "pId" : "2001514",
        "name" : "元素、核素、同位素的含义",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001518,
        "pId" : "2001514",
        "name" : "化学键",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001519,
        "pId" : "2001513",
        "name" : "化学科学特点和化学研究基本方法",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001520,
        "pId" : "2001513",
        "name" : "物质的组成、性质和分类",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001521,
        "pId" : "2001520",
        "name" : "物质的组成和分类",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001522,
        "pId" : "2001520",
        "name" : "分散系",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001523,
        "pId" : "2001513",
        "name" : "化学用语及常用计量",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001524,
        "pId" : "2001523",
        "name" : "化学用语",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001525,
        "pId" : "2001523",
        "name" : "物质的量 气体摩尔质量",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001526,
        "pId" : "2001523",
        "name" : "质量守恒定律",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001527,
        "pId" : "2001523",
        "name" : "阿伏伽德罗定律",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001528,
        "pId" : "2001513",
        "name" : "离子反应",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001529,
        "pId" : "2001528",
        "name" : "电解质",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001530,
        "pId" : "2001528",
        "name" : "离子共存",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001531,
        "pId" : "2001528",
        "name" : "离子方程式的书写及正误判断",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001532,
        "pId" : "2001528",
        "name" : "离子的检验",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001533,
        "pId" : "2001513",
        "name" : "氧化还原反应",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001534,
        "pId" : "2001495",
        "name" : "物质的结构与性质",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001535,
        "pId" : "2001534",
        "name" : "原子结构与性质",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001536,
        "pId" : "2001534",
        "name" : "分子结构与性质",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001537,
        "pId" : "2001536",
        "name" : "共价键",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001538,
        "pId" : "2001536",
        "name" : "分子的立体结构",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001539,
        "pId" : "2001534",
        "name" : "晶体结构与性质",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001540,
        "pId" : "2001534",
        "name" : "物质结构与晶体类型",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001541,
        "pId" : "2001495",
        "name" : "重要的无机物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001542,
        "pId" : "2001541",
        "name" : "金属及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001543,
        "pId" : "2001542",
        "name" : "钠及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001544,
        "pId" : "2001542",
        "name" : "镁、铝及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001545,
        "pId" : "2001542",
        "name" : "铁、铜及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001546,
        "pId" : "2001541",
        "name" : "非金属及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001547,
        "pId" : "2001546",
        "name" : "氯及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001548,
        "pId" : "2001546",
        "name" : "硫及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001549,
        "pId" : "2001546",
        "name" : "氮、磷及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001550,
        "pId" : "2001546",
        "name" : "碳、硅及其化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001551,
        "pId" : "2001541",
        "name" : "无机推断",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001552,
        "pId" : "2001495",
        "name" : "常见有机物及其应用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001553,
        "pId" : "2001552",
        "name" : "碳的成键原理",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001554,
        "pId" : "2001552",
        "name" : "甲烷、乙烯、苯的主要特性",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001555,
        "pId" : "2001552",
        "name" : "乙烯、氯乙烯、苯的衍生物性质及工业应用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001556,
        "pId" : "2001552",
        "name" : "乙醇、乙酸的性质",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001557,
        "pId" : "2001552",
        "name" : "来自石油和煤的两种基本化工原料",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001558,
        "pId" : "2001552",
        "name" : "基本营养物质",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001559,
        "pId" : "2001495",
        "name" : "化学反应原理",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001560,
        "pId" : "2001559",
        "name" : "化学反应与能量",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001561,
        "pId" : "2001560",
        "name" : "化学反应与能量变化",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001562,
        "pId" : "2001560",
        "name" : "燃烧热、能源",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001563,
        "pId" : "2001560",
        "name" : "热化学方程式以及盖斯定律",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001564,
        "pId" : "2001559",
        "name" : "化学反应速率和化学平衡",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001565,
        "pId" : "2001564",
        "name" : "化学反应速率",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001566,
        "pId" : "2001564",
        "name" : "影响化学反应速率的因素",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001567,
        "pId" : "2001564",
        "name" : "化学平衡",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001568,
        "pId" : "2001564",
        "name" : "化学反应进行的方向",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001569,
        "pId" : "2001559",
        "name" : "溶液中的离子平衡",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001570,
        "pId" : "2001569",
        "name" : "弱电解质的电离",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001571,
        "pId" : "2001569",
        "name" : "水的电离和溶液的酸碱性",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001572,
        "pId" : "2001569",
        "name" : "盐的水解",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001573,
        "pId" : "2001569",
        "name" : "难溶电解质的溶解平衡",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001574,
        "pId" : "2001559",
        "name" : "电化学",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001575,
        "pId" : "2001574",
        "name" : "原电池",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001576,
        "pId" : "2001574",
        "name" : "化学电源",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001577,
        "pId" : "2001574",
        "name" : "电解池",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001578,
        "pId" : "2001574",
        "name" : "金属的电化学腐蚀与防护",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001579,
        "pId" : "2001495",
        "name" : "化学与生活和技术",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001580,
        "pId" : "2001579",
        "name" : "化学与健康",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001581,
        "pId" : "2001579",
        "name" : "生活中的材料",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001582,
        "pId" : "2001579",
        "name" : "化学与环境保护",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001583,
        "pId" : "2001579",
        "name" : "化学与资源开发",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001584,
        "pId" : "2001579",
        "name" : "化学与材料的制造、应用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001585,
        "pId" : "2001579",
        "name" : "化学与工农业生产",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001586,
        "pId" : "2001495",
        "name" : "有机化学基础",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001587,
        "pId" : "2001586",
        "name" : "认识有机化合物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001588,
        "pId" : "2001587",
        "name" : "有机化合物的分类",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001589,
        "pId" : "2001587",
        "name" : "有机化合物的结构特点",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001590,
        "pId" : "2001587",
        "name" : "有机化合物的命名",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001591,
        "pId" : "2001587",
        "name" : "研究有机化合物的一般步骤和方法",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001592,
        "pId" : "2001586",
        "name" : "烃和卤代烃",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001593,
        "pId" : "2001592",
        "name" : "脂肪烃",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001594,
        "pId" : "2001592",
        "name" : "芳香烃",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001595,
        "pId" : "2001592",
        "name" : "卤代烃",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001596,
        "pId" : "2001586",
        "name" : "烃的衍生物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001597,
        "pId" : "2001596",
        "name" : "醇 酚",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001598,
        "pId" : "2001596",
        "name" : "醛",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001599,
        "pId" : "2001596",
        "name" : "羧酸 酯",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001600,
        "pId" : "2001586",
        "name" : "生命中的基础有机化学物质",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001601,
        "pId" : "2001600",
        "name" : "油脂",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001602,
        "pId" : "2001600",
        "name" : "糖类",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001603,
        "pId" : "2001600",
        "name" : "蛋白质和核酸",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001604,
        "pId" : "2001586",
        "name" : "进入合成有机高分子化合物的时代",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001605,
        "pId" : "2001604",
        "name" : "合成高分子化合物的基本方法",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001606,
        "pId" : "2001604",
        "name" : "应用广泛的高分子材料",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001607,
        "pId" : "2001604",
        "name" : "功能高分子材料",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001608,
        "pId" : "2001586",
        "name" : "有机合成与推断",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 2001609,
        "pId" : "0",
        "name" : "地理(高中部)",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001610,
        "pId" : "2001609",
        "name" : "自然地理",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001611,
        "pId" : "2001610",
        "name" : "地球与地图",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001612,
        "pId" : "2001611",
        "name" : "地球和地球仪",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001613,
        "pId" : "2001611",
        "name" : "地图基础知识",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001614,
        "pId" : "2001610",
        "name" : "宇宙中的地球",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001615,
        "pId" : "2001614",
        "name" : "地球的宇宙环境与地球的圈层结构",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001616,
        "pId" : "2001614",
        "name" : "地球自转及其地理意义",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001617,
        "pId" : "2001614",
        "name" : "地球公转及其地理意义",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001618,
        "pId" : "2001610",
        "name" : "地球上的大气",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001619,
        "pId" : "2001618",
        "name" : "大气的运动",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001620,
        "pId" : "2001618",
        "name" : "气压带和风带",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001621,
        "pId" : "2001618",
        "name" : "常见天气系统",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001622,
        "pId" : "2001618",
        "name" : "气候的形成与变化",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001623,
        "pId" : "2001610",
        "name" : "地球上的水",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001624,
        "pId" : "2001623",
        "name" : "水循环与水资源的合理利用",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001625,
        "pId" : "2001623",
        "name" : "海水运动",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001626,
        "pId" : "2001610",
        "name" : "地表形态的塑造",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001627,
        "pId" : "2001626",
        "name" : "地壳物质循环与营造地表形态的力量",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001628,
        "pId" : "2001626",
        "name" : "山地的形成",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001629,
        "pId" : "2001626",
        "name" : "河流地貌的发育",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001630,
        "pId" : "2001610",
        "name" : "自然环境的整体性与差异性",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001631,
        "pId" : "2001630",
        "name" : "自然地理环境的整体性",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001632,
        "pId" : "2001630",
        "name" : "自然地理环境的差异性",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001633,
        "pId" : "2001610",
        "name" : "自然环境对人类活动的影响",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001634,
        "pId" : "2001633",
        "name" : "地表形态对聚落及交通线路分布的影响",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001635,
        "pId" : "2001633",
        "name" : "全球气候变化对人类活动的影响",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001636,
        "pId" : "2001609",
        "name" : "人文地理",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001637,
        "pId" : "2001636",
        "name" : "人口的变化",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001638,
        "pId" : "2001609",
        "name" : "人口的数量变化与人口的合理容量",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 2
    },
    {
        "id" : 2001639,
        "pId" : "2001609",
        "name" : "人口的空间变化",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 2
    },
    {
        "id" : 2001640,
        "pId" : "2001636",
        "name" : "城市与城市化",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001641,
        "pId" : "2001640",
        "name" : "城市的空间结构与城市的服务功能",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001642,
        "pId" : "2001640",
        "name" : "城市化及其对环境的影响",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001643,
        "pId" : "2001640",
        "name" : "地域文化对城市的影响",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001644,
        "pId" : "2001636",
        "name" : "农业地域的形成与发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001645,
        "pId" : "2001644",
        "name" : "农业的区位选择",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001646,
        "pId" : "2001644",
        "name" : "农业地域的形成",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001647,
        "pId" : "2001636",
        "name" : "工业地域的形成与发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001648,
        "pId" : "2001647",
        "name" : "工业的区位选择",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001649,
        "pId" : "2001647",
        "name" : "工业地域的形成和工业区",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001650,
        "pId" : "2001636",
        "name" : "人类活动的地域联系",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001651,
        "pId" : "2001650",
        "name" : "交通运输方式和布局",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001652,
        "pId" : "2001650",
        "name" : "交通运输布局对区域发展的影响",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001653,
        "pId" : "2001636",
        "name" : "人类与地理环境的协调发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001654,
        "pId" : "2001653",
        "name" : "人地关系思想的演变",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001655,
        "pId" : "2001653",
        "name" : "可持续发展的基本内涵",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001656,
        "pId" : "2001609",
        "name" : "区域可持续发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001657,
        "pId" : "2001656",
        "name" : "区域地理环境与人类活动",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001658,
        "pId" : "2001657",
        "name" : "地理环境对区域发展的影响",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001659,
        "pId" : "2001657",
        "name" : "地理信息技术的应用",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001660,
        "pId" : "2001656",
        "name" : "区域生态环境建设",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001661,
        "pId" : "2001660",
        "name" : "荒漠化的防治——以我国西北地区为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001662,
        "pId" : "2001660",
        "name" : "森林的开发和保护——以亚马孙热带雨林为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001663,
        "pId" : "2001660",
        "name" : "区域水土流失及其治理——以黄土高原为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001664,
        "pId" : "2001660",
        "name" : "湿地资源的开发与保护--以洞庭湖区为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001665,
        "pId" : "2001656",
        "name" : "区域自然资源综合开发利用",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001666,
        "pId" : "2001665",
        "name" : "能源资源的开发——以我国山西省为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001667,
        "pId" : "2001665",
        "name" : "流域的综合开发——以美国田纳西河流域为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001668,
        "pId" : "2001656",
        "name" : "区域经济发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001669,
        "pId" : "2001668",
        "name" : "区域农业发展——以我国东北地区为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001670,
        "pId" : "2001668",
        "name" : "区域工业化与城市化——以我国珠江三角洲地区为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001671,
        "pId" : "2001656",
        "name" : "区际联系与区域协调发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001672,
        "pId" : "2001671",
        "name" : "资源的跨区域调配——以我国西气东输为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001673,
        "pId" : "2001671",
        "name" : "产业转移—以东亚为例",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001674,
        "pId" : "2001609",
        "name" : "选修地理",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001675,
        "pId" : "2001674",
        "name" : "宇宙和地球",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001676,
        "pId" : "2001674",
        "name" : "海洋地理",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001677,
        "pId" : "2001674",
        "name" : "旅游地理",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001678,
        "pId" : "2001674",
        "name" : "城乡规划",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001679,
        "pId" : "2001674",
        "name" : "自然灾害与防治",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001680,
        "pId" : "2001674",
        "name" : "环境保护",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001681,
        "pId" : "2001609",
        "name" : "中国地理",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 2001682,
        "pId" : "2001609",
        "name" : "世界地理",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 2
    },
    {
        "id" : 2001683,
        "pId" : "0",
        "name" : "政治(高中部)",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001684,
        "pId" : "2001683",
        "name" : "经济生活",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001685,
        "pId" : "2001684",
        "name" : "货币",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001686,
        "pId" : "2001684",
        "name" : "价格",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001687,
        "pId" : "2001684",
        "name" : "消费",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001688,
        "pId" : "2001684",
        "name" : "生产与经济制度",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001689,
        "pId" : "2001684",
        "name" : "企业与劳动者",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001690,
        "pId" : "2001684",
        "name" : "投资与融资",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001691,
        "pId" : "2001684",
        "name" : "个人收入的分配",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001692,
        "pId" : "2001684",
        "name" : "国家收入的分配",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001693,
        "pId" : "2001684",
        "name" : "征税与纳税",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001694,
        "pId" : "2001684",
        "name" : "社会主义市场经济",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001695,
        "pId" : "2001684",
        "name" : "科学发展观和小康社会的经济建设",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001696,
        "pId" : "2001684",
        "name" : "经济全球化与对外开放",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001697,
        "pId" : "2001683",
        "name" : "政治生活",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001698,
        "pId" : "2001697",
        "name" : "公民的政治生活",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001699,
        "pId" : "2001698",
        "name" : "我国的国家性质",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001700,
        "pId" : "2001698",
        "name" : "我国公民的权利和义务",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001701,
        "pId" : "2001698",
        "name" : "我国公民政治参与的途径和方式",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001702,
        "pId" : "2001697",
        "name" : "我国的政府",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001703,
        "pId" : "2001702",
        "name" : "我国政府的职能和责任",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001704,
        "pId" : "2001702",
        "name" : "政府权力的行使与监督",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001705,
        "pId" : "2001702",
        "name" : "政府的威信",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001706,
        "pId" : "2001697",
        "name" : "发展社会主义民主政治",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001707,
        "pId" : "2001706",
        "name" : "我国的人民代表大会制度",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001708,
        "pId" : "2001706",
        "name" : "我国的政党制度",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001709,
        "pId" : "2001706",
        "name" : "我国的民族区域自治制度及宗教政策",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001710,
        "pId" : "2001697",
        "name" : "当代国际社会",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001711,
        "pId" : "2001710",
        "name" : "国际社会的成员",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001712,
        "pId" : "2001710",
        "name" : "处理国际关系的决定性因素",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001713,
        "pId" : "2001710",
        "name" : "世界政治经济发展的基本趋势",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001714,
        "pId" : "2001710",
        "name" : "我国独立自主的和平外交政策",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001715,
        "pId" : "2001683",
        "name" : "文化生活",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001716,
        "pId" : "2001715",
        "name" : "文化与生活",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001717,
        "pId" : "2001716",
        "name" : "文化与社会",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001718,
        "pId" : "2001716",
        "name" : "文化对人的影响",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001719,
        "pId" : "2001715",
        "name" : "文化传承与创新",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001720,
        "pId" : "2001719",
        "name" : "文化的多样性与文化传播",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001721,
        "pId" : "2001719",
        "name" : "文化的继承与发展",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001722,
        "pId" : "2001719",
        "name" : "文化创新",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001723,
        "pId" : "2001715",
        "name" : "中华文化与民族精神",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001724,
        "pId" : "2001723",
        "name" : "灿烂的中华文化",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001725,
        "pId" : "2001723",
        "name" : "弘扬和培育民族精神",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001726,
        "pId" : "2001715",
        "name" : "发展中国特色社会主义文化",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001727,
        "pId" : "2001726",
        "name" : "走进文化生活",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001728,
        "pId" : "2001726",
        "name" : "建设社会主义文化强国",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001729,
        "pId" : "2001726",
        "name" : "社会主义精神文明建设",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001730,
        "pId" : "2001683",
        "name" : "生活与哲学",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001731,
        "pId" : "2001730",
        "name" : "生活智慧与时代精神",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001732,
        "pId" : "2001731",
        "name" : "哲学是什么",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001733,
        "pId" : "2001731",
        "name" : "哲学基本问题",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001734,
        "pId" : "2001731",
        "name" : "唯物主义与唯心主义及其形态",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001735,
        "pId" : "2001731",
        "name" : "马克思主义哲学",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001736,
        "pId" : "2001730",
        "name" : "探索世界与追求真理",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001737,
        "pId" : "2001736",
        "name" : "物质和运动",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001738,
        "pId" : "2001736",
        "name" : "物质和意识的辩证关系",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001739,
        "pId" : "2001736",
        "name" : "客观规律与意识的能动作用",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001740,
        "pId" : "2001736",
        "name" : "实践与认识、真理",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001741,
        "pId" : "2001730",
        "name" : "思想方法与创新意识",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001742,
        "pId" : "2001741",
        "name" : "唯物辩证法的联系观",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001743,
        "pId" : "2001741",
        "name" : "唯物辩证法的发展观",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001744,
        "pId" : "2001741",
        "name" : "唯物辩证法的矛盾观",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001745,
        "pId" : "2001741",
        "name" : "唯物辩证法与创新意识",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001746,
        "pId" : "2001730",
        "name" : "认识社会与价值选择",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001747,
        "pId" : "2001746",
        "name" : "社会发展规律社会历史主体",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001748,
        "pId" : "2001746",
        "name" : "价值与人生价值",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001749,
        "pId" : "2001683",
        "name" : "选修部分",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001750,
        "pId" : "2001749",
        "name" : "科学社会主义常识",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001751,
        "pId" : "2001750",
        "name" : "社会主义从空想到科学的发展",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001752,
        "pId" : "2001750",
        "name" : "社会主义从理想到现实的转变",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001753,
        "pId" : "2001750",
        "name" : "社会主义是中国人民的历史性选择",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001754,
        "pId" : "2001750",
        "name" : "谱写中国特色社会主义的新篇章",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001755,
        "pId" : "2001750",
        "name" : "高举中国特色社会主义旗帜前进",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001756,
        "pId" : "2001749",
        "name" : "经济学常识",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001757,
        "pId" : "2001756",
        "name" : "古典经济学巨匠的理论遗产",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001758,
        "pId" : "2001756",
        "name" : "马克思主义经济学的伟大贡献",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001759,
        "pId" : "2001756",
        "name" : "西方国家现代市场经济的兴起于主要模式",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001760,
        "pId" : "2001756",
        "name" : "社会主义经济理论的初期探讨",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001761,
        "pId" : "2001756",
        "name" : "中国社会主义市场经济的探索",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001762,
        "pId" : "2001749",
        "name" : "国家和国际组织",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001763,
        "pId" : "2001762",
        "name" : "各具特色的国家和国际组织",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001764,
        "pId" : "2001762",
        "name" : "君主立宪制和民主共和制：以英国和法国为例",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001765,
        "pId" : "2001762",
        "name" : "联邦制、两党制、三权分立：以美国为例",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001766,
        "pId" : "2001762",
        "name" : "民主集中制：我国人民代表大会制度的组织和活动原则",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001767,
        "pId" : "2001762",
        "name" : "日益重要的国际组织",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001768,
        "pId" : "2001749",
        "name" : "科学思维常识",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001769,
        "pId" : "2001768",
        "name" : "树立科学思维的观念",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001770,
        "pId" : "2001768",
        "name" : "遵循形式逻辑的要求",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001771,
        "pId" : "2001768",
        "name" : "运用辩证思维的方法",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001772,
        "pId" : "2001768",
        "name" : "结合实践　善于创新",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001773,
        "pId" : "2001749",
        "name" : "生活中的法律常识",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001774,
        "pId" : "2001773",
        "name" : "生活在社会主义法治国家",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001775,
        "pId" : "2001773",
        "name" : "民事权利和义务",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001776,
        "pId" : "2001773",
        "name" : "信守合同与违约",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001777,
        "pId" : "2001773",
        "name" : "劳动就业与守法经营",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001778,
        "pId" : "2001773",
        "name" : "家庭与婚姻",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001779,
        "pId" : "2001773",
        "name" : "法律救济",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001780,
        "pId" : "2001749",
        "name" : "公民道德与伦理常识",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001781,
        "pId" : "2001780",
        "name" : "公民道德建设",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001782,
        "pId" : "2001780",
        "name" : "公民的道德生活",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001783,
        "pId" : "2001780",
        "name" : "社会主义市场经济的伦理要求",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001784,
        "pId" : "2001780",
        "name" : "面对科技进步的伦理引导",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001785,
        "pId" : "2001780",
        "name" : "对环境的伦理关怀",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 2001786,
        "pId" : "0",
        "name" : "历史(高中部)",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001787,
        "pId" : "2001786",
        "name" : "古代史",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001788,
        "pId" : "2001787",
        "name" : "古代中国的政治制度",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001789,
        "pId" : "2001788",
        "name" : "夏商周时期的政治制度",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001790,
        "pId" : "2001788",
        "name" : "秦中央集权制度的形成",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001791,
        "pId" : "2001788",
        "name" : "从汉到元的政治演变",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001792,
        "pId" : "2001788",
        "name" : "明清君主专制制度的加强",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001793,
        "pId" : "2001787",
        "name" : "古代中国经济的基本结构与特点",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001794,
        "pId" : "2001793",
        "name" : "农业的主要耕作方式和土地制度",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001795,
        "pId" : "2001793",
        "name" : "手工业的发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001796,
        "pId" : "2001793",
        "name" : "商业的发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001797,
        "pId" : "2001793",
        "name" : "资本主义萌芽与重农抑商和海禁的政策",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001798,
        "pId" : "2001787",
        "name" : "中国传统文化主流思想的演变",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001799,
        "pId" : "2001798",
        "name" : "春秋战国时代的百家争鸣",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001800,
        "pId" : "2001798",
        "name" : "汉代儒学成为正统思想",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001801,
        "pId" : "2001798",
        "name" : "宋明理学",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001802,
        "pId" : "2001798",
        "name" : "明清之际的儒学思想",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001803,
        "pId" : "2001787",
        "name" : "古代中国的科学技术与文学艺术",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001804,
        "pId" : "2001803",
        "name" : "科技成就",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001805,
        "pId" : "2001803",
        "name" : "汉字的起源，演变和书画的发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001806,
        "pId" : "2001803",
        "name" : "文学成就及京剧等剧种的产生与发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001807,
        "pId" : "2001787",
        "name" : "古代希腊罗马的政治制度",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001808,
        "pId" : "2001807",
        "name" : "雅典民主政治",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001809,
        "pId" : "2001807",
        "name" : "罗马法",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001810,
        "pId" : "2001787",
        "name" : "西方人文主义精神的起源",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001811,
        "pId" : "2001786",
        "name" : "近代史",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001812,
        "pId" : "2001811",
        "name" : "西方人文主义精神的发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001813,
        "pId" : "2001812",
        "name" : "文艺复兴和宗教改革",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001814,
        "pId" : "2001812",
        "name" : "启蒙运动",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001815,
        "pId" : "2001811",
        "name" : "资本主义世界市场的形成和发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001816,
        "pId" : "2001815",
        "name" : "新航路的开辟",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001817,
        "pId" : "2001815",
        "name" : "荷兰英国等国的殖民扩张",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001818,
        "pId" : "2001815",
        "name" : "两次工业革命",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001819,
        "pId" : "2001811",
        "name" : "欧美资产阶级代议制的确立与发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001820,
        "pId" : "2001819",
        "name" : "英国君主立宪制的确立",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001821,
        "pId" : "2001819",
        "name" : "美国的联邦制及共和政体的确立",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001822,
        "pId" : "2001819",
        "name" : "资产阶级代议制在欧洲大陆的扩展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001823,
        "pId" : "2001811",
        "name" : "从科学社会主义理论到社会主义制度建立",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001824,
        "pId" : "2001823",
        "name" : "《共产党宣言》的问世",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001825,
        "pId" : "2001823",
        "name" : "巴黎公社",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001826,
        "pId" : "2001811",
        "name" : "近代科学革命与技术革命",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001827,
        "pId" : "2001826",
        "name" : "经典力学",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001828,
        "pId" : "2001826",
        "name" : "生物进化论",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001829,
        "pId" : "2001826",
        "name" : "蒸汽机的的发明，电气技术的应用及现代信息技术",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001830,
        "pId" : "2001811",
        "name" : "19世纪的世界文学艺术",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001831,
        "pId" : "2001830",
        "name" : "文学的主要成就",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001832,
        "pId" : "2001830",
        "name" : "有代表性的美术、音乐作品",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001833,
        "pId" : "2001811",
        "name" : "近代中国反侵略、求民主革命",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001834,
        "pId" : "2001833",
        "name" : "鸦片战争",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001835,
        "pId" : "2001833",
        "name" : "太平天国运动",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001836,
        "pId" : "2001833",
        "name" : "甲午中日战争和八国联军侵华",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001837,
        "pId" : "2001833",
        "name" : "辛亥革命",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001838,
        "pId" : "2001833",
        "name" : "五四运动和中国共产党成立",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001839,
        "pId" : "2001833",
        "name" : "国共政权的对峙",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001840,
        "pId" : "2001833",
        "name" : "抗日战争",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001841,
        "pId" : "2001833",
        "name" : "解放战争",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001842,
        "pId" : "2001811",
        "name" : "近代中国经济结构的变动与资本主义的曲折发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001843,
        "pId" : "2001842",
        "name" : "晚清中国经济结构的变化和民族工业的兴起",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001844,
        "pId" : "2001842",
        "name" : "民国时期民族工业的曲折发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001845,
        "pId" : "2001811",
        "name" : "近代中国的思想解放潮流",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001846,
        "pId" : "2001845",
        "name" : "从“师夷长技”到维新变法",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001847,
        "pId" : "2001845",
        "name" : "新文化运动与马克思主义在中国传播",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001848,
        "pId" : "2001811",
        "name" : "新潮冲击下的社会生活",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001849,
        "pId" : "2001848",
        "name" : "物质生活和社会习惯的变化",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001850,
        "pId" : "2001786",
        "name" : "现代史",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001851,
        "pId" : "2001850",
        "name" : "苏（俄）联的社会主义建设",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001852,
        "pId" : "2001851",
        "name" : "俄国十月革命",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001853,
        "pId" : "2001851",
        "name" : "战时共产主义政策和新经济政策",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001854,
        "pId" : "2001851",
        "name" : "斯大林模式",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001855,
        "pId" : "2001851",
        "name" : "从赫鲁晓夫到戈尔巴乔夫改革",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001856,
        "pId" : "2001850",
        "name" : "罗斯福新政和世界资本主义经济政策的调整",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001857,
        "pId" : "2001856",
        "name" : "1929-1933年资本主义世界经济危机",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001858,
        "pId" : "2001856",
        "name" : "罗斯福新政",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001859,
        "pId" : "2001856",
        "name" : "第二次世界大战后美国等国资本主义的新变化",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001860,
        "pId" : "2001850",
        "name" : "第二次世界大战后世界政治格局的演变",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001861,
        "pId" : "2001860",
        "name" : "美苏两极对峙格局的形成",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001862,
        "pId" : "2001860",
        "name" : "世界多极化趋势",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001863,
        "pId" : "2001850",
        "name" : "第二次世界大战后世界经济的全球化趋势",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001864,
        "pId" : "2001863",
        "name" : "布雷顿森林体系的建立",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001865,
        "pId" : "2001863",
        "name" : "世界经济区域集团化",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001866,
        "pId" : "2001863",
        "name" : "世界经济全球化的趋势",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001867,
        "pId" : "2001850",
        "name" : "现代科学技术",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001868,
        "pId" : "2001867",
        "name" : "相对论与量子论",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001869,
        "pId" : "2001867",
        "name" : "现代信息技术",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001870,
        "pId" : "2001850",
        "name" : "19世纪以来的世界文学艺术",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001871,
        "pId" : "2001870",
        "name" : "19世纪以来的文学",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001872,
        "pId" : "2001870",
        "name" : "19世纪以来的美术",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001873,
        "pId" : "2001870",
        "name" : "影视艺术的产生与发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001874,
        "pId" : "2001850",
        "name" : "现代中国的政治建设与祖国统一",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001875,
        "pId" : "2001874",
        "name" : "新中国的民主政治建设",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001876,
        "pId" : "2001874",
        "name" : "文化大革命及改革开放以来民主与法制建设",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001877,
        "pId" : "2001874",
        "name" : "“一国两制”的理论与实践",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001878,
        "pId" : "2001850",
        "name" : "中国特色社会主义建设的道路",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001879,
        "pId" : "2001878",
        "name" : "中国社会主义建设道路的探索",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001880,
        "pId" : "2001878",
        "name" : "社会主义市场经济体制的建立",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001881,
        "pId" : "2001878",
        "name" : "对外开放格局的初步形成",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001882,
        "pId" : "2001850",
        "name" : "现代中国的对外关系",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001883,
        "pId" : "2001882",
        "name" : "新中国初期的外交",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001884,
        "pId" : "2001882",
        "name" : "开创外交新局面",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001885,
        "pId" : "2001850",
        "name" : "中国近现代社会生活的变迁",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001886,
        "pId" : "2001885",
        "name" : "物质生活和社会习俗的变迁",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001887,
        "pId" : "2001885",
        "name" : "交通、通讯工具的进步",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001888,
        "pId" : "2001885",
        "name" : "大众传媒的发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001889,
        "pId" : "2001850",
        "name" : "20世纪以来中国重大思想理论发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001890,
        "pId" : "2001889",
        "name" : "孙中山的三民主义",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001891,
        "pId" : "2001889",
        "name" : "毛泽东思想",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001892,
        "pId" : "2001889",
        "name" : "新时期的理论成果",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001893,
        "pId" : "2001850",
        "name" : "现代中国的科技，教育与文学艺术",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001894,
        "pId" : "2001893",
        "name" : "科学技术发展的主要成就",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001895,
        "pId" : "2001893",
        "name" : "“百花齐放，百家争鸣”的方针",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001896,
        "pId" : "2001893",
        "name" : "教育事业的发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001897,
        "pId" : "2001850",
        "name" : "现代中国科技发展的主要成就",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001898,
        "pId" : "2001897",
        "name" : "“两弹一星”",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001899,
        "pId" : "2001897",
        "name" : "载人航天",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001900,
        "pId" : "2001897",
        "name" : "袁隆平的杂交水稻",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001901,
        "pId" : "2001786",
        "name" : "其他重要知识点",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001902,
        "pId" : "2001901",
        "name" : "历史上重大改革回眸",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001903,
        "pId" : "2001902",
        "name" : "梭伦改革",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001904,
        "pId" : "2001902",
        "name" : "商鞅变法",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001905,
        "pId" : "2001902",
        "name" : "北魏孝文帝改革",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001906,
        "pId" : "2001902",
        "name" : "王安石变法",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001907,
        "pId" : "2001902",
        "name" : "1861年俄国农奴制改革",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001908,
        "pId" : "2001902",
        "name" : "日本明治维新",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001909,
        "pId" : "2001902",
        "name" : "戊戌变法",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001910,
        "pId" : "2001902",
        "name" : "默罕默德阿里改革",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001911,
        "pId" : "2001902",
        "name" : "欧洲的宗教改革",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001912,
        "pId" : "2001901",
        "name" : "近代社会的民主思想与实践",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001913,
        "pId" : "2001912",
        "name" : "专治理论与民主思想的冲突",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001914,
        "pId" : "2001912",
        "name" : "英国议会与国王的斗争",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001915,
        "pId" : "2001912",
        "name" : "向封建专制统治宣战的檄文",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001916,
        "pId" : "2001912",
        "name" : "构建资产阶级代议制的政治框架",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001917,
        "pId" : "2001912",
        "name" : "法国民主力量与专制势力的斗争",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001918,
        "pId" : "2001912",
        "name" : "无产阶级和人民群众争取民主的斗争",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001919,
        "pId" : "2001912",
        "name" : "近代中国的民主思想与反对专制的斗争",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001920,
        "pId" : "2001901",
        "name" : "20世纪的战争与和平",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001921,
        "pId" : "2001920",
        "name" : "第一次世界大战",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001922,
        "pId" : "2001786",
        "name" : "凡尔赛-华盛顿体系下的和平",
        "subject" : "10017",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 2
    },
    {
        "id" : 2001923,
        "pId" : "2001786",
        "name" : "第二次世界大战",
        "subject" : "10017",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 2
    },
    {
        "id" : 2001924,
        "pId" : "2001786",
        "name" : "雅尔塔体制下的冷战与和平",
        "subject" : "10017",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 2
    },
    {
        "id" : 2001925,
        "pId" : "2001786",
        "name" : "烽火连绵的局部战争",
        "subject" : "10017",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 2
    },
    {
        "id" : 2001926,
        "pId" : "2001786",
        "name" : "和平与发展",
        "subject" : "10017",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 2
    },
    {
        "id" : 2001927,
        "pId" : "2001901",
        "name" : "中外历史人物评说",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001928,
        "pId" : "2001927",
        "name" : "古代中国的政治家",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001929,
        "pId" : "2001927",
        "name" : "东西方的先哲",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001930,
        "pId" : "2001927",
        "name" : "欧美资产阶级革命时代的杰出人物",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001931,
        "pId" : "2001927",
        "name" : "“亚洲觉醒”的先驱",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001932,
        "pId" : "2001927",
        "name" : "无产阶级革命家",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001933,
        "pId" : "2001927",
        "name" : "杰出的科学家",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001934,
        "pId" : "2001901",
        "name" : "探索历史的奥秘",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001935,
        "pId" : "2001934",
        "name" : "历史与历史的重现",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001936,
        "pId" : "2001934",
        "name" : "人类起源之谜",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001937,
        "pId" : "2001934",
        "name" : "三星堆遗址——古蜀文明之谜",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001938,
        "pId" : "2001934",
        "name" : "玛雅文明的消失",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001939,
        "pId" : "2001934",
        "name" : "二里头文化的探索",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001940,
        "pId" : "2001934",
        "name" : "米诺斯宫殿遗址与克里特文明",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001941,
        "pId" : "2001934",
        "name" : "大津巴布韦遗址与非洲文明探秘",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001942,
        "pId" : "2001901",
        "name" : "世界文化遗产荟萃",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001943,
        "pId" : "2001942",
        "name" : "全人类共同的宝贵财富──世界文化遗产",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001944,
        "pId" : "2001942",
        "name" : "古代埃及的历史遗产",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001945,
        "pId" : "2001942",
        "name" : "古代希腊、罗马的历史遗迹",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001946,
        "pId" : "2001942",
        "name" : "欧洲文艺复兴时期的文化遗产",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001947,
        "pId" : "2001942",
        "name" : "中国著名的历史遗迹",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001948,
        "pId" : "2001942",
        "name" : "明清的宫殿、皇家园林和陵墓",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001949,
        "pId" : "2001942",
        "name" : "多姿多彩的中国古城和古村落",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001950,
        "pId" : "2001942",
        "name" : "人类非物质文化遗产──中国昆曲",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 2001951,
        "pId" : "2001942",
        "name" : "具有警示意义的世界文化遗产",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 3001317,
        "pId" : "200736",
        "name" : "基础知识及语言表达",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001318,
        "pId" : "3001317",
        "name" : "字音",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001319,
        "pId" : "3001317",
        "name" : "字形",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001320,
        "pId" : "3001317",
        "name" : "词语",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001321,
        "pId" : "3001317",
        "name" : "语法",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001322,
        "pId" : "3001317",
        "name" : "修辞格",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001323,
        "pId" : "3001317",
        "name" : "成语(熟语)",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001324,
        "pId" : "3001317",
        "name" : "标点符号",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001325,
        "pId" : "3001317",
        "name" : "病句辨析",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001326,
        "pId" : "3001317",
        "name" : "扩展语句、压缩语段",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001327,
        "pId" : "3001326",
        "name" : "扩展语句",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001328,
        "pId" : "3001326",
        "name" : "压缩语段",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001329,
        "pId" : "3001326",
        "name" : "新闻类",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001330,
        "pId" : "3001317",
        "name" : "选用、仿用、变换句式",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001331,
        "pId" : "3001332",
        "name" : "句子衔接",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001332,
        "pId" : "3001317",
        "name" : "语言的简明连贯得体",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001333,
        "pId" : "3001317",
        "name" : "图文转换",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001334,
        "pId" : "3001317",
        "name" : "修改应用文",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001335,
        "pId" : "3001317",
        "name" : "文学常识",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001336,
        "pId" : "200736",
        "name" : "诗歌散文鉴赏",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001337,
        "pId" : "3001336",
        "name" : "先秦诸子百家",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001338,
        "pId" : "3001336",
        "name" : "楚辞汉赋骈文(歌行、乐府)",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001339,
        "pId" : "3001336",
        "name" : "历史记载类(二十四史、地方志、野史等)",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001340,
        "pId" : "3001336",
        "name" : "古代散文、兵法农医、天文术数、艺术杂学等",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001341,
        "pId" : "3001336",
        "name" : "古代应用公文类(含奏议、序跋、赠序、铭文、祭文等)",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001342,
        "pId" : "3001336",
        "name" : "近代文学",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001343,
        "pId" : "3001336",
        "name" : "外国文学",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001344,
        "pId" : "3001336",
        "name" : "诗",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001345,
        "pId" : "3001336",
        "name" : "词",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001346,
        "pId" : "3001336",
        "name" : "曲",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001347,
        "pId" : "3001336",
        "name" : "小说",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001348,
        "pId" : "3001336",
        "name" : "作家作品",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001349,
        "pId" : "200736",
        "name" : "文言文阅读",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001350,
        "pId" : "3001349",
        "name" : "人物传记类",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001351,
        "pId" : "3001349",
        "name" : "历史事件类",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001352,
        "pId" : "3001349",
        "name" : "散文类",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001353,
        "pId" : "3001349",
        "name" : "公文类",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001354,
        "pId" : "200736",
        "name" : "现代文阅读",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001355,
        "pId" : "3001354",
        "name" : "现代文学类文本阅读",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001356,
        "pId" : "3001354",
        "name" : "论述类文本阅读",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001357,
        "pId" : "3001354",
        "name" : "科普类文本阅读",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001358,
        "pId" : "3001357",
        "name" : "自然类文本阅读",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001359,
        "pId" : "3001357",
        "name" : "社科类文本阅读",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001360,
        "pId" : "3001354",
        "name" : "实用类文本阅读",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001361,
        "pId" : "200736",
        "name" : "作文及写作",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001362,
        "pId" : "3001361",
        "name" : "命题作文",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001363,
        "pId" : "3001361",
        "name" : "话题作文",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001364,
        "pId" : "3001361",
        "name" : "材料作文",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001365,
        "pId" : "3001361",
        "name" : "小作文",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001366,
        "pId" : "200736",
        "name" : "名句默写",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001367,
        "pId" : "3001366",
        "name" : "诗",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001368,
        "pId" : "3001366",
        "name" : "词",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001369,
        "pId" : "3001366",
        "name" : "曲",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001370,
        "pId" : "3001366",
        "name" : "其他",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001371,
        "pId" : "200736",
        "name" : "其他",
        "subject" : "10010",
        "grade" : "20203"
    },
    {
        "id" : 3001571,
        "pId" : "200976",
        "name" : "词汇",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001572,
        "pId" : "3001571",
        "name" : "A、B、C、D",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001573,
        "pId" : "3001571",
        "name" : "E、F、G",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001574,
        "pId" : "3001571",
        "name" : "H、I、J、K",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001575,
        "pId" : "3001571",
        "name" : "L、M、N",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001576,
        "pId" : "3001571",
        "name" : "O、P、Q",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001577,
        "pId" : "3001571",
        "name" : "R、S、T",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001578,
        "pId" : "3001571",
        "name" : "U、V、W",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001579,
        "pId" : "3001571",
        "name" : "X、Y、Z",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001580,
        "pId" : "3001571",
        "name" : "词组/短语",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001581,
        "pId" : "200976",
        "name" : "语法",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001582,
        "pId" : "3001581",
        "name" : "名词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001583,
        "pId" : "3001581",
        "name" : "代词/不定代词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001584,
        "pId" : "3001581",
        "name" : "动词/动词短语",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001585,
        "pId" : "3001584",
        "name" : "一般现在时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001586,
        "pId" : "3001584",
        "name" : "一般过去时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001587,
        "pId" : "3001584",
        "name" : "现在进行时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001588,
        "pId" : "3001584",
        "name" : "过去进行时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001589,
        "pId" : "3001584",
        "name" : "将来进行时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001590,
        "pId" : "3001584",
        "name" : "现在完成时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001591,
        "pId" : "3001584",
        "name" : "过去完成时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001592,
        "pId" : "3001584",
        "name" : "一般将来时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001593,
        "pId" : "3001584",
        "name" : "过去将来时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001594,
        "pId" : "3001584",
        "name" : "现在完成进行时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001595,
        "pId" : "3001584",
        "name" : "将来完成时及其被动式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001596,
        "pId" : "3001581",
        "name" : "副词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001597,
        "pId" : "3001581",
        "name" : "介词/介词短语",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001598,
        "pId" : "3001581",
        "name" : "连词/连接词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001599,
        "pId" : "3001581",
        "name" : "数词/量词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001600,
        "pId" : "3001581",
        "name" : "冠词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001601,
        "pId" : "3001581",
        "name" : "形容词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001602,
        "pId" : "3001581",
        "name" : "非谓语动词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001603,
        "pId" : "3001581",
        "name" : "句型",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001604,
        "pId" : "3001603",
        "name" : "简单句与并列句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001605,
        "pId" : "3001603",
        "name" : "复合句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001606,
        "pId" : "3001603",
        "name" : "主谓一致",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001607,
        "pId" : "3001603",
        "name" : "倒装与省略",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001608,
        "pId" : "3001603",
        "name" : "强调句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001609,
        "pId" : "3001603",
        "name" : "虚拟语气",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001610,
        "pId" : "3001603",
        "name" : "插入语",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001611,
        "pId" : "3001603",
        "name" : "固定句型",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001612,
        "pId" : "3001603",
        "name" : "祈使句/感叹句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001613,
        "pId" : "3001603",
        "name" : "疑问句/反义疑问句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001614,
        "pId" : "3001603",
        "name" : "非限制性定语从句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001615,
        "pId" : "3001603",
        "name" : "句型转换",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001616,
        "pId" : "3001603",
        "name" : "定语从句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001617,
        "pId" : "3001603",
        "name" : "表语从句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001618,
        "pId" : "3001603",
        "name" : "宾语从句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001619,
        "pId" : "3001603",
        "name" : "主语从句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001620,
        "pId" : "3001581",
        "name" : "动词时态与语态",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001621,
        "pId" : "3001581",
        "name" : "虚拟语气与情态动词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001622,
        "pId" : "3001581",
        "name" : "主谓一致",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001623,
        "pId" : "3001581",
        "name" : "独立主格结构、with的复合结构",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001624,
        "pId" : "3001581",
        "name" : "情态动词",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001625,
        "pId" : "200976",
        "name" : "完型填空",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001626,
        "pId" : "3001625",
        "name" : "日常生活类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001627,
        "pId" : "3001625",
        "name" : "人生百味类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001628,
        "pId" : "3001625",
        "name" : "科普环保类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001629,
        "pId" : "3001625",
        "name" : "政治经济文化类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001630,
        "pId" : "3001625",
        "name" : "人物传记/故事阅读类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001631,
        "pId" : "3001625",
        "name" : "教育类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001632,
        "pId" : "3001625",
        "name" : "广告布告类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001633,
        "pId" : "3001625",
        "name" : "健康保健类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001634,
        "pId" : "3001625",
        "name" : "社会现象类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001635,
        "pId" : "3001625",
        "name" : "新闻报道类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001636,
        "pId" : "3001625",
        "name" : "社会历史类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001637,
        "pId" : "200976",
        "name" : "阅读理解",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001638,
        "pId" : "3001637",
        "name" : "日常生活类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001639,
        "pId" : "3001637",
        "name" : "人生百味类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001640,
        "pId" : "3001637",
        "name" : "科普环保类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001641,
        "pId" : "3001637",
        "name" : "政治经济文化类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001642,
        "pId" : "3001637",
        "name" : "人物传记/故事类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001643,
        "pId" : "3001637",
        "name" : "教育类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001644,
        "pId" : "3001637",
        "name" : "广告布告类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001645,
        "pId" : "3001637",
        "name" : "健康保健类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001646,
        "pId" : "3001637",
        "name" : "社会现象类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001647,
        "pId" : "3001637",
        "name" : "新闻报道类阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001648,
        "pId" : "3001637",
        "name" : "历史类",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001649,
        "pId" : "200976",
        "name" : "短文改错",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001650,
        "pId" : "200976",
        "name" : "书面表达",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001651,
        "pId" : "3001650",
        "name" : "提纲作文",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001652,
        "pId" : "3001650",
        "name" : "图表作文",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001653,
        "pId" : "3001650",
        "name" : "图画作文",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001654,
        "pId" : "200976",
        "name" : "其他",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001655,
        "pId" : "3001654",
        "name" : "交际用语",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001656,
        "pId" : "3001654",
        "name" : "完成句子",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001657,
        "pId" : "3001654",
        "name" : "阅读填空",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001658,
        "pId" : "3001654",
        "name" : "任务型阅读",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001659,
        "pId" : "3001654",
        "name" : "阅读表达",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001660,
        "pId" : "3001654",
        "name" : "翻译",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001661,
        "pId" : "3001660",
        "name" : "汉译英",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001662,
        "pId" : "3001660",
        "name" : "英译汉",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001663,
        "pId" : "3001654",
        "name" : "单词拼写",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001664,
        "pId" : "3001654",
        "name" : "信息匹配",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001665,
        "pId" : "3001654",
        "name" : "七选五题型",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001666,
        "pId" : "3001654",
        "name" : "对话填空",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001667,
        "pId" : "3001654",
        "name" : "短文填空",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3001668,
        "pId" : "3001654",
        "name" : "语法填空",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 3002321,
        "pId" : "3002",
        "name" : "词义",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3002322,
        "pId" : "3002",
        "name" : "名言警句",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3002323,
        "pId" : "3002",
        "name" : "综合实践学习",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3002324,
        "pId" : "3002",
        "name" : "归纳总结",
        "subject" : "10010",
        "grade" : "20202"
    },
    {
        "id" : 3002586,
        "pId" : "3001581",
        "name" : "状语从句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 20110237,
        "pId" : "20059",
        "name" : "图形的认识",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110238,
        "pId" : "20059",
        "name" : "点、线、面、体",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110239,
        "pId" : "20059",
        "name" : "三视图",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110240,
        "pId" : "20059",
        "name" : "截一个几何体",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110241,
        "pId" : "20059",
        "name" : "直线、射线、线段",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110242,
        "pId" : "20059",
        "name" : "角的概念、分类及表示",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110243,
        "pId" : "20059",
        "name" : "角的度量与计算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110244,
        "pId" : "20059",
        "name" : "余角和补角",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110245,
        "pId" : "20059",
        "name" : "角平分线的性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110246,
        "pId" : "20059",
        "name" : "相交线",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110247,
        "pId" : "20059",
        "name" : "对顶角及性质、邻补角",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110248,
        "pId" : "20059",
        "name" : "垂线、垂线段等概念",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110249,
        "pId" : "20059",
        "name" : "垂线段最短",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110250,
        "pId" : "20059",
        "name" : "点到直线的距离",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110251,
        "pId" : "20059",
        "name" : "同位角、内错角、同旁内角",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110252,
        "pId" : "20059",
        "name" : "平行线",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110253,
        "pId" : "20059",
        "name" : "平行线的性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110254,
        "pId" : "20059",
        "name" : "平行线的判定",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110255,
        "pId" : "20059",
        "name" : "平行线之间的距离",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110256,
        "pId" : "20060",
        "name" : "三角形的概念及分类",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110257,
        "pId" : "20060",
        "name" : "三角形的高线、中线、角平分线",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110258,
        "pId" : "20060",
        "name" : "三角形的内心、外心、重心、垂心",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110259,
        "pId" : "20060",
        "name" : "三角形的稳定性",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110260,
        "pId" : "20060",
        "name" : "三角形的三边关系定理及推论",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110261,
        "pId" : "20060",
        "name" : "三角形内角和定理及推论",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110262,
        "pId" : "20060",
        "name" : "三角形外角",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110263,
        "pId" : "20060",
        "name" : "三角形的面积",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110264,
        "pId" : "20060",
        "name" : "三角形的中位线定理",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110265,
        "pId" : "20060",
        "name" : "全等图形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110266,
        "pId" : "20060",
        "name" : "全等三角形的概念及性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110267,
        "pId" : "20060",
        "name" : "全等三角形的判定",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110268,
        "pId" : "20061",
        "name" : "比例的性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110269,
        "pId" : "20061",
        "name" : "线段的比、成比例线段、黄金分割",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110270,
        "pId" : "20061",
        "name" : "平行线分线段成比例",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110271,
        "pId" : "20061",
        "name" : "图形的相似",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110272,
        "pId" : "20061",
        "name" : "相似三角形的判定",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110273,
        "pId" : "20061",
        "name" : "相似三角形的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110274,
        "pId" : "20061",
        "name" : "相似三角形的周长与面积",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110275,
        "pId" : "20061",
        "name" : "位似",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110276,
        "pId" : "20062",
        "name" : "锐角三角函数的概念及关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110277,
        "pId" : "20062",
        "name" : "特殊角的三角函数值",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110278,
        "pId" : "20062",
        "name" : "用锐角三角函数解决简单的实际问题",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110279,
        "pId" : "20063",
        "name" : "等腰三角形的性质和判定",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110280,
        "pId" : "20063",
        "name" : "等边三角形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110281,
        "pId" : "20064",
        "name" : "勾股定理",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110282,
        "pId" : "20064",
        "name" : "勾股定理逆定理",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110283,
        "pId" : "20064",
        "name" : "直角三角形及其判定和性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110284,
        "pId" : "20064",
        "name" : "解直角三角形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110285,
        "pId" : "20066",
        "name" : "平行四边形的性质和判定",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110286,
        "pId" : "20066",
        "name" : "重心",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110287,
        "pId" : "20066",
        "name" : "多边形的边和正多边形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110288,
        "pId" : "20066",
        "name" : "多边形的内角和外角和",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110289,
        "pId" : "20066",
        "name" : "多边形的对角线",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110290,
        "pId" : "20066",
        "name" : "平面镶嵌",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110291,
        "pId" : "20066",
        "name" : "不规则图形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110292,
        "pId" : "20067",
        "name" : "矩形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110293,
        "pId" : "20067",
        "name" : "菱形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110294,
        "pId" : "20067",
        "name" : "正方形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110295,
        "pId" : "20067",
        "name" : "平行四边形、矩形、菱形、正方形之间的关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110296,
        "pId" : "20068",
        "name" : "梯形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110297,
        "pId" : "20068",
        "name" : "等腰梯形的性质和判定",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110298,
        "pId" : "20068",
        "name" : "梯形的中位线",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110299,
        "pId" : "20070",
        "name" : "圆的有关概念",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110300,
        "pId" : "20070",
        "name" : "圆心角、弧、弦",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110301,
        "pId" : "20070",
        "name" : "圆周角",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110302,
        "pId" : "20070",
        "name" : "垂径定理",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110303,
        "pId" : "20070",
        "name" : "圆内接四边形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110304,
        "pId" : "20070",
        "name" : "相交弦定理",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110305,
        "pId" : "20070",
        "name" : "正多边形与圆",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110306,
        "pId" : "20071",
        "name" : "三角形的内接圆和外接圆",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110307,
        "pId" : "20071",
        "name" : "点与圆的位置关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110308,
        "pId" : "20071",
        "name" : "直线与圆的位置关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110309,
        "pId" : "20071",
        "name" : "切线的性质定理与判定定理",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110310,
        "pId" : "20071",
        "name" : "圆与圆的位置关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110311,
        "pId" : "20072",
        "name" : "圆的周长与弧长公式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110312,
        "pId" : "20072",
        "name" : "扇形的面积",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110313,
        "pId" : "20072",
        "name" : "圆柱与圆锥的侧面积、全面积和体积",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110314,
        "pId" : "20073",
        "name" : "有理数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110315,
        "pId" : "20110314",
        "name" : "正数和负数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110316,
        "pId" : "20110314",
        "name" : "数轴",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110317,
        "pId" : "20110314",
        "name" : "相反数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110318,
        "pId" : "20110314",
        "name" : "绝对值",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110319,
        "pId" : "20110314",
        "name" : "有理数的大小比较",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110320,
        "pId" : "20110314",
        "name" : "有理数的加减法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110321,
        "pId" : "20110314",
        "name" : "有理数的乘除法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110322,
        "pId" : "20110314",
        "name" : "有理数的乘方",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110323,
        "pId" : "20110314",
        "name" : "有理数的混合运算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110324,
        "pId" : "20110314",
        "name" : "科学计数法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110325,
        "pId" : "20110314",
        "name" : "近似数与有效数字",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110326,
        "pId" : "20076",
        "name" : "平方根和算术平方根",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110327,
        "pId" : "20076",
        "name" : "立方根",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110328,
        "pId" : "20076",
        "name" : "无理数的基本概念",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110329,
        "pId" : "20076",
        "name" : "实数的有关概念及分类",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110330,
        "pId" : "20076",
        "name" : "实数的运算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110331,
        "pId" : "20076",
        "name" : "实数的大小比较",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110332,
        "pId" : "20073",
        "name" : "代数式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110333,
        "pId" : "20110332",
        "name" : "代数式及有关概念",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110334,
        "pId" : "20110332",
        "name" : "同类项的有关概念及合并",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110335,
        "pId" : "20077",
        "name" : "整式",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110336,
        "pId" : "20077",
        "name" : "单项式",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110337,
        "pId" : "20077",
        "name" : "多项式",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110338,
        "pId" : "20077",
        "name" : "升幂排序和降幂排序",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110339,
        "pId" : "20077",
        "name" : "整式的加减",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110340,
        "pId" : "20077",
        "name" : "幂的运算",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110341,
        "pId" : "20077",
        "name" : "整式的乘法",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110342,
        "pId" : "20077",
        "name" : "平方差公式和完全平方公式",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110343,
        "pId" : "20077",
        "name" : "整式的除法",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110344,
        "pId" : "20077",
        "name" : "整式的混合运算",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110345,
        "pId" : "20077",
        "name" : "因式分解",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110346,
        "pId" : "20077",
        "name" : "分解因式—提公因式法",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110347,
        "pId" : "20077",
        "name" : "因式分解——换元法",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110348,
        "pId" : "20073",
        "name" : "整式与因式分解",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110349,
        "pId" : "20110348",
        "name" : "整式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110350,
        "pId" : "20110348",
        "name" : "单项式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110351,
        "pId" : "20110348",
        "name" : "多项式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110352,
        "pId" : "20110348",
        "name" : "升幂排序和降幂排序",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110353,
        "pId" : "20110348",
        "name" : "整式的加减",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110354,
        "pId" : "20110348",
        "name" : "幂的运算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110355,
        "pId" : "20110348",
        "name" : "整式的乘法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110356,
        "pId" : "20110348",
        "name" : "平方差公式和完全平方公式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110357,
        "pId" : "20110348",
        "name" : "整式的除法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110358,
        "pId" : "20110348",
        "name" : "整式的混合运算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110359,
        "pId" : "20110348",
        "name" : "因式分解",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110360,
        "pId" : "20110348",
        "name" : "分解因式—提公因式法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110361,
        "pId" : "20110348",
        "name" : "因式分解——换元法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110362,
        "pId" : "20110348",
        "name" : "因式分解——配方法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110363,
        "pId" : "20110348",
        "name" : "因式分解——待定系数法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110364,
        "pId" : "20110348",
        "name" : "分解因式—十字相乘法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110365,
        "pId" : "20110348",
        "name" : "分解因式—分组分解法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110366,
        "pId" : "20110348",
        "name" : "因式分解的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110367,
        "pId" : "20074",
        "name" : "分式及分式的性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110368,
        "pId" : "20074",
        "name" : "分式的通分和约分",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110369,
        "pId" : "20074",
        "name" : "分式的加减",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110370,
        "pId" : "20074",
        "name" : "分式的乘除",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110371,
        "pId" : "20074",
        "name" : "分式的乘方",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110372,
        "pId" : "20074",
        "name" : "分式的混合运算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110373,
        "pId" : "20075",
        "name" : "二次根式的概念和性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110374,
        "pId" : "20075",
        "name" : "二次根式的化简",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110375,
        "pId" : "20075",
        "name" : "二次根式的乘除",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110376,
        "pId" : "20075",
        "name" : "二次根式的加减",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110377,
        "pId" : "20075",
        "name" : "二次根式的混合运算",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110378,
        "pId" : "20080",
        "name" : "从算式到方程",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110379,
        "pId" : "20080",
        "name" : "等式的性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110380,
        "pId" : "20080",
        "name" : "方程的解",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110381,
        "pId" : "20080",
        "name" : "一元一次方程",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110382,
        "pId" : "20080",
        "name" : "一元一次方程的解法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110383,
        "pId" : "20080",
        "name" : "一元一次方程的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110384,
        "pId" : "20080",
        "name" : "二元一次方程组及其解法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110385,
        "pId" : "20080",
        "name" : "二元一次方程组的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110386,
        "pId" : "20080",
        "name" : "三元一次方程组及其解法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110387,
        "pId" : "20079",
        "name" : "一元二次方程的概念",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110388,
        "pId" : "20079",
        "name" : "一元二次方程一般形式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110389,
        "pId" : "20079",
        "name" : "解一元二次方程—配方法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110390,
        "pId" : "20079",
        "name" : "解一元二次方程—公式法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110391,
        "pId" : "20079",
        "name" : "解一元二次方程—直接开平方法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110392,
        "pId" : "20079",
        "name" : "解一元二次方程—因式分解法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110393,
        "pId" : "20079",
        "name" : "一元二次方程根的判别式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110394,
        "pId" : "20079",
        "name" : "一元二次方程根与系数的关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110395,
        "pId" : "20079",
        "name" : "一元二次方程的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110396,
        "pId" : "20081",
        "name" : "不等式及不等关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110397,
        "pId" : "20081",
        "name" : "不等式的解集",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110398,
        "pId" : "20081",
        "name" : "不等式的性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110399,
        "pId" : "20081",
        "name" : "一元一次不等式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110400,
        "pId" : "20081",
        "name" : "一元一次不等式的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110401,
        "pId" : "20081",
        "name" : "在数轴上表示不等式（组）的解集",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110402,
        "pId" : "20081",
        "name" : "一元一次不等式组及其解集",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110403,
        "pId" : "20081",
        "name" : "一元一次不等式(组)的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110404,
        "pId" : "20078",
        "name" : "根式方程",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110405,
        "pId" : "20078",
        "name" : "简单的二元二次方程组",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110406,
        "pId" : "20084",
        "name" : "平面直角坐标系及相关概念",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110407,
        "pId" : "20084",
        "name" : "平面直角坐标系中点的坐标特征",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110408,
        "pId" : "20084",
        "name" : "平面直角坐标系内关于距离的求法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110409,
        "pId" : "20084",
        "name" : "根据坐标描出点的位置",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110410,
        "pId" : "20084",
        "name" : "由点的位置写出它的坐标",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110411,
        "pId" : "20084",
        "name" : "用坐标表示平移",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110412,
        "pId" : "20084",
        "name" : "关于x轴，y轴，原点对称的点的坐标",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110413,
        "pId" : "20084",
        "name" : "平面直角坐标系的简单应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110414,
        "pId" : "20085",
        "name" : "正比例函数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110415,
        "pId" : "20085",
        "name" : "一次函数的表达式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110416,
        "pId" : "20085",
        "name" : "一次函数的图像和性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110417,
        "pId" : "20085",
        "name" : "一次函数的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110418,
        "pId" : "20085",
        "name" : "正比例函数与一次函数的关系",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110419,
        "pId" : "20085",
        "name" : "一次函数与一元一次方程",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110420,
        "pId" : "20085",
        "name" : "一次函数与一元一次不等式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110421,
        "pId" : "20085",
        "name" : "一次函数与二元一次方程（组）",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110422,
        "pId" : "20086",
        "name" : "反比例函数的表达式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110423,
        "pId" : "20086",
        "name" : "反比例函数的图像和性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110424,
        "pId" : "20086",
        "name" : "反比例函数的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110425,
        "pId" : "20087",
        "name" : "二次函数的定义及三种解析式",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110426,
        "pId" : "20087",
        "name" : "二次函数的图像和性质",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110427,
        "pId" : "20087",
        "name" : "二次函数的应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110428,
        "pId" : "20089",
        "name" : "平移",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110429,
        "pId" : "20089",
        "name" : "旋转",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110430,
        "pId" : "20090",
        "name" : "轴对称",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110431,
        "pId" : "20090",
        "name" : "中心对称",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110432,
        "pId" : "20091",
        "name" : "展开与折叠",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110433,
        "pId" : "20091",
        "name" : "中心投影与平行投影",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110434,
        "pId" : "20091",
        "name" : "视图",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110435,
        "pId" : "20092",
        "name" : "作一个角等于已知角",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110436,
        "pId" : "20092",
        "name" : "作角的平分线",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110437,
        "pId" : "20092",
        "name" : "作一条线段等于已知线段",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110438,
        "pId" : "20092",
        "name" : "作线段的垂直平分线",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110439,
        "pId" : "20092",
        "name" : "利用基本图形作三角形",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110440,
        "pId" : "20092",
        "name" : "过一点、两点和不在同一直线上的三点作圆",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110441,
        "pId" : "20092",
        "name" : "尺规作图的步骤",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110442,
        "pId" : "20092",
        "name" : "new item1",
        "subject" : "10011",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110443,
        "pId" : "20094",
        "name" : "随机事件",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110444,
        "pId" : "20094",
        "name" : "事件的分类",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110445,
        "pId" : "20094",
        "name" : "概率的意义",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110446,
        "pId" : "20094",
        "name" : "等可能条件下的概率",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110447,
        "pId" : "20094",
        "name" : "几何概率",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110448,
        "pId" : "20094",
        "name" : "古典概型",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110449,
        "pId" : "20094",
        "name" : "概率的求法及应用",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110450,
        "pId" : "20095",
        "name" : "全面调查与抽样调查",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110451,
        "pId" : "20095",
        "name" : "数据的收集",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110452,
        "pId" : "20095",
        "name" : "统计表和统计图",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110453,
        "pId" : "20095",
        "name" : "个体、总体、样本、样本容量",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110454,
        "pId" : "20095",
        "name" : "频数、频率的概念",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110455,
        "pId" : "20095",
        "name" : "频数（率）分布表",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110456,
        "pId" : "20095",
        "name" : "频数（率）分布直方图",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110457,
        "pId" : "20095",
        "name" : "频数（率）分布折线图",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110458,
        "pId" : "20095",
        "name" : "用样本估计总体",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110459,
        "pId" : "20095",
        "name" : "统计方法解决实际问题",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110460,
        "pId" : "20095",
        "name" : "平均数、中位数、众数",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110461,
        "pId" : "20095",
        "name" : "极差、方差、标准差",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110462,
        "pId" : "20057",
        "name" : "平面向量",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110463,
        "pId" : "20110462",
        "name" : "向量概念",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110464,
        "pId" : "20110462",
        "name" : "平面向量的加法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110465,
        "pId" : "20110462",
        "name" : "平面向量的减法",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20110466,
        "pId" : "200785",
        "name" : "子集与推出关系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110467,
        "pId" : "200789",
        "name" : "含有一个量词的命题的真假判断与否定",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110468,
        "pId" : "200795",
        "name" : "抽象函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110469,
        "pId" : "200795",
        "name" : "分段函数",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110470,
        "pId" : "200795",
        "name" : "函数的运算",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110471,
        "pId" : "200814",
        "name" : "利用导数求切线方程",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110472,
        "pId" : "200829",
        "name" : "三角函数的化简",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110473,
        "pId" : "200829",
        "name" : "三角函数的求值",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110474,
        "pId" : "200860",
        "name" : "数列通项",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110475,
        "pId" : "20110474",
        "name" : "已知数列前几项写数列的通项公式",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110476,
        "pId" : "20110474",
        "name" : "类等差等比数列求通项",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110477,
        "pId" : "20110474",
        "name" : "已知递推关系求通项",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110478,
        "pId" : "20110474",
        "name" : "已知和与项的关系求通项",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110479,
        "pId" : "200860",
        "name" : "数列的增减性与最值",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110480,
        "pId" : "200884",
        "name" : "截面图",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110481,
        "pId" : "200884",
        "name" : "翻折图",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110482,
        "pId" : "200903",
        "name" : "圆与圆的位置关系",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110483,
        "pId" : "200926",
        "name" : "线性回归分析及应用",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110484,
        "pId" : "200926",
        "name" : "独立性检验",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110485,
        "pId" : "200926",
        "name" : "频率分布直方图",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110486,
        "pId" : "200926",
        "name" : "茎叶图",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110487,
        "pId" : "200926",
        "name" : "两点分布",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110488,
        "pId" : "200950",
        "name" : "放缩法",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110489,
        "pId" : "200954",
        "name" : "实系数一元二次方程的解",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110490,
        "pId" : "200968",
        "name" : "相似三角形的判定与性质定理",
        "subject" : "10011",
        "grade" : "20203"
    },
    {
        "id" : 20110552,
        "pId" : "200223",
        "name" : "种子的成分和结构",
        "subject" : "10013",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 20110553,
        "pId" : "200244",
        "name" : "呼吸系统的卫生保健",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110554,
        "pId" : "200235",
        "name" : "人体能量的供给",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110555,
        "pId" : "20110554",
        "name" : "新陈代谢",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110556,
        "pId" : "20110554",
        "name" : "人体所需能量的来源",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110557,
        "pId" : "20110554",
        "name" : "体温",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110558,
        "pId" : "200197",
        "name" : "生物实验",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110559,
        "pId" : "20110558",
        "name" : "调查校园内的生物种类（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110560,
        "pId" : "20110558",
        "name" : "环境因素对生物生活的影响（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110561,
        "pId" : "20110558",
        "name" : "植物细胞和人体口腔上皮细胞临时装片的制作和观察（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110562,
        "pId" : "20110558",
        "name" : "观察人体基本组织（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110563,
        "pId" : "20110558",
        "name" : "观察菜豆和玉米种子的结构（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110564,
        "pId" : "20110558",
        "name" : "种子发芽率的测定（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110565,
        "pId" : "20110558",
        "name" : "观察根毛和根尖结构（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110566,
        "pId" : "20110558",
        "name" : "徒手制作切片和叶片结构的观察(实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110567,
        "pId" : "20110558",
        "name" : "探究绿叶在光下制作有机物（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110568,
        "pId" : "20110558",
        "name" : "探究CO2为光合作用的必需原料（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110569,
        "pId" : "20110558",
        "name" : "探究光合作用可以产生O2（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110570,
        "pId" : "20110558",
        "name" : "种子在萌发过程中的能量变化（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110571,
        "pId" : "20110558",
        "name" : "种子在萌发过程中放出二氧化碳（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110572,
        "pId" : "20110558",
        "name" : "种子在萌发过程中消耗氧气（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110573,
        "pId" : "20110558",
        "name" : "胸围和肺活量的测定(实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110574,
        "pId" : "20110558",
        "name" : "用显微镜观察人血的永久涂片(实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110575,
        "pId" : "20110558",
        "name" : "观察小鱼尾鳍内血液的流动（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110576,
        "pId" : "20110558",
        "name" : "测定反应速度（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110577,
        "pId" : "20110558",
        "name" : "饲养和观察蚯蚓（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110578,
        "pId" : "20110558",
        "name" : "制作孢子印（实验）",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20110579,
        "pId" : "2001085",
        "name" : "维生素",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110580,
        "pId" : "2001106",
        "name" : "生物体内营养物质的转化",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110581,
        "pId" : "20110580",
        "name" : "糖类代谢",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110582,
        "pId" : "20110580",
        "name" : "脂肪代谢",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110583,
        "pId" : "20110580",
        "name" : "蛋白质代谢",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110584,
        "pId" : "2001106",
        "name" : "植物对水和矿质元素的吸收和利用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110585,
        "pId" : "20110584",
        "name" : "水分的吸收和利用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110586,
        "pId" : "20110584",
        "name" : "矿质元素的吸收和利用",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110587,
        "pId" : "2001084",
        "name" : "基因控制蛋白质的合成",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110588,
        "pId" : "20110587",
        "name" : "RNA的种类及功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110589,
        "pId" : "20110587",
        "name" : "转录的场所及所需条件",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110590,
        "pId" : "20110587",
        "name" : "转录的过程和结果",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110591,
        "pId" : "20110587",
        "name" : "翻译的场所及所需条件",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110592,
        "pId" : "20110587",
        "name" : "翻译的过程和结果",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110593,
        "pId" : "2001181",
        "name" : "体液调节的定义及类型",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110594,
        "pId" : "2001181",
        "name" : "激素的发现历程 item1",
        "subject" : "10013",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 4
    },
    {
        "id" : 20110595,
        "pId" : "2001181",
        "name" : "激素的发现历程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110596,
        "pId" : "2001181",
        "name" : "人体主要内分泌腺及其分泌的激素",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110597,
        "pId" : "2001181",
        "name" : "反馈调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110598,
        "pId" : "2001181",
        "name" : "激素调节的特点",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110599,
        "pId" : "2001181",
        "name" : "激素分泌异常导致的病症",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110600,
        "pId" : "2001181",
        "name" : "其他体液调节的方式",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110601,
        "pId" : "2001181",
        "name" : "神经调节与体液调节的关系",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110602,
        "pId" : "2001182",
        "name" : "血脂调剂",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110603,
        "pId" : "2001182",
        "name" : "血压调节",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20110604,
        "pId" : "200315",
        "name" : "物质的弹性、磁性、导电性和导热性等",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110605,
        "pId" : "200315",
        "name" : "宇宙和微观世界",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110606,
        "pId" : "20110605",
        "name" : "分子和原子",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110607,
        "pId" : "20110605",
        "name" : "原子的结构及其核式模型",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110608,
        "pId" : "20110605",
        "name" : "宇宙",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110609,
        "pId" : "20110605",
        "name" : "物质的尺度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110610,
        "pId" : "200322",
        "name" : "力的图示和示意图",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110611,
        "pId" : "200321",
        "name" : "弹力",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110612,
        "pId" : "200329",
        "name" : "同一直线上的二力合成",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110613,
        "pId" : "200361",
        "name" : "熔化和凝固",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110614,
        "pId" : "200361",
        "name" : "汽化和液化 蒸发和沸腾",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110615,
        "pId" : "200361",
        "name" : "升华和凝华",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110616,
        "pId" : "200361",
        "name" : "水循环和水资源利用",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110617,
        "pId" : "200381",
        "name" : "电路图的绘制及实物图的连接",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110618,
        "pId" : "200381",
        "name" : "串联电路和并联电路",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110619,
        "pId" : "200381",
        "name" : "家庭电路及安全用电原则",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110620,
        "pId" : "200376",
        "name" : "凸透镜成像规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110621,
        "pId" : "200376",
        "name" : "应用",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110622,
        "pId" : "200390",
        "name" : "欧姆定律的计算及其应用",
        "subject" : "10014",
        "grade" : "20202",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 5
    },
    {
        "id" : 20110623,
        "pId" : "200389",
        "name" : "欧姆定律的计算及其应用",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110624,
        "pId" : "200411",
        "name" : "运动及运动的相对性",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110625,
        "pId" : "200411",
        "name" : "匀速直线运动",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110626,
        "pId" : "200411",
        "name" : "运动图象",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110627,
        "pId" : "200335",
        "name" : "机械效率",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110628,
        "pId" : "200309",
        "name" : "物理实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110629,
        "pId" : "20110628",
        "name" : "声和光实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110630,
        "pId" : "20110628",
        "name" : "力学实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110631,
        "pId" : "20110628",
        "name" : "物质和能量实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110632,
        "pId" : "20110628",
        "name" : "电与磁实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110633,
        "pId" : "20110629",
        "name" : "声音是怎样产生的",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110634,
        "pId" : "20110629",
        "name" : "声音是怎样传播的",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110635,
        "pId" : "20110629",
        "name" : "光的反射规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110636,
        "pId" : "20110629",
        "name" : "平面镜成像的特点",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110637,
        "pId" : "20110629",
        "name" : "光的折射规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110638,
        "pId" : "20110629",
        "name" : "凸透镜成像的规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110639,
        "pId" : "20110629",
        "name" : "其他声和光实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110640,
        "pId" : "20110630",
        "name" : "用弹簧测力计测力",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110641,
        "pId" : "20110630",
        "name" : "影响滑动摩擦力的因素",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110642,
        "pId" : "20110630",
        "name" : "研究牛顿第一定律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110643,
        "pId" : "20110630",
        "name" : "压力的作用效果与那些因素有关",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110644,
        "pId" : "20110630",
        "name" : "用刻度尺测长度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110645,
        "pId" : "20110630",
        "name" : "用天平称量固体和液体的质量",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110646,
        "pId" : "20110630",
        "name" : "测平均速度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110647,
        "pId" : "20110630",
        "name" : "二力平衡的条件",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110648,
        "pId" : "20110630",
        "name" : "测滑轮组的机械效率",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110649,
        "pId" : "20110630",
        "name" : "探究液体内部的压强规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110650,
        "pId" : "20110630",
        "name" : "探究气体内部的压强规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110651,
        "pId" : "20110630",
        "name" : "液体压强与流速的关系",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110652,
        "pId" : "20110630",
        "name" : "探究浮力的大小与那些因素有关",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110653,
        "pId" : "20110630",
        "name" : "探究杠杆的平衡条件",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110654,
        "pId" : "20110630",
        "name" : "机械效率总是一定的吗",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110655,
        "pId" : "20110630",
        "name" : "动能的大小与哪些因素有关",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110656,
        "pId" : "20110630",
        "name" : "重力势能的大小与哪些因素有关",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110657,
        "pId" : "20110630",
        "name" : "其他力学实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110658,
        "pId" : "20110631",
        "name" : "测量固体和液体的密度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110659,
        "pId" : "20110631",
        "name" : "没有量筒如何测石块的密度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110660,
        "pId" : "20110631",
        "name" : "探究物质质量和体积的关系",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110661,
        "pId" : "20110631",
        "name" : "探究物重与物体质量的关系",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110662,
        "pId" : "20110631",
        "name" : "研究晶体熔化和凝固的过程",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110663,
        "pId" : "20110631",
        "name" : "固体熔化时温度的变化规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110664,
        "pId" : "20110631",
        "name" : "冰加盐后的熔点怎么变化",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110665,
        "pId" : "20110631",
        "name" : "用温度计测水的温度",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110666,
        "pId" : "20110631",
        "name" : "水的沸腾",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110667,
        "pId" : "20110631",
        "name" : "其他物质和能量实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110668,
        "pId" : "20110632",
        "name" : "用电流表测电流 用电压表测电压",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110669,
        "pId" : "20110632",
        "name" : "连接简单的串联电路和并联电路",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110670,
        "pId" : "20110632",
        "name" : "探究串联和并联电路中电流的规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110671,
        "pId" : "20110632",
        "name" : "探究串联和并联电路中电压的规律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110672,
        "pId" : "20110632",
        "name" : "欧姆定律",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110673,
        "pId" : "20110632",
        "name" : "电阻的大小与哪些因素有关",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110674,
        "pId" : "20110632",
        "name" : "用已知电阻和电流表测未知电阻",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110675,
        "pId" : "20110632",
        "name" : "测量与分析电阻的串、并联关系",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110676,
        "pId" : "20110632",
        "name" : "电流做功快慢与哪些因素有关",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110677,
        "pId" : "20110632",
        "name" : "探究影响电磁体磁性强弱的因素",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110678,
        "pId" : "20110632",
        "name" : "什么情况下磁能生电",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110679,
        "pId" : "20110632",
        "name" : "探究通电螺线管外部磁场的方向",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110680,
        "pId" : "20110632",
        "name" : "伏安法测电阻",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110681,
        "pId" : "20110632",
        "name" : "测小灯泡的电功率",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110682,
        "pId" : "20110632",
        "name" : "其他电与磁实验",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110683,
        "pId" : "200309",
        "name" : "物理学史",
        "subject" : "10014",
        "grade" : "20202"
    },
    {
        "id" : 20110684,
        "pId" : "2001287",
        "name" : "胡克定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110685,
        "pId" : "2001284",
        "name" : "力矩和力偶",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110686,
        "pId" : "2001284",
        "name" : "力矩的平衡条件",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110687,
        "pId" : "2001301",
        "name" : "气体的等温变化",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110688,
        "pId" : "2001301",
        "name" : "气体的等容变化",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110689,
        "pId" : "2001301",
        "name" : "气体的等压变化",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110690,
        "pId" : "2001311",
        "name" : "电场和电场线",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110691,
        "pId" : "2001311",
        "name" : "电场力做功与电势差的关系",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110692,
        "pId" : "2001319",
        "name" : "电源的电动势和内阻",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110693,
        "pId" : "2001319",
        "name" : "串联电路和并联电路",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110694,
        "pId" : "2001319",
        "name" : "电阻的串联、并联及应用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110695,
        "pId" : "2001319",
        "name" : "简单逻辑电路和模块式电路",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110696,
        "pId" : "2001319",
        "name" : "集成电路",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110697,
        "pId" : "2001319",
        "name" : "电路故障分析",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110698,
        "pId" : "2001319",
        "name" : "家庭电路和安全用电知识",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110699,
        "pId" : "2001325",
        "name" : "磁通量",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110700,
        "pId" : "2001325",
        "name" : "带电体在复合场中的运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110701,
        "pId" : "2001325",
        "name" : "质谱仪和回旋加速器",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110702,
        "pId" : "2001325",
        "name" : "磁力矩",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110703,
        "pId" : "2001325",
        "name" : "霍尔效应",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110704,
        "pId" : "2001325",
        "name" : "直流电动机",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110705,
        "pId" : "2001331",
        "name" : "右手定则",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110706,
        "pId" : "2001331",
        "name" : "感生电动势",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110707,
        "pId" : "2001331",
        "name" : "动生电动势",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110708,
        "pId" : "2001331",
        "name" : "电磁感应中的能量转化与守恒",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110709,
        "pId" : "2001331",
        "name" : "涡流现象及其应用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110710,
        "pId" : "2001336",
        "name" : "电能的开发和利用",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110711,
        "pId" : "2001341",
        "name" : "传感器的四种重要元件",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110712,
        "pId" : "2001341",
        "name" : "传感器应用的一般模式",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110713,
        "pId" : "2001341",
        "name" : "传感器应用的实例",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110714,
        "pId" : "2001346",
        "name" : "电磁振荡",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110715,
        "pId" : "2001367",
        "name" : "原子核的组成 ",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110716,
        "pId" : "2001393",
        "name" : "把电流表改装成电压表",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110717,
        "pId" : "2001393",
        "name" : "练习使用示波器",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110718,
        "pId" : "2001420",
        "name" : "力学单位制",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110719,
        "pId" : "2001431",
        "name" : "竖直面内的圆周运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110720,
        "pId" : "2001457",
        "name" : "简谐运动的回复力和能量 ",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110721,
        "pId" : "2001464",
        "name" : "波长、频率和波速的关系",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110722,
        "pId" : "2001464",
        "name" : "波的叠加",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110723,
        "pId" : "2001471",
        "name" : "动量和冲量定义",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110724,
        "pId" : "20110723",
        "name" : "动量",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110725,
        "pId" : "20110723",
        "name" : "冲量",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110726,
        "pId" : "2001471",
        "name" : "动量定理",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110727,
        "pId" : "2001471",
        "name" : "动量守恒定律",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110728,
        "pId" : "2001471",
        "name" : "碰撞",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110729,
        "pId" : "20110728",
        "name" : "弹性碰撞",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110730,
        "pId" : "20110728",
        "name" : "非弹性碰撞",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110731,
        "pId" : "20110728",
        "name" : "完全非弹性碰撞",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110732,
        "pId" : "2001471",
        "name" : "爆炸",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110733,
        "pId" : "2001471",
        "name" : "反冲运动",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110734,
        "pId" : "20110733",
        "name" : "反冲现象",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110735,
        "pId" : "20110733",
        "name" : "人船模型",
        "subject" : "10014",
        "grade" : "20203"
    },
    {
        "id" : 20110736,
        "pId" : "200423",
        "name" : "元素周期表",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110737,
        "pId" : "200443",
        "name" : "有关相对分子质量的计算",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110738,
        "pId" : "200448",
        "name" : "意外事故的处理",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110739,
        "pId" : "200448",
        "name" : "实验数据的处理和误差分析",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110740,
        "pId" : "200455",
        "name" : "空气中氧气含量的测定",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110741,
        "pId" : "200458",
        "name" : "氢气的性质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110742,
        "pId" : "200458",
        "name" : "氢气的制取",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110743,
        "pId" : "200461",
        "name" : "二氧化碳的制取",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110744,
        "pId" : "200467",
        "name" : "金属的物理性质",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110745,
        "pId" : "200467",
        "name" : "金属活动性顺序",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110746,
        "pId" : "200467",
        "name" : "铁的冶炼",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110747,
        "pId" : "200471",
        "name" : "浓度",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110748,
        "pId" : "200471",
        "name" : "溶液的配制",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110749,
        "pId" : "200471",
        "name" : "溶质的质量分数",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110750,
        "pId" : "200471",
        "name" : "溶解度曲线",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110751,
        "pId" : "200477",
        "name" : "化合反应和分解反应",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110752,
        "pId" : "200477",
        "name" : "催化剂和催化反应",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110753,
        "pId" : "200480",
        "name" : "酸碱指示剂",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110754,
        "pId" : "200490",
        "name" : "化合反应",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110755,
        "pId" : "200490",
        "name" : "分解反应",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110756,
        "pId" : "200490",
        "name" : "置换反应",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110757,
        "pId" : "200490",
        "name" : "复分解反应",
        "subject" : "10015",
        "grade" : "20202"
    },
    {
        "id" : 20110758,
        "pId" : "2001497",
        "name" : "实验的基本操作",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110759,
        "pId" : "2001497",
        "name" : "实验常用仪器",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110760,
        "pId" : "2001497",
        "name" : "实验常用试剂及试剂的保存",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110761,
        "pId" : "2001497",
        "name" : "实验安全及事故处理",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110762,
        "pId" : "2001523",
        "name" : "质量分数",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110763,
        "pId" : "2001533",
        "name" : "氧化还原反应的基本概念",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110764,
        "pId" : "2001533",
        "name" : "氧化剂和还原剂",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110765,
        "pId" : "2001533",
        "name" : "氧化性、还原性强弱的判断",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110766,
        "pId" : "2001533",
        "name" : "氧化还原反应中的计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110767,
        "pId" : "2001536",
        "name" : "分子式、结构式和结构简式的表达方法",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110768,
        "pId" : "2001534",
        "name" : "相对原子质量和相对分子质量及计算",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110769,
        "pId" : "2001542",
        "name" : "其他常见金属及其重要化合物的性质及应用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110770,
        "pId" : "2001542",
        "name" : "金属材料表面的处理原理",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110771,
        "pId" : "2001542",
        "name" : "金属的冶炼",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110772,
        "pId" : "2001542",
        "name" : "金属腐蚀及防护",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110773,
        "pId" : "2001542",
        "name" : "合金及其常见合金种类",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110774,
        "pId" : "2001564",
        "name" : "催化剂的原理及应用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110775,
        "pId" : "2001569",
        "name" : "缓冲溶液的缓冲处理",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110776,
        "pId" : "2001569",
        "name" : "电离（度）、电离平衡常数Ki",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110777,
        "pId" : "2001569",
        "name" : "电解质在溶液中的导电性",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110778,
        "pId" : "2001569",
        "name" : "常见酸碱指示剂",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110779,
        "pId" : "2001580",
        "name" : "人体必需的化学元素",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110780,
        "pId" : "2001580",
        "name" : "维生素和微量元素对人体健康的重要作用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110781,
        "pId" : "2001580",
        "name" : "常见食品添加剂",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110782,
        "pId" : "2001580",
        "name" : "常见药物的成分及疗效",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110783,
        "pId" : "2001582",
        "name" : "大气污染物",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110784,
        "pId" : "2001582",
        "name" : "减少大气污染的原理和方法",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110785,
        "pId" : "2001582",
        "name" : "水体污染及防治",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110786,
        "pId" : "2001582",
        "name" : "水的提纯",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110787,
        "pId" : "2001582",
        "name" : "饮用水的制备",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110788,
        "pId" : "2001582",
        "name" : "海水的综合利用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110789,
        "pId" : "2001582",
        "name" : "土壤污染",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110790,
        "pId" : "2001582",
        "name" : "对生活废弃物和白色污染的的处置",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110791,
        "pId" : "2001583",
        "name" : "化学发展对自然资源的利用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110792,
        "pId" : "2001583",
        "name" : "天然气成分及用途",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110793,
        "pId" : "2001583",
        "name" : "石油的成分及其分馏、裂化、裂解",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110794,
        "pId" : "2001583",
        "name" : "煤和煤化工",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110795,
        "pId" : "2001583",
        "name" : "汽油、液化气",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110796,
        "pId" : "2001583",
        "name" : "化学对废旧物资再生与综合利用的作用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110797,
        "pId" : "2001584",
        "name" : "材料发展的方向",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110798,
        "pId" : "2001584",
        "name" : "新材料的特点及其生产原理",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110799,
        "pId" : "2001584",
        "name" : "水泥、玻璃和陶瓷的成分及应用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110800,
        "pId" : "2001584",
        "name" : "我国无机化工的生产资源和产品的主要种类",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110801,
        "pId" : "2001585",
        "name" : "重要的化工基本原料",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110802,
        "pId" : "2001585",
        "name" : "硝酸工业及其原理",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110803,
        "pId" : "2001585",
        "name" : "侯氏制碱法",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110804,
        "pId" : "2001585",
        "name" : "氯碱工业和联合制碱工业",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110805,
        "pId" : "2001585",
        "name" : "催化剂的研制对促进化学工业发展的重大意义",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110806,
        "pId" : "2001585",
        "name" : "表面活性剂、精细化工产品的生产特点和用途",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110807,
        "pId" : "2001585",
        "name" : "化学肥料和农药等在农业生产中的作用",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110808,
        "pId" : "2001587",
        "name" : "有机物的反应类型",
        "subject" : "10015",
        "grade" : "20203"
    },
    {
        "id" : 20110809,
        "pId" : "200494",
        "name" : "地球的形状",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110810,
        "pId" : "200494",
        "name" : "地球的大小",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110811,
        "pId" : "200494",
        "name" : "地球仪",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110812,
        "pId" : "200494",
        "name" : "经纬网判读",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110813,
        "pId" : "200494",
        "name" : "三线和五带划分",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110814,
        "pId" : "200495",
        "name" : "地图上的方向",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110815,
        "pId" : "200495",
        "name" : "地图上的比例尺",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110816,
        "pId" : "200495",
        "name" : "图例和注记",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110817,
        "pId" : "200495",
        "name" : "海拔（绝对高度）和相对高度",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110818,
        "pId" : "200495",
        "name" : "从地图获取信息",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110819,
        "pId" : "200495",
        "name" : "等高（深）线地形图的判读与应用",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110820,
        "pId" : "200495",
        "name" : "地形图",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110821,
        "pId" : "200495",
        "name" : "地形剖面图",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110822,
        "pId" : "200496",
        "name" : "地球公转地理意义",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110823,
        "pId" : "200496",
        "name" : "地球自转地理意义",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110824,
        "pId" : "200498",
        "name" : "地球上山系、火山、地震的分布",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110825,
        "pId" : "200502",
        "name" : "天气与气候区别",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110826,
        "pId" : "200502",
        "name" : "简单天气图识度",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110827,
        "pId" : "200502",
        "name" : "人类活动对大气影响",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110828,
        "pId" : "200502",
        "name" : "大气环境保护",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110829,
        "pId" : "200502",
        "name" : "世界气温分布",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110830,
        "pId" : "200502",
        "name" : "世界降水分布",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110831,
        "pId" : "200502",
        "name" : "世界主要气候类型",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110832,
        "pId" : "200502",
        "name" : "影响气候类型因素",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110833,
        "pId" : "200502",
        "name" : "气候对人类的影响",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110834,
        "pId" : "200505",
        "name" : "文化遗产",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110835,
        "pId" : "200497",
        "name" : "地区发展差异",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110836,
        "pId" : "20110835",
        "name" : "发展中国家与发达国家差异",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110837,
        "pId" : "20110835",
        "name" : "发展中国家与发达国家分布",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110838,
        "pId" : "20110835",
        "name" : "国际合作与国际组织",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110839,
        "pId" : "200508",
        "name" : "欧洲概况",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110840,
        "pId" : "200508",
        "name" : "德国",
        "subject" : "10016",
        "grade" : "20202"
    },
    {
        "id" : 20110841,
        "pId" : "2001614",
        "name" : "月球与月相",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110842,
        "pId" : "2001614",
        "name" : "潮汐",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110843,
        "pId" : "2001614",
        "name" : "日食与月食",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110844,
        "pId" : "2001626",
        "name" : "地壳与地壳运动",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110845,
        "pId" : "2001626",
        "name" : "地震与火山",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110846,
        "pId" : "2001626",
        "name" : "岩石与矿物",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110847,
        "pId" : "2001626",
        "name" : "主要地貌类型",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110848,
        "pId" : "2001626",
        "name" : "地貌与经济建设",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110849,
        "pId" : "2001610",
        "name" : "自然资源和能源",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110850,
        "pId" : "20110849",
        "name" : "自然资源的分类",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110851,
        "pId" : "20110849",
        "name" : "自然资源的特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110852,
        "pId" : "20110849",
        "name" : "自然资源与可持续发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110853,
        "pId" : "2001637",
        "name" : "人口的数量变化与人口的合理容量",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110854,
        "pId" : "2001637",
        "name" : "人口的空间变化",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110855,
        "pId" : "2001636",
        "name" : "第三产业与经济发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110856,
        "pId" : "20110855",
        "name" : "第三产业的内容",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110857,
        "pId" : "20110855",
        "name" : "第三产业的地域差异",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110858,
        "pId" : "20110855",
        "name" : "商业的区位",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110859,
        "pId" : "20110855",
        "name" : "城市商业中心的等级体系",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110860,
        "pId" : "20110855",
        "name" : "产业结构升级与优化",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110861,
        "pId" : "2001676",
        "name" : "海水的温度和盐度",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110862,
        "pId" : "2001676",
        "name" : "洋流的分类",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110863,
        "pId" : "2001676",
        "name" : "洋流对环境的影响",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110864,
        "pId" : "2001676",
        "name" : "海岸与海底地形",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110865,
        "pId" : "2001676",
        "name" : "人类与海洋协调发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110866,
        "pId" : "2001676",
        "name" : "海洋可持续发展",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110867,
        "pId" : "2001676",
        "name" : "厄尔尼诺现象",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110868,
        "pId" : "2001676",
        "name" : "拉尼娜现象",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110869,
        "pId" : "2001676",
        "name" : "海洋资源的开发",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110870,
        "pId" : "2001676",
        "name" : "领海、公海和专属经济区",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110871,
        "pId" : "2001677",
        "name" : "旅游的要素和作用",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110872,
        "pId" : "2001677",
        "name" : "旅游资源的分类和特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110873,
        "pId" : "2001677",
        "name" : "旅游资源开发评价",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110874,
        "pId" : "2001677",
        "name" : "我国的旅游资源",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110875,
        "pId" : "2001677",
        "name" : "旅游经管的欣赏",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110876,
        "pId" : "2001677",
        "name" : "旅游资源的开发与保护",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110877,
        "pId" : "2001677",
        "name" : "游客行为相关知识",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110878,
        "pId" : "2001679",
        "name" : "自然灾害的主要类型",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110879,
        "pId" : "2001679",
        "name" : "自然灾害的分布",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110880,
        "pId" : "2001679",
        "name" : "洪水",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110881,
        "pId" : "2001679",
        "name" : "干旱",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110882,
        "pId" : "2001679",
        "name" : "滑坡",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110883,
        "pId" : "2001679",
        "name" : "泥石流",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110884,
        "pId" : "2001679",
        "name" : "地震",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110885,
        "pId" : "2001679",
        "name" : "防灾减灾",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110886,
        "pId" : "2001680",
        "name" : "环境与环境问题",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110887,
        "pId" : "2001680",
        "name" : "环境问题产生的原因",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110888,
        "pId" : "2001680",
        "name" : "解决环境问题的思路",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110889,
        "pId" : "2001680",
        "name" : "环境污染与防治",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110890,
        "pId" : "2001680",
        "name" : "自然资源的利用与保护",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110891,
        "pId" : "2001680",
        "name" : "环境管理与保护",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110892,
        "pId" : "2001680",
        "name" : "生态系统保护",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110893,
        "pId" : "2001681",
        "name" : "中国的地理位置",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110894,
        "pId" : "2001681",
        "name" : "中国的疆域",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110895,
        "pId" : "2001681",
        "name" : "中国的行政区划",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110896,
        "pId" : "2001681",
        "name" : "中国的地形基本特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110897,
        "pId" : "2001681",
        "name" : "中国的主要山脉",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110898,
        "pId" : "2001681",
        "name" : "中国的主要高原",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110899,
        "pId" : "2001681",
        "name" : "中国的主要盆地",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110900,
        "pId" : "2001681",
        "name" : "中国的主要丘陵",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110901,
        "pId" : "2001681",
        "name" : "中国的主要平原",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110902,
        "pId" : "2001681",
        "name" : "中国的气候特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110903,
        "pId" : "2001681",
        "name" : "中国的气候特征成因",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110904,
        "pId" : "2001681",
        "name" : "中国气温的主要特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110905,
        "pId" : "2001681",
        "name" : "中国降水的主要特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110906,
        "pId" : "2001681",
        "name" : "中国主要的河流",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110907,
        "pId" : "2001681",
        "name" : "中国主要的湖泊",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110908,
        "pId" : "2001681",
        "name" : "中国农业",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110909,
        "pId" : "2001681",
        "name" : "中国工业",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110910,
        "pId" : "2001681",
        "name" : "中国交通运输业",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110911,
        "pId" : "2001681",
        "name" : "北方地区自然特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110912,
        "pId" : "2001681",
        "name" : "北方地区人文特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110913,
        "pId" : "2001681",
        "name" : "南方地区自然特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110914,
        "pId" : "2001681",
        "name" : "南方地区人文特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110915,
        "pId" : "2001681",
        "name" : "西北地区自然特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110916,
        "pId" : "2001681",
        "name" : "西北地区人文特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110917,
        "pId" : "2001681",
        "name" : "青藏地区自然特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110918,
        "pId" : "2001681",
        "name" : "青藏地区人文特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110919,
        "pId" : "2001681",
        "name" : "区域发展的主要问题",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110920,
        "pId" : "2001682",
        "name" : "世界海陆分布",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110921,
        "pId" : "2001682",
        "name" : "陆地地形",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110922,
        "pId" : "2001682",
        "name" : "世界气候的地域差异",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110923,
        "pId" : "2001682",
        "name" : "亚洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110924,
        "pId" : "2001682",
        "name" : "亚洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110925,
        "pId" : "2001682",
        "name" : "非洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110926,
        "pId" : "2001682",
        "name" : "非洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110927,
        "pId" : "2001682",
        "name" : "欧洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110928,
        "pId" : "2001682",
        "name" : "欧洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110929,
        "pId" : "2001682",
        "name" : "北美洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110930,
        "pId" : "2001682",
        "name" : "北美洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110931,
        "pId" : "2001682",
        "name" : "南美洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110932,
        "pId" : "2001682",
        "name" : "南美洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110933,
        "pId" : "2001682",
        "name" : "大洋洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203",
        "isDelete" : "1",
        "remark" : null,
        "showLevel" : 3
    },
    {
        "id" : 20110934,
        "pId" : "2001609",
        "name" : "世界地理",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110935,
        "pId" : "20110934",
        "name" : "世界海陆分布",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110936,
        "pId" : "20110934",
        "name" : "陆地地形",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110937,
        "pId" : "20110934",
        "name" : "世界气候的地域差异",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110938,
        "pId" : "20110934",
        "name" : "亚洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110939,
        "pId" : "20110934",
        "name" : "亚洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110940,
        "pId" : "20110934",
        "name" : "非洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110941,
        "pId" : "20110934",
        "name" : "非洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110942,
        "pId" : "20110934",
        "name" : "欧洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110943,
        "pId" : "20110934",
        "name" : "欧洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110944,
        "pId" : "20110934",
        "name" : "北美洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110945,
        "pId" : "20110934",
        "name" : "北美洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110946,
        "pId" : "20110934",
        "name" : "南美洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110947,
        "pId" : "20110934",
        "name" : "南美洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110948,
        "pId" : "20110934",
        "name" : "大洋洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110949,
        "pId" : "20110934",
        "name" : "大洋洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110950,
        "pId" : "20110934",
        "name" : "南极洲自然地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110951,
        "pId" : "20110934",
        "name" : "南极洲人文地理特征",
        "subject" : "10016",
        "grade" : "20203"
    },
    {
        "id" : 20110952,
        "pId" : "200681",
        "name" : "希波战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 20110953,
        "pId" : "200681",
        "name" : "亚历山大东征",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 20110954,
        "pId" : "200681",
        "name" : "罗马帝国的扩张与文化传播",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 20110955,
        "pId" : "200729",
        "name" : "局部战争",
        "subject" : "10017",
        "grade" : "20202"
    },
    {
        "id" : 20110956,
        "pId" : "2001787",
        "name" : "古代东方、美洲、非洲",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110957,
        "pId" : "2001787",
        "name" : "古代伊斯兰世界",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110958,
        "pId" : "2001850",
        "name" : "世纪之交的世界格局",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110959,
        "pId" : "20110958",
        "name" : "东欧剧变",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110960,
        "pId" : "20110958",
        "name" : "德国统一",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110961,
        "pId" : "20110958",
        "name" : "苏联解体",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110962,
        "pId" : "20110958",
        "name" : "多极化趋势加强与一超多强",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110963,
        "pId" : "2001920",
        "name" : "凡尔赛-华盛顿体系下的和平",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110964,
        "pId" : "2001920",
        "name" : "第二次世界大战",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110965,
        "pId" : "2001920",
        "name" : "雅尔塔体制下的冷战与和平",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110966,
        "pId" : "2001920",
        "name" : "烽火连绵的局部战争",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110967,
        "pId" : "2001920",
        "name" : "和平与发展",
        "subject" : "10017",
        "grade" : "20203"
    },
    {
        "id" : 20110968,
        "pId" : "2001685",
        "name" : "商品的含义及基本属性",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110969,
        "pId" : "2001685",
        "name" : "货币的含义、本质和基本职能",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110970,
        "pId" : "2001685",
        "name" : "货币与财富",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110971,
        "pId" : "2001685",
        "name" : "纸币的含义与纸币流通规律",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110972,
        "pId" : "2001685",
        "name" : "结算与信用工具",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110973,
        "pId" : "2001685",
        "name" : "外汇和汇率",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110974,
        "pId" : "2001685",
        "name" : "树立正确的金钱观",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110975,
        "pId" : "2001686",
        "name" : "价值与价格",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110976,
        "pId" : "2001686",
        "name" : "商品的价值量",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110977,
        "pId" : "2001686",
        "name" : "价值决定价格",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110978,
        "pId" : "2001686",
        "name" : "企业提高劳动生产率的意义",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110979,
        "pId" : "2001686",
        "name" : "价值规律及其表现形式",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110980,
        "pId" : "2001686",
        "name" : "供给与需求",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110981,
        "pId" : "2001686",
        "name" : "影响价格的因素",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110982,
        "pId" : "2001686",
        "name" : "价格变动的影响",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110983,
        "pId" : "2001687",
        "name" : "影响消费水平的因素",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110984,
        "pId" : "2001687",
        "name" : "消费的类型和消费结构",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110985,
        "pId" : "2001687",
        "name" : "消费心理",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110986,
        "pId" : "2001687",
        "name" : "消费行为",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110987,
        "pId" : "2001687",
        "name" : "正确的消费原则",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110988,
        "pId" : "2001688",
        "name" : "生产决定消费",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110989,
        "pId" : "2001688",
        "name" : "消费对生产的反作用",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110990,
        "pId" : "2001688",
        "name" : "发展生产的意义",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110991,
        "pId" : "2001688",
        "name" : "公有制的主体地位",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110992,
        "pId" : "2001688",
        "name" : "国有经济及其主导作用",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110993,
        "pId" : "2001688",
        "name" : "多种所有制经济共同发展",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110994,
        "pId" : "2001689",
        "name" : "公司的类型",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110995,
        "pId" : "2001689",
        "name" : "公司的组织形式",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110996,
        "pId" : "2001689",
        "name" : "有限责任公司与股份有限公司",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110997,
        "pId" : "2001689",
        "name" : "公司经营与公司发展",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110998,
        "pId" : "2001689",
        "name" : "企业兼并与企业破产",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20110999,
        "pId" : "2001689",
        "name" : "劳动与就业",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111000,
        "pId" : "2001689",
        "name" : "树立正确的择业观念",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111001,
        "pId" : "2001689",
        "name" : "维护劳动者权益",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111002,
        "pId" : "2001690",
        "name" : "利息、利率与本金",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111003,
        "pId" : "2001690",
        "name" : "储蓄存款",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111004,
        "pId" : "2001690",
        "name" : "商业银行的业务",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111005,
        "pId" : "2001690",
        "name" : "投资收益与投资风险",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111006,
        "pId" : "2001690",
        "name" : "股票",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111007,
        "pId" : "2001690",
        "name" : "债券",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111008,
        "pId" : "2001690",
        "name" : "商业保险",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111009,
        "pId" : "2001690",
        "name" : "融资",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111010,
        "pId" : "2001691",
        "name" : "生产决定分配",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111011,
        "pId" : "2001691",
        "name" : "按劳分配及其作用",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111012,
        "pId" : "2001691",
        "name" : "按劳分配为主体多种分配方式并存",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111013,
        "pId" : "2001691",
        "name" : "收入分配方式对效率、公平的影响",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111014,
        "pId" : "2001691",
        "name" : "提高效率、促进公平",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111015,
        "pId" : "2001692",
        "name" : "财政收入的构成",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111016,
        "pId" : "2001692",
        "name" : "影响财政收入的因素",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111017,
        "pId" : "2001692",
        "name" : "财政支出",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111018,
        "pId" : "2001692",
        "name" : "财政的作用",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111019,
        "pId" : "2001692",
        "name" : "宏观调控",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111020,
        "pId" : "2001692",
        "name" : "财政收支平衡",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111021,
        "pId" : "2001693",
        "name" : "税收的基本特征与种类",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111022,
        "pId" : "2001693",
        "name" : "税收的作用",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111023,
        "pId" : "2001693",
        "name" : "纳税人和负税人",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111024,
        "pId" : "2001693",
        "name" : "依法纳税",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111025,
        "pId" : "2001694",
        "name" : "市场与计划",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111026,
        "pId" : "2001694",
        "name" : "市场调节及其弊端",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111027,
        "pId" : "2001694",
        "name" : "市场配置资源",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111028,
        "pId" : "2001694",
        "name" : "市场秩序",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111029,
        "pId" : "2001694",
        "name" : "社会主义市场经济的特征",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111030,
        "pId" : "2001694",
        "name" : "宏观调控",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111031,
        "pId" : "2001695",
        "name" : "小康社会",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111032,
        "pId" : "2001695",
        "name" : "经济建设的要求",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111033,
        "pId" : "2001695",
        "name" : "科学发展观",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111034,
        "pId" : "2001696",
        "name" : "经济全球化及其表现",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111035,
        "pId" : "2001696",
        "name" : "经济全球化的影响",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111036,
        "pId" : "2001696",
        "name" : "对外开放",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111037,
        "pId" : "2001696",
        "name" : "提高开放型经济水平",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111038,
        "pId" : "2001696",
        "name" : "国际经济组织与国际经济合作",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111039,
        "pId" : "2001696",
        "name" : "“引进来”与“走出去”相结合的战略",
        "subject" : "10018",
        "grade" : "20203"
    },
    {
        "id" : 20111040,
        "pId" : "20057",
        "name" : "命题与证明",
        "subject" : "10011",
        "grade" : "20202"
    },
    {
        "id" : 20111041,
        "pId" : "200219",
        "name" : "被子植物的一生",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111042,
        "pId" : "20111041",
        "name" : "种子的成分和结构",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111043,
        "pId" : "20111041",
        "name" : "种子的萌发",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111044,
        "pId" : "20111041",
        "name" : "植株的生长",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111045,
        "pId" : "20111041",
        "name" : "开花和结果",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111046,
        "pId" : "200219",
        "name" : "绿色植物与生物圈的水循环",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111047,
        "pId" : "20111046",
        "name" : "植物的生活需要无机盐",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111048,
        "pId" : "20111046",
        "name" : "植物的蒸腾作用",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111049,
        "pId" : "20111046",
        "name" : "生物圈的水循环",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111050,
        "pId" : "200219",
        "name" : "绿色植物的光合作用和呼吸作用",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111051,
        "pId" : "20111050",
        "name" : "绿色植物的光合作用",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111052,
        "pId" : "20111050",
        "name" : "绿色植物的呼吸作用",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111053,
        "pId" : "200219",
        "name" : "爱护植被，绿化祖国",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111054,
        "pId" : "200253",
        "name" : "尿液的形成和排出",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111055,
        "pId" : "200253",
        "name" : "汗液的形成和排出",
        "subject" : "10013",
        "grade" : "20202"
    },
    {
        "id" : 20111056,
        "pId" : "2001097",
        "name" : "细胞膜的结构和功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20111057,
        "pId" : "2001097",
        "name" : "生物膜系统的结构功能",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20111058,
        "pId" : "2001103",
        "name" : "原核细胞与真核细胞的区别与联系",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20111059,
        "pId" : "2001160",
        "name" : "遗传病和优生",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20111060,
        "pId" : "2001160",
        "name" : "人类基因组计划及其意义",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20111061,
        "pId" : "2001217",
        "name" : "蛋白质工程",
        "subject" : "10013",
        "grade" : "20203"
    },
    {
        "id" : 20111062,
        "pId" : "0",
        "name" : "语文(小学部)",
        "subject" : "10010",
        "grade" : "20201"
    },
    {
        "id" : 20111063,
        "pId" : "0",
        "name" : "数学(小学部)",
        "subject" : "10011",
        "grade" : "20201"
    },
    {
        "id" : 20111064,
        "pId" : "0",
        "name" : "英语(小学部)",
        "subject" : "10012",
        "grade" : "20201"
    },
    {
        "id" : 30012866,
        "pId" : "3001581",
        "name" : "定语从句",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 30012882,
        "pId" : "3001581",
        "name" : "特殊句式",
        "subject" : "10012",
        "grade" : "20203"
    },
    {
        "id" : 30012885,
        "pId" : "3001581",
        "name" : "交际用语",
        "subject" : "10012",
        "grade" : "20203"
    }
]


function pointTree(zNodes,clickBtn,title,treeCls,fn) {
    //zNodes:树(数组)  clickBtn:调用按钮  title:弹框标题 treeCls:树类型(知识树/章节 fn:回调函数)
    var boxTitle = title || "知识点";
    var pa;
    treeCls ? pa = clickBtn.parent('.' + treeCls + 'TreeWrap') : pa = clickBtn.parent('.treeParent');
    var pointList;//已选中li集合
    var id_arr = [];
    id_arr.length = 0;
    var hidVal = pa.find('.hidVal');
    if ($(hidVal).val() != "") {  //如果 input 的值不等于空
        id_arr = (hidVal.val()).split(',');//读取隐藏域的id  转换成数组，
    }

    for (var i = 0; i < zNodes.length; i++) {//清除zNodes所有checked
        zNodes[i].checked = false;
    }
    //生成树
    var html =  '<div id="treeBox" class="popBox treeBox hide clearfix" title="' + boxTitle + '">';
    html     += '<div class="fl">'
    html     += '<h5>知识点：</h5>'
    html     += '<ul id="treeList" class="clearfix ztree" style="1px solid red; width:300px"></ul>';
    html     += '</div>'
    html     += '<div class="chooseLabel fr"><h5>已选中:</h5>'
    html     +=   '<ul class="labelList clearfix"></ul>'
    html     += '</div>'
    html     += '</div>';
    $("#treeBox").remove();
    $('body').append(html);

    if (id_arr.length > 0) { //隐藏域里面的值对应nodes里面的复选框。
        for (var i = 0; i < id_arr.length; i++) {//重新为zNodes添加checked
            for (var j = 0; j < zNodes.length; j++) {
                //console.log();
                if (zNodes[j].id == id_arr[i]) {
                    zNodes[j].checked = true;
                    pointList = $('<li val='+zNodes[j].id+'><p><span>'+zNodes[j].name+'</span> <em class="labelListClose" ></em></p></li>');
                    pointList.appendTo($('#treeBox .labelList'));
                }
            }
        }
    }

    var setting = {
        check: {enable: true, chkboxType: {"Y": "", "N": ""}},
        data: {simpleData: {enable: true}},
        callback: {onCheck: zTreeOnCheck},
        view: {showIcon: false, showLine: false}
    };
    var treeObj = $.fn.zTree.init($("#treeList"), setting, zNodes);
    //自动展开一级
    //var nodes = treeObj.getNodes();
    //if (nodes.length > 0) {
    //    treeObj.expandNode(nodes[0], true, false, false);
    //}
    $('#treeBox').dialog({
        autoOpen: false,
        width: 600,
        modal: true,
        stack: true,
        close: function () {
            $(this).remove()
        },
        resizable: false,
        buttons: [
            {
                text: "确定",
                click: function () {
                    clickOKBtn();//点击ok的函数
                    $(this).remove();
                }
            },
            {
                text: "取消",
                click: function () {
                    $(this).remove();
                }
            }
        ]
    });
    $("#treeBox").dialog("open");
    //点击树上的checkbox
    function zTreeOnCheck(event, treeId, treeNode) {
        if (treeNode.checked == true) {
            $('#treeBox .labelList').append('<li val="' + treeNode.id + '"  index="' + treeNode.tId + '"><p><span>' + treeNode.name + '</span> <em class="labelListClose"></em></p></li>');
            return false;
        }
        else {
            $('#treeBox .labelList li[val=' + treeNode.id + ']').remove();
            //bOk = treeNode.checked;
            return false;
        }
    }

    //点击ok按钮
    function clickOKBtn() {
        id_arr.length=0;
        /*清空之前存在的知识点*/
         $('.createKnow').empty();
        var newLi=$('.treeBox .labelList li');
        if (newLi.length > 0) {
            for (var i = 0; i < newLi.length; i++) {
                num=$(newLi).eq(i).attr('val')
                id_arr.push(num);
                $('<span class="problem"><em>'+$(newLi).eq(i).text()+'</em><i class="deleteK delete" data='+num+'></i></span>').appendTo($('.createKnow'));
            }
            hidVal.val(id_arr);
        }
    };

}
